#Область ПрограммныйИнтерфейс
#Область Сервис_Нумерации
// Получает следующий номер для указанного объекта и диапазона
//
// Параметры:
//  ОбъектНумерации - СправочникСсылка.ОбъектыНумерации - объект нумерации
//  Подобъект 		- Строка - номер вышестоящего объекта нумерации в рамках которого должен быть выдан номер (если применимо)
//  Диапазон 		- Строка - идентификатор диапазона
//  ДатаНумерации 	- Дата - дата (для объектов нумерации, поддерживающих периодическцю нумерацию)
//
// Возвращаемое значение:
//  Строка - сформированный номер
//
Функция СледующийНомер(ОбъектНумерации, Подобъект = "", Диапазон, ДатаНумерации = Неопределено) Экспорт
// Предпосылки	
	ПроверитьПредпосылки(ОбъектНумерации, Подобъект, Диапазон, ДатаНумерации);
	
	
// Основная часть	
	Если ДатаНумерации = Неопределено Тогда
        ДатаНумерации = ТекущаяУниверсальнаяДата();
    КонецЕсли;
    
    // Получаем параметры нумерации
    ПараметрыНумерации = ПараметрыНумерации(ОбъектНумерации, Диапазон);  
	
	// Может быть для диапазона предусмотрена внешняя (ручная) нумерация => исключение
	Если НЕ ПараметрыНумерации.Автонумерация Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеДиапазонНомеровВнешняяНумерация(ОбъектНумерации.Код, Диапазон);
	КонецЕсли;
	
	// Нужен период, в рамках которого номер должен быть уникальным (если поддерживается)
	ПериодУникальности = ПериодУникальности(ДатаНумерации, ПараметрыНумерации);

	НачатьТранзакцию();
	
	Попытка	
		// Блокируем запись регистра с данными о текущем номере
		БлокироватьДиапазонНомеров(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности);	
		
		// Получаем запись регистра с данными о текущем номере
		ТекущаяЗапись = ТекущаяЗапись(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности, ПараметрыНумерации);
		
		// Увеличиваем номер при необходимости
		Если НЕ ТекущаяЗапись.НачальныйНомер Тогда
			ТекущаяЗапись.ТекущийНомер = ТекущаяЗапись.ТекущийНомер + 1;
		КонецЕсли;
		
		Номер = ТекущаяЗапись.ТекущийНомер; 
		
		// Проверяем новый номер 
		ПроверитьНомерСлужебный(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности, Номер, ПараметрыНумерации);
			
		// Записываем изменения
		ОбновитьТекущийНомер(ТекущаяЗапись); 

		ЗафиксироватьТранзакцию();		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;	
    
    Возврат Номер;
КонецФункции 

// Возвращает параметры нумерации
//	Параметры:
//	 ОбъектНумерации - СправочникСсылка.УН_ОбъектыНумерации - Объект нумерации
//	 ДиапазонНумерации - Строка - Диапазон нумерации (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
//
//	Возвращаемое значение:
//	 Структура - содержит данные настройки для диапазона номеров
//		* Код - Строка - код Объекта нумерации
//		* ПериодичностьНомера - Перечисления.УН_ПериодичностиНомеровДляОбъектовНумерации - Периодичность: НеИспользуется, Год, Месяц, День
//		* ПометкаУдаления - Булево - содерждит Истина, если Объект нумерации помечен на удаление
//		* НомерДиапазона - Строка - идентификатор диапазона
//		* НачальноеЗначение - Число - начальный номер диапазона
//		* КонечноеЗначение - Число - конечный номер диапазона
//		* Автонумерация - Булево - содержит Истина, если номер должен присваиваться автоматически
//		* ИспользоватьПрефикс - содержит Истина, если в номере используется префикс
//		* Префикс - Строка - Префикс. Длина 3 символа.
// 
Функция ПараметрыНумерации(Знач ОбъектНумерации, Знач Диапазон) Экспорт;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УН_ОбъектыНумерации.Код КАК Код,
		|	УН_ОбъектыНумерации.ДлинаНомера КАК ДлинаНомера,		
		|	УН_ОбъектыНумерации.ПериодичностьНомера КАК ПериодичностьНомера,
		|	УН_ОбъектыНумерации.ПометкаУдаления КАК ПометкаУдаления,
		|	УН_ДиапазоныНомеров.НомерДиапазона КАК НомерДиапазона,
		|	УН_ДиапазоныНомеров.НачальноеЗначение КАК НачальноеЗначение,
		|	УН_ДиапазоныНомеров.КонечноеЗначение КАК КонечноеЗначение,
		|	УН_ДиапазоныНомеров.Автонумерация КАК Автонумерация,
		|	УН_ДиапазоныНомеров.ИспользоватьПрефикс КАК ИспользоватьПрефикс,
		|	УН_ДиапазоныНомеров.Префикс КАК Префикс
		|ИЗ
		|	РегистрСведений.УН_ДиапазоныНомеров КАК УН_ДиапазоныНомеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УН_ОбъектыНумерации КАК УН_ОбъектыНумерации
		|		ПО УН_ДиапазоныНомеров.ОбъектНумерации = УН_ОбъектыНумерации.Ссылка
		|ГДЕ
		|	УН_ОбъектыНумерации.Ссылка = &ОбъектНумерации
		|	И УН_ДиапазоныНомеров.НомерДиапазона = &Диапазон"; 
	
	Запрос.УстановитьПараметр("ОбъектНумерации",ОбъектНумерации);
	Запрос.УстановитьПараметр("Диапазон", Диапазон);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеДиапазонНомеровОтсутствует(ОбъектНумерации.Код, Диапазон);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПараметрыНумерации = НовыйПараметрыНумерации();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыНумерации, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат ПараметрыНумерации;
КонецФункции

// Проверяет возможность ручного ввода номера
//
// Параметры:
//  ОбъектНумерации - СправочникСсылка.ОбъектыНумерации
//  Номер - Строка - проверяемый номер
//  Диапазон - Строка - идентификатор диапазона
//  ДатаНумерации - Дата - дата для проверки уникальности
//
// Возвращаемое значение:
//  Булево - true если номер уникален и может быть использован
//
Функция УстановитьВнешнийНомер(ОбъектНумерации, Подобъект="", Диапазон, ДатаНумерации = Неопределено, Номер) Экспорт
// Предпосылки	
	ПроверитьПредпосылки(ОбъектНумерации, Подобъект, Диапазон, ДатаНумерации);
	
	
// Основная часть	
	Если ДатаНумерации = Неопределено Тогда
        ДатаНумерации = ТекущаяУниверсальнаяДата();
    КонецЕсли;
    
    // Получаем параметры нумерации
    ПараметрыНумерации = ПараметрыНумерации(ОбъектНумерации, Диапазон);  
	
	// Может быть для диапазона предусмотрена автоматическая нумерация => исключение
	Если ПараметрыНумерации.Автонумерация Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеДиапазонНомеровАвтоматическаяНумерация(ОбъектНумерации.Код, Диапазон);
	КонецЕсли;
	
	// Нужен период, в рамках которого номер должен быть уникальным (если поддерживается)
	ПериодУникальности = ПериодУникальности(ДатаНумерации, ПараметрыНумерации);

	НачатьТранзакцию();
	
	Попытка	
		// Блокируем регистр с данными о всех номерах
		БлокироватьРеестрНомеров(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности);			 
		
		// Проверяем новый номер 
		ПроверитьНомерСлужебный(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности, Номер, ПараметрыНумерации);
			
		// Записываем изменения
		ТекущаяЗапись = Новый Структура();
		ТекущаяЗапись.Вставить("ОбъектНумерации", ОбъектНумерации);
		ТекущаяЗапись.Вставить("Подобъект", Подобъект);
		ТекущаяЗапись.Вставить("Диапазон", Диапазон);
		ТекущаяЗапись.Вставить("ПериодУникальности", ПериодУникальности);
		ТекущаяЗапись.Вставить("ТекущийНомер", Номер);		
		
		ЗаписатьНовыйНомер(ТекущаяЗапись); 

		ЗафиксироватьТранзакцию();		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;	
    
    Возврат Номер;
КонецФункции

// Проверяет уникальность номера. Возвращает Истина, если номер уникальный и Ложь - в противном случае
Функция ПроверитьУникальностьНомера(ОбъектНумерации, Подобъект = "", Диапазон, ДатаНумерации = Неопределено, Номер) Экспорт;
// Предпосылки	
	ПроверитьПредпосылки(ОбъектНумерации, Подобъект, Диапазон, ДатаНумерации); 
	
	Если Номер = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("Номер");
	КонецЕсли;
	
	
// Основная часть	
	Если ДатаНумерации = Неопределено Тогда
        ДатаНумерации = ТекущаяУниверсальнаяДата();
    КонецЕсли;
    
    // Получаем параметры нумерации
    ПараметрыНумерации = ПараметрыНумерации(ОбъектНумерации, Диапазон);

	ПериодУникальности = ПериодУникальности(ДатаНумерации, ПараметрыНумерации);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УН_НомераОбъектовНумерации.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.УН_НомераОбъектовНумерации КАК УН_НомераОбъектовНумерации
		|ГДЕ
		|	УН_НомераОбъектовНумерации.ОбъектНумерации = &ОбъектНумерации
		|	И УН_НомераОбъектовНумерации.Подобъект = &Подобъект
		|	И УН_НомераОбъектовНумерации.Диапазон = &Диапазон
		|	И УН_НомераОбъектовНумерации.ПериодУникальности = &ПериодУникальности
		|	И УН_НомераОбъектовНумерации.Номер = &Номер";
	
	Запрос.УстановитьПараметр("ОбъектНумерации", ОбъектНумерации);
	Запрос.УстановитьПараметр("Подобъект", Подобъект);   
	Запрос.УстановитьПараметр("Диапазон", Диапазон);
	Запрос.УстановитьПараметр("ПериодУникальности", ПериодУникальности);	
	Запрос.УстановитьПараметр("Номер", Номер);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерУникальный = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерУникальный = Ложь;
	КонецЦикла;
	
	Возврат НомерУникальный;	
КонецФункции	

// Проверяет номер
Функция ПроверитьНомер(ОбъектНумерации, Подобъект = "", Диапазон, ДатаНумерации = Неопределено, Номер) Экспорт;
	ПараметрыНумерации = ПараметрыНумерации(ОбъектНумерации, Диапазон); 
	ПериодУникальности = ПериодУникальности(ДатаНумерации, ПараметрыНумерации);
	ПроверитьНомерСлужебный(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности, Номер, ПараметрыНумерации);  
КонецФункции

#КонецОбласти
#КонецОбласти

#Область Служебные_Функции

// Возвращает текущий номер в диапазоне номеров
Функция ТекущаяЗапись(Знач ОбъектНумерации, Знач Подобъект, Знач Диапазон, Знач ПериодУникальности, Знач ПараметрыНумерации)
	ТекущийНомер = Неопределено; 	// текущий номер отсутствует

	ТекущаяЗапись = НовыйДанныеТекущегоНомера();	
	
    Запрос = Новый Запрос;
    Запрос.Текст = "
    |ВЫБРАТЬ
    |    ДиапазонНомеров.ОбъектНумерации КАК ОбъектНумерации, 
    |    ДиапазонНомеров.Подобъект КАК Подобъект, 
	|    ДиапазонНомеров.Диапазон КАК Диапазон,
    |    ДиапазонНомеров.ПериодУникальности КАК ПериодУникальности,
    |    ДиапазонНомеров.ТекущийНомер КАК ТекущийНомер
    |ИЗ
    |    РегистрСведений.УН_ТекущиеНомераОбъектовНумерации КАК ДиапазонНомеров
    |ГДЕ
    |    ДиапазонНомеров.ОбъектНумерации = &Объект
    |    И ДиапазонНомеров.Подобъект = &Подобъект 
    |    И ДиапазонНомеров.Диапазон = &Диапазон
    |    И ДиапазонНомеров.ПериодУникальности = &ПериодУникальности";        
    
    Запрос.УстановитьПараметр("Объект", ОбъектНумерации);
    Запрос.УстановитьПараметр("Подобъект", Подобъект);
    Запрос.УстановитьПараметр("Диапазон", Диапазон);	 
    Запрос.УстановитьПараметр("ПериодУникальности", ПериодУникальности);
    
    Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		// нет номера => возьмем начальный номер диапазона из настройки 
		Если ПараметрыНумерации.Автонумерация Тогда
			ТекущаяЗапись.ОбъектНумерации 	 = ОбъектНумерации;
			ТекущаяЗапись.Подобъект 		 = Подобъект;
			ТекущаяЗапись.Диапазон 			 = Диапазон;
			ТекущаяЗапись.ПериодУникальности = ПериодУникальности;
			ТекущаяЗапись.ТекущийНомер		 = ПараметрыНумерации.НачальноеЗначение;
			ТекущаяЗапись.НачальныйНомер 	 = Истина;
		КонецЕсли;
	Иначе
    	Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
	        ЗаполнитьЗначенияСвойств(ТекущаяЗапись, Выборка); 
			ТекущаяЗапись.НачальныйНомер = Ложь;		
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТекущаяЗапись; 
КонецФункции

// Обновляет информацию о текущем номере. 
// Обновляет содержимое регистров: УН_ТекущиеНомераОбъектовНумерации и УН_НомераОбъектовНумерации.
Процедура ОбновитьТекущийНомер(ЗаписьДиапазонаНомеров)
	Если ЗаписьДиапазонаНомеров = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ЗаписьДиапазонаНомеров");
	КонецЕсли;
	
	Попытка
		// Обновляем текущий номер в Регистре УН_ТекущиеНомераОбъектовНумерации 
		НаборЗаписей = РегистрыСведений.УН_ТекущиеНомераОбъектовНумерации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОбъектНумерации.Установить(ЗаписьДиапазонаНомеров.ОбъектНумерации); 
		НаборЗаписей.Отбор.Подобъект.Установить(ЗаписьДиапазонаНомеров.Подобъект);	
		НаборЗаписей.Отбор.Диапазон.Установить(ЗаписьДиапазонаНомеров.Диапазон);
		НаборЗаписей.Отбор.ПериодУникальности.Установить(ЗаписьДиапазонаНомеров.ПериодУникальности);	
		
		Если ЗаписьДиапазонаНомеров.НачальныйНомер Тогда
			// начальный номер => создаем новую запись
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ЗаписьДиапазонаНомеров);
		Иначе
			НаборЗаписей.Прочитать();
			Для каждого Запись Из НаборЗаписей Цикл
	            Запись.ТекущийНомер = ЗаписьДиапазонаНомеров.ТекущийНомер;
	        КонецЦикла;
		КонецЕсли;
		НаборЗаписей.Записать(); 
	
		// Добавляем новый номер в Регистр УН_ТекущиеНомераОбъектовНумерации
		ЗаписатьНовыйНомер(ЗаписьДиапазонаНомеров);
	Исключение
		ВызватьИсключение;
	КонецПопытки;	
	
КонецПроцедуры

// Выполняет запись информации о новом номере в регистр УН_НомераОбъектовНумерации 
Процедура ЗаписатьНовыйНомер(Знач ЗаписьНовыйНомер)
	Если ЗаписьНовыйНомер = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ЗаписьНовыйНомер");
	КонецЕсли;
	
	// Регистр УН_НомераОбъектовНумерации	
	Попытка
		НоваяЗапись = РегистрыСведений.УН_НомераОбъектовНумерации.СоздатьМенеджерЗаписи();
		НоваяЗапись.ОбъектНумерации 	= ЗаписьНовыйНомер.ОбъектНумерации;
		НоваяЗапись.Подобъект 			= ЗаписьНовыйНомер.Подобъект;
		НоваяЗапись.Диапазон 			= ЗаписьНовыйНомер.Диапазон;
		НоваяЗапись.ПериодУникальности 	= ЗаписьНовыйНомер.ПериодУникальности; 
		НоваяЗапись.Номер 				= ЗаписьНовыйНомер.ТекущийНомер; 
		
		НоваяЗапись.Записать();	
	Исключение
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

// Форматирует номер согласно параметрам нумерации 
//	Параметры:
//	 Номер - Строка - Номер
//	 Параметры - Структура - см. ПараметрыНумерации()
//
//	Возвращаемое значение:
//	 Строка - номер объекта с учетом требований по нумерации
Функция ФорматироватьНомер(Номер, ПараметрыНумерации, ВыводитьЛидирующиеНули)
	Перем ОбщаяДлинаНомера;
	Перем ИспользоватьПрефикс;
	Перем Префикс;

// Предпосылки
	// номер
	Если Номер = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("Номер");
	КонецЕсли;
		
	// параметры
	Если ПараметрыНумерации = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ПараметрыНумерации");
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыНумерации) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ПараметрыНумерации");
	КонецЕсли; 
	
	Если НЕ ПараметрыНумерации.Свойство("ДлинаНомера", ОбщаяДлинаНомера) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ДлинаНомера", "ПараметрыНумерации");
	КонецЕсли;

	Если НЕ ПараметрыНумерации.Свойство("ИспользоватьПрефикс", ИспользоватьПрефикс) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ИспользоватьПрефикс", "ПараметрыНумерации");
	КонецЕсли;
	
	Если НЕ ПараметрыНумерации.Свойство("Префикс", Префикс) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Префикс", "ПараметрыНумерации");
	КонецЕсли;
	
// Основная часть
    ДлинаНомераБезПрефикса = ОбщаяДлинаНомера;
	Если ИспользоватьПрефикс Тогда
		ДлинаПрефикса = СтрДлина(Префикс);
		ДлинаНомераБезПрефикса = ОбщаяДлинаНомера - ДлинаПрефикса; 
	КонецЕсли;
	
	ШаблонФорматНомера = "ЧЦ=%1; ЧВН=; ЧГ=0";
	ФорматНомера = СтрШаблон(ШаблонФорматНомера, ДлинаНомераБезПрефикса);
	
	Номер = Формат(Номер, ФорматНомера);
    
    // Добавляем ведущие нули
    Если СтрДлина(Номер) < ДлинаНомераБезПрефикса Тогда
        СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Номер, ДлинаНомераБезПрефикса, "0"); 
    КонецЕсли;
    
    // Добавляем префикс
	Если ИспользоватьПрефикс Тогда
        Номер = Префикс + Номер;
    КонецЕсли;
    
    Возврат Номер;  
КонецФункции 

// Выполняет проверку тип и значения входящих параметров. При налиции ошибки вызывает исключение.
Процедура ПроверитьПредпосылки(ОбъектНумерации, Подобъект = "", Диапазон, ДатаНумерации = Неопределено)
    // Объект нумерации
	Если ОбъектНумерации = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ОбъектНумерации");
	КонецЕсли;
	
	Если ОбъектНумерации.ПометкаУдаления Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеОбъектНумерацииПомеченНаУдаление(ОбъектНумерации.Код);	
	КонецЕсли;
	
	// Подобъект
	Если ЗначениеЗаполнено(Подобъект) Тогда
		Попытка
			Подобъект = Строка(Подобъект);
		Исключение
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Подобъект");
		КонецПопытки;	
	КонецЕсли;
		
	// Диапазон
	Если Диапазон = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("Диапазон");
	КонецЕсли;
		
	Если ТипЗнч(Диапазон) <> Тип("Строка") Тогда
		Попытка
			Диапазон = Строка(Диапазон);
		Исключение
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Диапазон");
		КонецПопытки;		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Диапазон) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("Диапазон");
	КонецЕсли;
	
	// Дата нумерации
	Если ДатаНумерации <> Неопределено Тогда
		Если ТипЗнч(ДатаНумерации) <> Тип("Дата") Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ДатаНумерации");
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

// Возвращает период, в рамках которого номер должен быть уникальным или Неопределено, если периодическая нумерация не поддерживается
Функция ПериодУникальности(ДатаНумерации, ПараметрыНумерации)
// Предпосылки
	Если ПараметрыНумерации = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ПараметрыНумерации");
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыНумерации) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ПараметрыНумерации");
	КонецЕсли; 
	
	Если НЕ ПараметрыНумерации.Свойство("ПериодичностьНомера") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ПериодичностьНомера", "ПараметрыНумерации");
	КонецЕсли; 
	 
// Основная часть
	ПериодичностьНеИспользуется = Перечисления.УН_ПериодичностиНомеровДляОбъектовНумерации.НеИспользуется;
	ПериодичностьГод 			= Перечисления.УН_ПериодичностиНомеровДляОбъектовНумерации.Год;
	ПериодичностьМесяц 			= Перечисления.УН_ПериодичностиНомеровДляОбъектовНумерации.Месяц;
	ПериодичностьДень 			= Перечисления.УН_ПериодичностиНомеровДляОбъектовНумерации.День; 
	
	ДатаПоУмолчанию 			= Дата(1,1,1); 
	
	Если ПараметрыНумерации.ПериодичностьНомера = ПериодичностьНеИспользуется Тогда
		Возврат ДатаПоУмолчанию;
	КонецЕсли;
		
	Если ДатаНумерации = Неопределено Тогда  
        ДатаНумерации = ТекущаяУниверсальнаяДата();			
	Иначе		
		Если ТипЗнч(ДатаНумерации) <> Тип("Дата") Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ДатаНумерации");
		КонецЕсли;				
	КонецЕсли;
	
	// год
	Если ПараметрыНумерации.ПериодичностьНомера = ПериодичностьГод Тогда
		ПериодУникальности = НачалоГода(ДатаНумерации); 	
		// месяц	
	ИначеЕсли ПараметрыНумерации.ПериодичностьНомера = ПериодичностьМесяц Тогда
		ПериодУникальности = НачалоМесяца(ДатаНумерации);
		// день	
	ИначеЕсли ПараметрыНумерации.ПериодичностьНомера = ПериодичностьДень Тогда
		ПериодУникальности = НачалоДня(ДатаНумерации);			
	Иначе
		ПериодУникальности = ДатаПоУмолчанию;	
	КонецЕсли;

	
	Возврат ПериодУникальности; 	
КонецФункции

// Устанавливает блокировку для регистра УН_ТекущиеНомераОбъектовНумерации 
Процедура БлокироватьДиапазонНомеров(Знач ОбъектНумерации, Знач Подобъект, Знач Диапазон, Знач ПериодУникальности)
	ДиапазонБлокирован = Ложь;
	СчетчикПопытокБлокировки = 0;
	МаксКоличествоПопыток = 5;	 
	
	Пока НЕ ДиапазонБлокирован Цикл
		Попытка			
			БлокировкаДанных = Новый БлокировкаДанных;
		  	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УН_ТекущиеНомераОбъектовНумерации");
						
			// ПоляБлокировки. Используется для подготовки текста исключения, на случай ошибки блокировки диапазона
			ПоляБлокировки = Новый Массив();
			
			// объект нумерации
		  	ЭлементБлокировкиДанных.УстановитьЗначение("ОбъектНумерации", ОбъектНумерации);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"ОбъектНумерации", Строка(ОбъектНумерации.Код)));			
		  
		  	// подобъект
			ЭлементБлокировкиДанных.УстановитьЗначение("Подобъект", Подобъект); 
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"Подобъект", Подобъект));				
			
			// диапазон
		  	ЭлементБлокировкиДанных.УстановитьЗначение("Диапазон", Диапазон);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"Диапазон", Строка(Диапазон)));			
			
			// период нумерации
			ЭлементБлокировкиДанных.УстановитьЗначение("ПериодУникальности", ПериодУникальности);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"ПериодУникальности", Строка(ПериодУникальности)));	
			
	       	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		  	БлокировкаДанных.Заблокировать();	
			ДиапазонБлокирован = Истина;	
	    Исключение
			// Увеличиваем счетчик неудачных попыток установить блокировку
			СчетчикПопытокБлокировки = СчетчикПопытокБлокировки + 1;
		КонецПопытки;
		
		// Максимальное количество неудачных попыток
		Если СчетчикПопытокБлокировки = МаксКоличествоПопыток Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеБлокировкаНеУстановлена(
				"РегистрСведений.УН_ТекущиеНомераОбъектовНумерации", ПоляБлокировки); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Устанавливает блокировку для регистра УН_НомераОбъектовНумерации
Процедура БлокироватьРеестрНомеров(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности) 
	СписокНомеровБлокирован = Ложь;
	СчетчикПопытокБлокировки = 0;
	МаксКоличествоПопыток = 5;	 
	
	Пока НЕ СписокНомеровБлокирован Цикл
		Попытка			
			БлокировкаДанных = Новый БлокировкаДанных;
		  	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УН_НомераОбъектовНумерации");
						
			// ПоляБлокировки. Используется для подготовки текста исключения, на случай ошибки блокировки диапазона
			ПоляБлокировки = Новый Массив();
			
			// объект нумерации
		  	ЭлементБлокировкиДанных.УстановитьЗначение("ОбъектНумерации", ОбъектНумерации);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"ОбъектНумерации", Строка(ОбъектНумерации.Код)));			
		  
		  	// подобъект
			ЭлементБлокировкиДанных.УстановитьЗначение("Подобъект", Подобъект); 
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"Подобъект", Подобъект));				
			
			// диапазон
		  	ЭлементБлокировкиДанных.УстановитьЗначение("Диапазон", Диапазон);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"Диапазон", Строка(Диапазон)));			
			
			// период нумерации
			ЭлементБлокировкиДанных.УстановитьЗначение("ПериодУникальности", ПериодУникальности);
			ПоляБлокировки.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
				"ПериодУникальности", Строка(ПериодУникальности)));	
			
	       	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		  	БлокировкаДанных.Заблокировать();	
			СписокНомеровБлокирован = Истина;	
	    Исключение
			// Увеличиваем счетчик неудачных попыток установить блокировку	
			СчетчикПопытокБлокировки = СчетчикПопытокБлокировки + 1;
		КонецПопытки;
		
		// Максимальное количество неудачных попыток
		Если СчетчикПопытокБлокировки = МаксКоличествоПопыток Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеБлокировкаНеУстановлена(
				"РегистрСведений.УН_НомераОбъектовНумерации", ПоляБлокировки); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Конструктор ПараметрыНумерации
Функция НовыйПараметрыНумерации()
	ПараметрыНумерации = Новый Структура();
	ПараметрыНумерации.Вставить("Код");
	ПараметрыНумерации.Вставить("ДлинаНомера");
	ПараметрыНумерации.Вставить("ПериодичностьНомера");
	ПараметрыНумерации.Вставить("ПометкаУдаления");
	ПараметрыНумерации.Вставить("НомерДиапазона");
	ПараметрыНумерации.Вставить("НачальноеЗначение");
	ПараметрыНумерации.Вставить("КонечноеЗначение");
	ПараметрыНумерации.Вставить("Автонумерация");
	ПараметрыНумерации.Вставить("ИспользоватьПрефикс");
	ПараметрыНумерации.Вставить("Префикс"); 
	
	Возврат ПараметрыНумерации; 
КонецФункции

// Конструктор ДанныеТекущегоНомера
Функция НовыйДанныеТекущегоНомера()
	ДанныеТекущегоНомера = Новый Структура();
	ДанныеТекущегоНомера.Вставить("ОбъектНумерации");
	ДанныеТекущегоНомера.Вставить("Подобъект");
	ДанныеТекущегоНомера.Вставить("Диапазон");
	ДанныеТекущегоНомера.Вставить("ПериодУникальности");
	ДанныеТекущегоНомера.Вставить("ТекущийНомер");
	ДанныеТекущегоНомера.Вставить("НачальныйНомер");
	
	Возврат ДанныеТекущегоНомера;	
КонецФункции

// Выполняет проверку номера. При наличии ошибок вызывает исключение
Процедура ПроверитьНомерСлужебный(ОбъектНумерации, Подобъект = "", Диапазон, ПериодУникальности, Номер, ПараметрыНумерации) Экспорт;
// Предпосылки
	Если Номер = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("Номер");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Номер) = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("Номер");
	КонецЕсли;	
	
	Если ПараметрыНумерации = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ПараметрыНумерации");
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыНумерации) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ПараметрыНумерации");
	КонецЕсли; 
	
	Если НЕ ПараметрыНумерации.Свойство("ПериодичностьНомера") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ПериодичностьНомера", "ПараметрыНумерации");
	КонецЕсли; 

	Если НЕ ПараметрыНумерации.Свойство("Автонумерация") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Автонумерация", "ПараметрыНумерации");
	КонецЕсли;

	Если НЕ ПараметрыНумерации.Свойство("ДлинаНомера") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ДлинаНомера", "ПараметрыНумерации");
	КонецЕсли;
	
	Если НЕ ПараметрыНумерации.Свойство("ИспользоватьПрефикс") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ИспользоватьПрефикс", "ПараметрыНумерации");
	КонецЕсли;	
	
	Если НЕ ПараметрыНумерации.Свойство("Префикс") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Префикс", "ПараметрыНумерации");
	КонецЕсли;		

// Основная часть
	// Выход за верхнюю границу диапазона
	Если ПараметрыНумерации.Автонумерация Тогда 
		Если Число(Номер) > ПараметрыНумерации.КонечноеЗначение Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеДиапазонНомеровДостигнутКонечныйНомер(ОбъектНумерации.Код, Диапазон); 
		КонецЕсли;  
	КонецЕсли;
	
	// Длина номера в символах
	ОбщаяДлинаНомера = ПараметрыНумерации.ДлинаНомера;	
    Префикс = "";
	Если ПараметрыНумерации.ИспользоватьПрефикс Тогда
		Префикс = ПараметрыНумерации.Префикс;		
	КонецЕсли;
	
	НомерСтрокой = Префикс + Строка(Номер); 
	Если СтрДлина(НомерСтрокой) > ОбщаяДлинаНомера Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПревышенаДлинаНомера(ОбъектНумерации.Код, Диапазон, НомерСтрокой, ОбщаяДлинаНомера) 	
	КонецЕсли;
	
	// Уникальность номера
	НомерУникальный = ПроверитьУникальностьНомера(ОбъектНумерации, Подобъект, Диапазон, ПериодУникальности, Номер); 
	Если НЕ НомерУникальный Тогда
		КлючиУникальности = Новый Массив();
		КлючиУникальности.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
			"ОбъектНумерации", Строка(ОбъектНумерации.Код)));
		КлючиУникальности.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
			"Подобъект", Строка(Подобъект)));
		КлючиУникальности.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
			"Диапазон", Строка(Диапазон)));
		КлючиУникальности.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
			"ПериодУникальности", Строка(ПериодУникальности)));
		
		УН_ИсключенияВызовСервера.ВызватьИсключениеНомерНеУникальный(Номер, КлючиУникальности); 
	КонецЕсли;
КонецПроцедуры


#КонецОбласти