
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ОсновныеДанные;
	
	Параметры.Свойство("ОсновныеДанные",ОсновныеДанные);
	
	// Устанавливаем значения полей по умолчанию
	Организация = ОсновныеДанные.Организация;
	// TODO: Если Организация пустая, то попробовать взять Организацию из настроек Пользователя
	
	ТипИмущественногоКомплекса = ОсновныеДанные.ТипИмущественногоКомплекса;
	ГруппаПолномочий = ОсновныеДанные.ГруппаПолномочий;
	
	АдресОсновныхДанных = ПоместитьВоВременноеХранилище(ОсновныеДанные, 
		УникальныйИдентификатор);
		
		
	// Нужен признак автонумерации для объекта, см. ПриОткрытии()
	АвтонумерацияАктивна = Метаданные.Справочники.УН_ИмущественныеКомплексы.Автонумерация; 
	Если АвтонумерацияАктивна Тогда
		Проверка заполнения = не проверять
	Иначе
		Проверка заполнения = выдавать ошибку
	
	КОнецЕСли
КонецПроцедуры


&НаКлиенте
Процедура СоздатьИмущественныйКомплекс(Команда)
	ЕстьОшибки = Ложь;
	
	// Организация
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не заполнено поле ""Организация""'");
		Сообщение.Поле = "Организация";
		Сообщение.ПутьКДанным = "Организация";
		Сообщение.Сообщить();
		
		ЕстьОшибки = Истина;
	КонецЕсли; 
	
	// Тип имущественного комплекса
	Если НЕ ЗначениеЗаполнено(ТипИмущественногоКомплекса) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не заполнено поле ""Тип имущественного комплекса""'");
		Сообщение.Поле = "ТипИмущественногоКомплекса";		
		Сообщение.ПутьКДанным = "ТипИмущественногоКомплекса";
		Сообщение.Сообщить();		
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	// Группа полномочий
	// Участвует в проверке полномочий, но не является обязательным (может быть пустым) 
	Если НЕ АвтонумерацияАктивна
		И НЕ ЗначениеЗаполнено(Код) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Не заполнено поле ""Код""'");
			Сообщение.Поле = "Код";		
			Сообщение.ПутьКДанным = "Код";
			Сообщение.Сообщить();		
			ЕстьОшибки = Истина;
	КонецЕсли;
	

	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(АдресОсновныхДанных) Тогда
		ОсновныеДанные = ПолучитьИзВременногоХранилища(АдресОсновныхДанных);
		ОсновныеДанные.Организация = Организация;
		ОсновныеДанные.ГруппаПолномочий = ГруппаПолномочий;
		ОсновныеДанные.ТипИмущественногоКомплекса = ТипИмущественногоКомплекса;    
		
		// Код
		// Имеет смысл если автонумерация для объекта не активна
		Если НЕ АвтонумерацияАктивна Тогда
			ОсновныеДанные.Код = Код;
		КонецЕсли; 
	Иначе
		ОсновныеДанные = Неопределено;
	КонецЕсли;
	
	
	
	Закрыть(ОсновныеДанные);
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КодИмущественногоКомплекса.Видимость = НЕ АвтонумерацияАктивна;
КонецПроцедуры


