////////////////////////////////////////////////////////////////////////////////
// Имущественный комплекс
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

#Область УнаследованныеОтБазовогоКласса

Процедура ЗарегистрироватьПотомка(Объект, НазваниеПотомка, Потомок) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(Объект, НазваниеПотомка, Потомок);
КонецПроцедуры

Процедура ЗарегистрироватьВсехПотомков(Объект) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(Объект);
КонецПроцедуры

Функция ЗарегистрироватьРасширение(Объект, ИмяРасширения) Экспорт;
	Возврат УН_БазовыйОбъект.ЗарегистрироватьРасширение(Объект, ИмяРасширения);
КонецФункции

Функция ИнициализироватьПоОбразцу(Объект, Образец) Экспорт;
	Возврат УН_БазовыйОбъект.ИнициализироватьПоОбразцу(Объект, Образец);
КонецФункции

Процедура ЗаполнитьИзВременногоХранилища(Объект, Знач Адрес) Экспорт; 
	УН_БазовыйОбъект.ЗаполнитьИзВременногоХранилища(Объект, Адрес);	
КонецПроцедуры

Процедура ПроверитьВсе(Объект, ЖурналСообщений) Экспорт;
	УН_БазовыйОбъект.ПроверитьВсе(Объект, ЖурналСообщений);
КонецПроцедуры

Процедура ЗаписатьВсе(Объект, ЖурналСообщений) Экспорт;      
	УН_БазовыйОбъект.ЗаписатьВсе(Объект, ЖурналСообщений);
КонецПроцедуры

Процедура УстановитьРежим(Объект, Знач Режим) Экспорт;
	УН_БазовыйОбъект.УстановитьРежим(Объект,Режим); 			
КонецПроцедуры
   
Функция Режим(Объект) Экспорт;  
	Возврат УН_БазовыйОбъект.Режим(Объект);
КонецФункции

#КонецОбласти


#Область УнаследованныеОтБизнесОбъекта

// Возвращает бизнес-номер объекта 
Функция Идентификатор(Объект) Экспорт;  
	Возврат УН_БизнесОбъект.Идентификатор(Объект);	
КонецФункции  

// Возвращает тип бизнес-объекта
Функция ТипБизнесОбъекта(Объект) Экспорт;
   	Возврат УН_БизнесОбъект.ТипБизнесОбъекта(Объект);
КонецФункции

#КонецОбласти


#Область ИмущественныйКомплекс      

// Начальная инициализация объекта
Процедура ИнициализироватьПоРодителю(Объект, Родитель) Экспорт;  
КонецПроцедуры

// Возвращает объект - Менеджер измерений 
Функция МенеджерИзмерений(Объект) Экспорт;
	Результат = Неопределено;
	
	// Получить список с потомками
	Попытка
		СвойстваОбъекта = Объект.ДополнительныеСвойства;
		Потомки = СвойстваОбъекта.Потомки;
	Исключение
		// Обработка ошибок
		Сообщить("Невозможно получить значение свойства ""Потомки""");  
		Возврат Неопределено;
	КонецПопытки; 
	
	// Ищем в Потомках
	МенеджерИзмерений = Потомки.Получить("УН_Измерения");
	
	// Менеджер измерений не зарегистрирован => создадим.   
	Если МенеджерИзмерений = Неопределено Тогда
		
		МенеджерИзмерений = УН_МенеджерИзмеренийФабрика.Создать(Объект);	
	
		// добавим созданный объект в список потомков
		ЗарегистрироватьПотомка(Объект, "УН_Измерения", МенеджерИзмерений); 
	КонецЕсли;	                                                    
	
	Результат = МенеджерИзмерений;
	Возврат Результат;
КонецФункции

// Возвращает объект - Менеджер статусов 
Функция МенеджерСтатусов(Объект) Экспорт; 
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

// Реализует конкретную функциональность проверки объекта
//
// Параметры:
//  * Объект - Объект метаданных - проверяемый объект
//  * ЖурналСообщений - ТаблицаЗначений содержит список сообщений
Процедура ОбъектПроверить(Объект, ЖурналСообщений);
	
	// Проверка 1		
		
	// Проверка 2
	
	// Проверка 3	
	
КонецПроцедуры    

// Реализует конкретную функциональность записи объекта в базу (сохранения изменений)
Процедура ОбъектЗаписать(Объект, ЖурналСообщений)
	// запомним значение перечисления для режима "Просмотр"
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр;	
	
	// Выполнить проверки перед сохранением
	
	
	// Если ошибок не возникло - сохраняем.
	Попытка
		Если Объект.Модифицированность() Тогда
			Объект.Записать();
			// меняем режим на "просмотр"
			Объект.ДополнительныеСвойства.Режим = РежимПросмотр;
		КонецЕсли;		
	Исключение
		// Обработка ошибок
		Сообщить("Возникла ошибка при сохранении объекта ""Имущественный комплекс""");  
	КонецПопытки; 	
КонецПроцедуры  

// Реализует конкретную функциональность регистрации всех потомков
Процедура ОбъектЗарегистрироватьВсехПотомков(Объект)
	
	МенеджерИзмерений(Объект);
	МенеджерСтатусов(Объект);
	// ...
КонецПроцедуры

Процедура ОбъектЗаполнитьИзВременногоХранилища(Объект, Знач Адрес)
	// Метод фактически не используется для Имущественого комплекса. 
	// Данные заполняются на основании значений основного реквизита формы
КонецПроцедуры


#КонецОбласти 



#КонецОбласти


