////////////////////////////////////////////////////////////////////////////////
// Модуль наблора записей: Измерения
//  
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс 

#Область УнаследованныеОтБазовогоКласса

Процедура ЗарегистрироватьПотомка(НазваниеПотомка, Потомок) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(ЭтотОбъект, НазваниеПотомка, Потомок);
КонецПроцедуры

Процедура ЗарегистрироватьВсехПотомков() Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьВсехПотомков(ЭтотОбъект);
КонецПроцедуры

Функция ЗарегистрироватьРасширение(ИмяРасширения) Экспорт;
	Возврат УН_БазовыйОбъект.ЗарегистрироватьРасширение(ЭтотОбъект, ИмяРасширения);
КонецФункции 


Функция ИнициализироватьПоОбразцу(Образец) Экспорт;
	Возврат УН_БазовыйОбъект.ИнициализироватьПоОбразцу(ЭтотОбъект, Образец);
КонецФункции

Процедура ЗаполнитьИзВременногоХранилища(Знач Адрес) Экспорт;
	УН_БазовыйОбъект.ЗаполнитьИзВременногоХранилища(ЭтотОбъект, Адрес);
КонецПроцедуры



Процедура ПроверитьВсе(ЖурналСообщений) Экспорт;
	УН_БазовыйОбъект.ПроверитьВсе(ЭтотОбъект, ЖурналСообщений);
КонецПроцедуры


Процедура ЗаписатьВсе(ЖурналСообщений) Экспорт;      
	УН_БазовыйОбъект.ЗаписатьВсе(ЭтотОбъект, ЖурналСообщений);
КонецПроцедуры

// Устанавливает режим для объекта (Создание/Изменение/Просмотр)
Процедура УстановитьРежим(Знач Режим) Экспорт;
	УН_БазовыйОбъект.УстановитьРежим(ЭтотОбъект,Режим); 			
КонецПроцедуры


// Возвращает режим Объекта (Создание/Изменение/Просмотр)   
Функция Режим() Экспорт;  
	Возврат УН_БазовыйОбъект.Режим(ЭтотОбъект);
КонецФункции

#КонецОбласти


#Область УнаследованныеОтМенеджераИзмерений
// Начальная инициализация объекта
Процедура ИнициализироватьПоРодителю(Родитель) Экспорт; 
	УН_МенеджерИзмерений.ИнициализироватьПоРодителю(ЭтотОбъект,Родитель);	
КонецПроцедуры
	
// Создает запись об измерении и добавляет ее в набор записей.
Функция ДобавитьЗапись(Запись) Экспорт; 
	Возврат УН_МенеджерИзмерений.ДобавитьЗапись(ЭтотОбъект,Запись);
КонецФункции

// Возвращает запись по ключу в формате структуры записи об измерении.
Функция ПолучитьЗапись(МенеджерИзмерений, ВидИзмерения, ДействуетС) Экспорт; 
	Возврат УН_МенеджерИзмерений.ПолучитьЗапись(ЭтотОбъект, ВидИзмерения, ДействуетС);
КонецФункции

// Удаляет запись по ключу. Возвращает номер удаленной записи или -1, если запись для удаления не найдена.
Функция УдалитьЗапись(МенеджерИзмерений, ВидИзмерения, ДействуетС) Экспорт; 
	Возврат УН_МенеджерИзмерений.УдалитьЗапись(ЭтотОбъект,ВидИзмерения, ДействуетС);
КонецФункции

// Возвращает список всех записей в формате таблицы значений
Функция ВсеИзмерения() Экспорт; 
	Возврат УН_МенеджерИзмерений.ВсеИзмерения(ЭтотОбъект);
КонецФункции



#КонецОбласти
 	
#КонецОбласти
