#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем 

#Область УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт

	// Организация
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "Организации";
    ВидДоступа.Представление = НСтр("ru = 'Организации'");
    ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	
	// ТипыИмущественныхКомплексов	
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "УН_ТипыИмущественныхКомплексов";
    ВидДоступа.Представление = НСтр("ru = 'Типы имущественных комплексов'");
    ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.УН_ТипыИмущественныхКомплексов");
	
	// ГруппыПолномочий	
	ВидДоступа = ВидыДоступа.Добавить();
    ВидДоступа.Имя = "УН_ГруппыПолномочий";
    ВидДоступа.Представление = НСтр("ru = 'ГруппыПолномочий'");
    ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.УН_ГруппыПолномочий");
	
КонецПроцедуры


// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт 
	// Пример:	
	// Списки.Вставить(Метаданные.Справочники._ДемоБанковскиеСчета, Истина);
	// Списки.Вставить(Метаданные.Справочники._ДемоВидыНоменклатуры, Истина);
	
	Списки.Вставить(Метаданные.Справочники.УН_ИмущественныеКомплексы, Истина);	
КонецПроцедуры  

#КонецОбласти

#КонецОбласти 

#КонецОбласти

