

// Параметры нумерации
&НаСервере
Процедура ПолучитьПараметрыНумерацииНаСервере()
	ПараметрыНумерации.Очистить();
	СтруктураПараметрыНумерации = УН_СервисНумерации.ПараметрыНумерации(ОбъектНумерации, Диапазон); 
	
	Если СтруктураПараметрыНумерации = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Параметры нумерации не заполнены!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	Для Каждого Параметр Из СтруктураПараметрыНумерации Цикл
		НовыйЭлемент = ПараметрыНумерации.Добавить(
			Параметр.Ключ,			
			Параметр.Значение); 					
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыНумерации(Команда)
	ПолучитьПараметрыНумерацииНаСервере();
КонецПроцедуры



// Уникальность номера
&НаСервере
Процедура ПроверитьУникальностьНомераНаСервере()
	НомерУникальный = УН_СервисНумерации.ПроверитьУникальностьНомера(
		ОбъектНумерации, 
		Подобъект, 
		Диапазон, 
		ДатаНумерации, 
		ТекущийНомер);
		
	Если НомерУникальный Тогда
		ТекстСообщения = "Номер уникальный!";
	Иначе
		ТекстСообщения = "Номер не уникальный!";
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУникальностьНомера(Команда)
	ПроверитьУникальностьНомераНаСервере();
КонецПроцедуры



// Получить следующий номер
&НаСервере
Процедура ПолучитьСледующийНомерНаСервере()
	ТекущийНомер = "";
	НовыйНомер = УН_СервисНумерации.СледующийНомер(
		ОбъектНумерации,
		Подобъект,
		Диапазон,
		ДатаНумерации); 
		
	ТекущийНомер = НовыйНомер; 
		
	Если НовыйНомер = Неопределено ИЛИ 
	  НЕ ЗначениеЗаполнено(НовыйНомер) Тогда 	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Номер пустой / не получен!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСледующийНомер(Команда)
	ПолучитьСледующийНомерНаСервере();
КонецПроцедуры

// Установить внешний номер
&НаСервере
Процедура УстановитьВнешнийНомерНаСервере()
	ВнешнийНомер = УН_СервисНумерации.УстановитьВнешнийНомер(
		ОбъектНумерации,
		Подобъект,
		Диапазон,
		ДатаНумерации,
		ТекущийНомер); 
	
	Если ВнешнийНомер = Неопределено ИЛИ 
	  НЕ ЗначениеЗаполнено(ВнешнийНомер) Тогда 	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Номер пустой / не получен!";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВнешнийНомер(Команда)
	УстановитьВнешнийНомерНаСервере();
КонецПроцедуры
