
&НаСервере
Процедура ВыполнитьНаСервере()
		
	МассивТипыОпераций = Новый Массив;
	Отбор = Новый Структура;
	
	// тип объекта метаданных
	Если ЗначениеЗаполнено(ПроизвольныйТипОбъекта) Тогда
		Отбор.Вставить("Метаданные", Метаданные.НайтиПоПолномуИмени(ПроизвольныйТипОбъекта));
	ИначеЕсли ВыборИмущественныхКомплексов Тогда
		Отбор.Вставить("Метаданные", Метаданные.Справочники.УН_ИмущественныеКомплексы);
	Иначе
		Возврат;
	КонецЕсли;
	
	// типы операций
	Если ОперацияСоздание Тогда
		МассивТипыОпераций.Добавить(ВидИзмененияДанных.Добавление);
	КонецЕсли; 
		Если ОперацияИзменение Тогда
		МассивТипыОпераций.Добавить(ВидИзмененияДанных.Изменение);
	КонецЕсли;
	Если ОперацияУдаление Тогда
		МассивТипыОпераций.Добавить(ВидИзмененияДанных.Удаление);
	КонецЕсли;
	Если МассивТипыОпераций.Количество()>0 Тогда
		Отбор.Вставить("ВидИзмененияДанных", МассивТипыОпераций); 
	КонецЕсли;
		
	// период
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Отбор.Вставить("ДатаНачала",ДатаНачала);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Отбор.Вставить("ДатаОкончания",ДатаОкончания);
	КонецЕсли;
	
	// пользователь
	Если ЗначениеЗаполнено(КритерийВыбораПользователь) Тогда
		Отбор.Вставить("Пользователь",КритерийВыбораПользователь.Ссылка);
	КонецЕсли;
	
    
	//Отбор.Вставить("Данные", БитаяСсылка); 
	НачалоЗамера=ТекущаяУниверсальнаяДатаВМиллисекундах();
	Версии = ИсторияДанных.ВыбратьВерсии(Отбор,,,); 
	
	КонецЗамера=ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	Время = КонецЗамера-НачалоЗамера; 

	КоличествоВерсий = Версии.Количество();
	Версии.Сортировать("Данные,НомерВерсии");
	
	РезультатОтчета.Очистить();
	
	
	Для Каждого Версия из Версии Цикл
		// создаем шаблон строки
		Шаблон = РезультатОтчета.Добавить();
		Шаблон.Объект			= Версия.ПредставлениеДанных;
		Шаблон.ДатаВремя 		= Версия.Дата;
		Шаблон.НомерВерсии 		= Версия.НомерВерсии;
		Шаблон.ИмяПользователя	= Версия.ИмяПользователя;
		Шаблон.ВидИзменения		= Версия.ВидИзмененияДанных;  
		
		
		Если ПоказыватьТолькоВерсии Тогда
			Продолжить;
		КонецЕсли;
		// заполняем значениями
		Если    Версия.НомерВерсии = 1 
			ИЛИ Версия.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда 
			// новая версия => показать все данные объекта 
           	ДанныеВерсии = ИсторияДанных.ПолучитьДанныеВерсии(Версия.Данные,
				Версия.НомерВерсии);
			Для каждого Поле из ДанныеВерсии Цикл
				НоваяСтрока = РезультатОтчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Шаблон); 
				НоваяСтрока.ИмяРеквизита 	= Поле.Ключ;
				НоваяСтрока.НовоеЗначение 	= Поле.Значение;
			КонецЦикла;					
			
		ИначеЕсли Версия.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			// ничего не делаем
			
		Иначе
			// показать разницу версий
			ДанныеВерсии = ИсторияДанных.ПолучитьРазличияВерсий(Версия.Данные,
				Версия.НомерВерсии,);
			Для каждого Поле из ДанныеВерсии Цикл
				НоваяСтрока = РезультатОтчета.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Шаблон); 
				НоваяСтрока.ИмяРеквизита 	= Поле.Ключ;
				НоваяСтрока.НовоеЗначение 	= Поле.Значение.ЗначениеПослеИзменения; 
				НоваяСтрока.СтароеЗначение 	= Поле.Значение.ЗначениеДоИзменения;
			КонецЦикла;			
		КонецЕсли;	
	КонецЦикла; 
	//ЗначениеВРеквизитФормы(РезультатОтчета, "РезультатОтчета");
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтчет(Команда)
	ВыполнитьНаСервере();
	Элементы.ГруппаВкладки.ТекущаяСтраница=Элементы.ГруппаРезультатВыбора;
КонецПроцедуры
