////////////////////////////////////////////////////////////////////////////////
// СПИСОК СООБЩЕНИЙ (КлиентСервер)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  
// Формирует текст сообщения на основе шаблона, заменяя в нем плейсхолдеры на строковые представления переданных параметров.
//
// Параметры:
//   ШаблонСообщения  - Строка - Шаблон сообщения с плейсхолдерами (%1, %2, %3, %4)
//   Параметр1        - Строка - Значение, подставляемое вместо %1. Длина строки 50 символов.
//   Параметр2        - Строка - Значение, подставляемое вместо %2. Длина строки 50 символов.
//   Параметр3        - Строка - Значение, подставляемое вместо %3. Длина строки 50 символов.
//   Параметр4        - Строка - Значение, подставляемое вместо %4. Длина строки 50 символов.
//
// Возвращаемое значение:
//   Строка - Сформированный текст сообщения
Функция ЗаполнитьТекстСообщения(Знач ШаблонСообщения, 
			Параметр1 = неопределено, 
			Параметр2 = неопределено,
			Параметр3 = неопределено,
			Параметр4 = неопределено) Экспорт;
			
    Результат = ШаблонСообщения;

	Результат = СтрЗаменить(Результат, "%1", Строка(Параметр1));
	Результат = СтрЗаменить(Результат, "%2", Строка(Параметр2)); 
	Результат = СтрЗаменить(Результат, "%3", Строка(Параметр3));
	Результат = СтрЗаменить(Результат, "%4", Строка(Параметр4));
	Возврат Результат;
КонецФункции 


// Создает и возвращает структуру заголовка для сообщения.
//
// Возвращаемое значение:
//  Структура - Заголовок Журнала сообщений, содержащий основные атрибуты
// 	 КлючЖурналаСообщений 		- УникальныйИдентификатор - ID Журнала сообщений  
// 	 ВнутреннийКлюч 			- Строка(50) - пользовательский идентификатор Журнала сообщений. Используется для поиска 
// 	 ОбъектЖурнала 			- СправочникСсылка.ЖурналСообщенийОбъекты - Объект журнала
// 	 Автор 					- ОпределяемыйТип.ПОльзователь - Пользователь, под которым создан Журнал сообщений
// 	 ДатаВремяСозданияUTC 		- ДатаВремя - Дата и время создания Журнала сообщений в универсальном формате UTC
// 	 ДатаВремяСозданияМестное 	- ДатаВремя - Дата и время создания Журнала сообщений в локальном часовом поясе
// 	 КоличествоВсего 			- Число(7) - общее количество сообщений      
// 	 КоличествоОшибки 			- Число(6) - количество сообщений с типом Ошибка 
// 	 КоличествоПредупреждения 	- Число(6) - количество сообщений с типом Предупреждение
// 	 КоличествоИнформация 		- Число(6) - количество сообщений с типом Информационное
// 	 ТекущийУровень 			- Число(1) - уровень вложенности текущего сообщения  
// 	 Родитель					- Число(6) - внутренний номер сообщения, которое является родителем для текущего сообщения 
// 	 ТекущийНомер 				- Число(6) - абсолютный порядковый номер текущего сообщения   
//   ИмяПриложения        		- Строка(30) - содержит имя приложения, начавшего сеанс (см. ПолучитьТекущийСеансИнформационнойБазы()). 
//   ИмяКомпьютера				- Строка(255) - содержит имя компьютера, с которого начат сеанс.
//   IPАдресКлиента   			- Строка(50) - IP-адрес клиента, который начал сеанс.
//   НомерСеанса				- Число(10)- содержит номер сеанса, уникальный среди всех сеансов текущей информационной базы.
Функция НовыйСтруктураЗаголовкаСообщения() Экспорт;
	Результат = Новый Структура();
	Результат.Вставить("КлючЖурналаСообщений");
	Результат.Вставить("ВнутреннийКлюч");
	Результат.Вставить("ОбъектЖурнала");
	Результат.Вставить("Автор");
	Результат.Вставить("ДатаВремяСозданияUTC"); 
	Результат.Вставить("ДатаВремяСозданияМестное"); 	
	Результат.Вставить("КоличествоВсего"); 
	Результат.Вставить("КоличествоОшибки");
	Результат.Вставить("КоличествоПредупреждения");
	Результат.Вставить("КоличествоИнформация");	
	Результат.Вставить("ТекущийУровень");          
	Результат.Вставить("Родитель");      	
	Результат.Вставить("ТекущийНомер");
	Результат.Вставить("ИмяПриложения");
	Результат.Вставить("ИмяКомпьютера");
	Результат.Вставить("IPАдресКлиента");
	Результат.Вставить("НомерСеанса");
	
	Возврат Результат;
КонецФункции 

// Создает новую структуру для представления сообщения.
//
// Возвращаемое значение:
//   Структура - структура с заполненными пустыми значениями полями сообщения
//		КлючЖурналаСообщений 		- УникальныйИдентификатор - уникальный идентификатоор Журнала сообщений
// 		ВнутреннийНомерСообщения 	- число	 - порядковый номер сообщения в списке
//		Родитель					- число  - порядковый номер сообщения, который является родителем тек.сообщения
// 		ТипСообщения				- ПеречислениеСсылка.УН_ТипСообщения - тип сообщения: Ошибка, Предупреждение, Информация
// 		КодПредметнойОбласти		- строка(50) - КодПредметнойОбласти значение кода элемента (СправочникСсылка.УН_ПредметныеОбласти)
//		НомерСообщения				- строка(4) - код сообщения (СправочникСсылка.УН_ШаблоныСообщений.Код)
//		ТекстСообщения				- строка(150) - текст шаблона сообщения
// 		Параметр1					- строка(50) - значение Параметра 1
//		Параметр2					- строка(50) - значение Параметра 2
// 		Параметр3					- строка(50) - значение Параметра 3
// 		Параметр4	      			- строка(50) - значение Параметра 4
// 		Контекст					- структура - контекст сообщения:
// 			ОбъектМетаданных		- строка
//			ОбъектМетаданныхКлюч 	- строка
//			ИмяРеквизита			- строка
// 			ЗначениеРеквизита		- строка
//		Ссылка						- СправочникСсылка.УН_ШаблоныСообщений - ссылка на шаблон сообщения 
//		ЕстьДопТекст				- Булево - содержит Истина, если для сообщения определен дополнительный текст
//		ЕстьКонтекст				- Булево - содержит Истина, если для сообщения определен контекст	
Функция НовыйСтруктураСообщения() Экспорт;
	Результат = Новый Структура();
	Результат.Вставить("КлючЖурналаСообщений", "");
	Результат.Вставить("ВнутреннийНомерСообщения", "");
	Результат.Вставить("Родитель", "");
	Результат.Вставить("ТипСообщения", "");
	Результат.Вставить("КодПредметнойОбласти", "");
	Результат.Вставить("НомерСообщения", "");
	Результат.Вставить("ТекстСообщения", "");
	Результат.Вставить("Параметр1", "");
	Результат.Вставить("Параметр2", "");
	Результат.Вставить("Параметр3", "");
	Результат.Вставить("Параметр4", "");
	Результат.Вставить("Контекст");
	Результат.Вставить("Ссылка", "");
	Результат.Вставить("ЕстьДопТекст", "");
	Результат.Вставить("ЕстьКонтекст", "");
	
	Возврат Результат;
КонецФункции


// Создает новую структуру для хранения контекста.
//
// Возвращаемое значение:
//   Структура - структура с предустановленными ключами
//		ОбъектМетаданных			- Строка - Объект метаданных, для которого создается контекст сообщения
//		ОбъектМетаданныхКлюч		- Строка - Ключ объекта метаданных, для которого создается контекст сообщения
//		ИмяРеквизита				- Строка - Имя реквизита, для которого создается контекст сообщения
//		ЗначениеРеквизита			- Строка - Значение реквизита, для которого создается контекст сообщения
Функция НовыйСтруктураКонтекст() Экспорт;
	Результат = Новый Структура();
	Результат.Вставить("ОбъектМетаданных", "");
	Результат.Вставить("ОбъектМетаданныхКлюч", "");
	Результат.Вставить("ИмяРеквизита", "");
	Результат.Вставить("ЗначениеРеквизита", "");
	Возврат Результат;
КонецФункции
		

// Создает и возвращает структуру для хранения контекста сообщения.
//
// Параметры:
//   ОбъектМетаданных 	  - Строка - Объект метаданных, для которого создается контекст сообщения
//   ОбъектМетаданныхКлюч - Строка - Ключ объекта метаданных
//   ИмяРеквизита 		  - Строка - Имя реквизита объекта метаданных
//   ЗначениеРеквизита    - Произвольный - Значение реквизита объекта метаданных
//
// Возвращаемое значение:
//   Структура - Контекст сообщения с указанными реквизитами
Функция НовыйКонтекст(
				Знач ОбъектМетаданных, 
				Знач ОбъектМетаданныхКлюч, 
				Знач ИмяРеквизита,
				Знач ЗначениеРеквизита) Экспорт;
		
	Результат = НовыйСтруктураКонтекст();
	Результат.ОбъектМетаданных 		= ОбъектМетаданных;
	Результат.ОбъектМетаданныхКлюч 	= ОбъектМетаданныхКлюч;
	Результат.ИмяРеквизита 			= ИмяРеквизита;
	Результат.ЗначениеРеквизита 	= ЗначениеРеквизита;

	Возврат Результат;
КонецФункции

#КонецОбласти