////////////////////////////////////////////////////////////////////////////////
// Модуль формы для обработки записи настройки
// 
// Описание:
//
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы
////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДанныеНастройки;

	Если НЕ Параметры.Свойство("ДанныеНастройки", ДанныеНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	РежимОткрытияФормы = Параметры.Режим;

	КлючЗаписи 	 	 = ДанныеНастройки.КлючЗаписи;
	Родитель 	 	 = ДанныеНастройки.ВышестоящийУзел;
	ЭтоГруппа 	 	 = ДанныеНастройки.ЭтоГруппа;
	ПутьКФорме 	 	 = ДанныеНастройки.ПутьКФорме;
	Наименование 	 = ДанныеНастройки.Наименование;
	Описание 	 	 = ДанныеНастройки.Описание;
	Порядок 	 	 = ДанныеНастройки.Порядок;
	Автор 		 	 = ДанныеНастройки.Автор;
	ПоследнимИзменил = ДанныеНастройки.ПоследнимИзменил;	
	
	// режим Создание
	Если Параметры.Режим = Перечисления.УН_РежимОбъекта.Создание Тогда
		ДатаВремяСозданияUTC 		= неопределено;
		ДатаВремяСозданияМестное 	= неопределено;
		ДатаВремяИзмененияUTC 		= неопределено;
		ДатаВремяИзмененияМестное 	= неопределено;
		Документация.Удалить();
	КонецЕсли;
	
	// режим Изменение
	Если Параметры.Режим = Перечисления.УН_РежимОбъекта.Изменение Тогда
		ДатаВремяСозданияUTC 		= ДанныеНастройки.ДатаВремяСозданияUTC;
		ДатаВремяСозданияМестное 	= МестноеВремя(ДатаВремяСозданияUTC);
		ДатаВремяИзмененияUTC 		= ДанныеНастройки.ДатаВремяИзмененияUTC;
		ДатаВремяИзмененияМестное 	= МестноеВремя(ДатаВремяИзмененияUTC);
		Документация 				= УН_НастройкиВызовСервера.ПолучитьДокументацию(ДанныеНастройки);
	КонецЕсли;	

	ЕстьДокументация = УН_НастройкиКлиентСервер.ЕстьДокументация(Документация);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеСтатусомПолейФормы();
	
	ОбновитьПиктограммуЕстьТекст();
	
	// Считаем, что если значение заполнено, то оно содержит корректный путь к форме
	// (мы же выполняем проверку перед сохранением)
	Если ЗначениеЗаполнено(ПутьКФорме) Тогда	
		ПроверкаВыполнена = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти



////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийЭлементовШапкиФормы
////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ЭтоГруппаПриИзменении(Элемент)
	УправлениеСтатусомПолейФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДокументацияПриИзменении(Элемент)
	ОбновитьПиктограммуЕстьТекст();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФормеПриИзменении(Элемент)
	// сбрасываем статус проверки, если пользователь изменил значение в поле
	ПроверкаВыполнена = Ложь;
КонецПроцедуры
#КонецОбласти



////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиКомандФормы      
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройкуНаКлиенте()
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройкуНаКлиенте();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПутьКФорме(Команда)
	Попытка
		ОткрытьФорму(ПутьКФорме,, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПроверкаВыполнена = Истина;
	Исключение
		ПроверкаВыполнена = Ложь;		
		ШаблонСообщения = НСтр("ru = '
			|Не удалось открыть Форму с именем ""%1""!
			|Если полное имя формы указано верно, форма может не открываться, если для ее открытия необходимо передать обязателные параметры.
			|Такую форму не получится открыть из Руководства по внедрению.");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПутьКФорме);
		ТекстЗаголовка = НСтр("ru = 'Ошибка при открытии формы'");
		
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
	КонецПопытки;

КонецПроцедуры
#КонецОбласти



////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции                                             
////////////////////////////////////////////////////////////////////////////////

// Выполняет созранение настройки на клиенте.
//
&НаКлиенте
Процедура СохранитьНастройкуНаКлиенте()
	РезультатПроверки = ПроверитьИмяФормы();
	Если ЭтоГруппа = Ложь 
		И РезультатПроверки = Ложь Тогда
			ТекстСообщения = НСтр("ru = 'Проверка корректности имени формы не выполнена!'");
			ТекстЗаголовка = НСтр("ru = 'Проверки перед сохранением'");
			ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
			Возврат;
	КонецЕсли;
	
	Попытка
		СохранитьНастройкуНаСервере();
		ПоказатьОповещениеПользователя(, , НСтр("ru = 'Настройка сохранена'"), БиблиотекаКартинок.Информация);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// Сохраняет настройку в регистр сведений УН_РеестрНастроек.
//
&НаСервере
Процедура СохранитьНастройкуНаСервере()
	// нужно актуальное время
	ДатаВремяUTC	 = ТекущаяУниверсальнаяДата();
	ДатаВремяМестное = МестноеВремя(ДатаВремяUTC);
		
	ДанныеНастройки = УН_НастройкиКлиентСервер.НоваяНастройка();
	ДанныеНастройки.КлючЗаписи 	 				= КлючЗаписи;
	ДанныеНастройки.ВышестоящийУзел 			= Родитель;
	ДанныеНастройки.Порядок 	 				= Порядок;
	ДанныеНастройки.Наименование 				= Наименование;
	ДанныеНастройки.Описание 	 				= Описание;
	ДанныеНастройки.ЭтоГруппа 	 				= ЭтоГруппа;
	ДанныеНастройки.ПутьКФорме 	 				= ПутьКФорме;
	
	// данные пользователя, который последним изменил
	ДанныеНастройки.ПоследнимИзменил			= Пользователи.ТекущийПользователь();
	ДанныеНастройки.ДатаВремяИзмененияUTC		= ДатаВремяUTC;
	ДанныеНастройки.ДатаВремяИзмененияМестное	= ДатаВремяМестное;
		
	// может быть форма открыта в режим Создания (добавление нового узла) => обновим доп.поля
	Если РежимОткрытияФормы = Перечисления.УН_РежимОбъекта.Создание Тогда
		ДанныеНастройки.Автор					= Пользователи.ТекущийПользователь();	
		ДанныеНастройки.ДатаВремяСозданияUTC	= ДатаВремяUTC;
		ДанныеНастройки.ДатаВремяСозданияМестное= ДатаВремяМестное;
	КонецЕсли;

	// Добавить запись в регистр сведений УН_РеестрНастроек
	НоваяНастройка = РегистрыСведений.УН_РеестрНастроек.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяНастройка, ДанныеНастройки,,"Документация");
	НоваяНастройка.Родитель = ДанныеНастройки.ВышестоящийУзел;
	
	// Документация
	Если Документация.ПолучитьЭлементы().Количество() > 0 Тогда
		ДокументацияАдрес = Новый ХранилищеЗначения(Документация);
		НоваяНастройка.Документация = ДокументацияАдрес;
	КонецЕсли;
	ДанныеНастройки.ЕстьДокументация = УН_НастройкиКлиентСервер.ЕстьДокументация(Документация);
	НоваяНастройка.ЕстьДокументация = ДанныеНастройки.ЕстьДокументация;
	НоваяНастройка.Записать();
	
	// обновляем данные формы
	Автор = ДанныеНастройки.Автор;
	ДатаВремяСозданияUTC = ДанныеНастройки.ДатаВремяСозданияUTC;
	ДатаВремяСозданияМестное = ДанныеНастройки.ДатаВремяСозданияМестное;
	
	ПоследнимИзменил = ДанныеНастройки.ПоследнимИзменил;	
	ДатаВремяИзмененияUTC = ДанныеНастройки.ДатаВремяИзмененияUTC;
	ДатаВремяИзмененияМестное = ДанныеНастройки.ДатаВремяИзмененияМестное;

	ЕстьДокументация = ДанныеНастройки.ЕстьДокументация;
КонецПроцедуры

// Управляет обязательностью, видимостью и доступностью реквизитов формы.
//
&НаКлиенте
Процедура УправлениеСтатусомПолейФормы()
	Если ЭтоГруппа Тогда
		ПутьКФорме = "";
		Элементы.ПутьКФорме.Видимость = Ложь;
		Элементы.ПроверитьПутьКФорме.Видимость = Ложь;
	Иначе
		Элементы.ПутьКФорме.Видимость = Истина;
		Элементы.ПроверитьПутьКФорме.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПиктограммуЕстьТекст();
	Если УН_НастройкиКлиентСервер.ЕстьДокументация(Документация) Тогда 
		Элементы.ГруппаДокументация.Картинка = БиблиотекаКартинок.УН_ЕстьДанные; 
	Иначе
		Элементы.ГруппаДокументация.Картинка = БиблиотекаКартинок.УН_НетДанных;
	КонецЕсли;  
КонецПроцедуры

// Проверяет путь к форме на основе ранее выполненной проверки.
//
// Возвращаемое значение:
//   Булево - результат проверки пути к форме (Истина, если проверка пройдена успешно)
&НаКлиенте
Функция ПроверитьИмяФормы()
	Результат = Ложь;
	
	Если ПроверкаВыполнена Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции





#КонецОбласти	