// Форма

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РежимОбъекта = ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Просмотр") Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ЖурналСообщений = Новый Массив;
	ПроверитьНаСервере(ЖурналСообщений);
	
	// вывод результатов проверки
	Для каждого Сообщение из ЖурналСообщений Цикл 
		Сообщить(Сообщение);
	КонецЦикла;		
КонецПроцедуры

//===================================================================

// Измерения

&НаКлиенте
Процедура ГруппаЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// определить какой менеджер нужно вызвать
	Если ТекущаяСтраница.Имя = "ГруппаИзмерения" Тогда 		
    	ГруппаЗакладкиИзмеренияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИзмеренияПриИзменении(Элемент)  
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеДействуетСПриИзменении(Элемент)   	
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ИзмерениеДействуетПоПриИзменении(Элемент) 
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеИзмеренияПриИзменении(Элемент)
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент) 
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры 



//===================================================================
// Обработчики формы на сервере  
//===================================================================
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("РежимОбъекта") Тогда
		РежимОбъекта = Параметры.РежимОбъекта;
	КонецЕсли;
	
    Если Параметры.Свойство("ТипБизнесОбъекта") Тогда
		ТипБизнесОбъекта = Параметры.ТипБизнесОбъекта;
	КонецЕсли;

	Если Параметры.Свойство("ИДРодительскийОбъект") Тогда
		ИДРодительскийОбъект = Параметры.ИДРодительскийОбъект;
	КонецЕсли; 
	
	// Режим <> Просмотр => Создание всех потомков и расширений
	// ...
	// МенеджерИзмерений = УН_МенеджерИзмеренийФабрика.Создать()
	// Измерения 		 = УН_МенеджерИзмерений.ВсеИзмерения(МенеджерИзмерений)
	// ...
	
КонецПроцедуры


&НаСервере
Процедура ГруппаЗакладкиИзмеренияНаСервере()
    // Преобразуем реквизит Объект в прикладной объект  
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
		
	АдресИзмеренийВоВременномХранилище = Потомки.НайтиПоЗначению("Измерения");
	
	Если АдресИзмеренийВоВременномХранилище = неопределено Тогда
		// создаем объект - менеджер измерений и используем его для получения данных
		ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(
			ОбъектФормы.Код, 
			РежимОбъекта);
 
		МенеджерИзмерений = ИК.МенеджерИзмерений();
		ИзмеренияФормы = МенеджерИзмерений.ВсеИзмерения().Скопировать(); 
		
		АдресИзмеренийВоВременномХранилище = ПоместитьВоВременноеХранилище(ИзмеренияФормы,ЭтаФорма.УникальныйИдентификатор);
		Потомки.Добавить("Измерения",АдресИзмеренийВоВременномХранилище);
		
		ЗначениеВРеквизитФормы(ИзмеренияФормы, "Измерения");
	Иначе
		//// есть данные во временном хранилище  
		//Попытка
		//	ИзмеренияФормы = ПолучитьИзВременногоХранилища(АдресИзмеренийВоВременномХранилище);  
		//Исключение
		//	Сообщить(ИнформацияОбОшибке());
		//КонецПопытки;		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ИзмерениеПриИзмененииНаСервере()
	//// Получить адрес во временном хранилище
	//АдресИзмеренийВоВременномХранилище = Потомки.НайтиПоЗначению("Измерения");
	//
	//Если АдресИзмеренийВоВременномХранилище = Неопределено Тогда
	//	// Ошибка
	//	Сообщить("Данные измерений не инициализированы.");
	//	Возврат;
	//КонецЕсли; 
	//	
	//// Получить данные с формы 
	//ИзмеренияФормы = РеквизитФормыВЗначение("Измерения"); 
	//
	//// Обновить данные во временном хранилище
	//ПоместитьВоВременноеХранилище(ИзмеренияФормы,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры


&НаСервере
Процедура ПроверитьНаСервере(ЖурналСообщений)
	// Инициализация констант
	РежимСоздание = Перечисления.УН_РежимОбъекта.Создание;  
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр;

	// Преобразовать реквизит Объект в прикладной объект  
	ОбъектФормы = РеквизитФормыВЗначение("Объект");  
	
	// Получить Объект 
	Если РежимОбъекта = РежимСоздание Тогда
		// новый объект
	    ИК = УН_ИмущественныйКомплексФабрика.Создать(
			ОбъектФормы.Организация,
			ОбъектФормы.ТипИмущественногоКомплекса);	
	Иначе		
		// существующий объект
		ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(
			ОбъектФормы.Код, 
			РежимОбъекта);			
	КонецЕсли;
	
	Если РежимОбъекта <> РежимПросмотр Тогда			
		// зарегистрировать всех потомков
		ИК.ЗарегистрироватьВсехПотомков();
		
		// обновить данные в объекте и подчиненных объектах 
		Адрес = неопределено;
		ИК.ЗаполнитьИзВременногоХранилища(Объект, Адрес);  
	КонецЕсли;  
	
	ИК.ПроверитьВсе(ЖурналСообщений);	
КонецПроцедуры





