
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НоваяСтрока = ИсторияСтатусов.Добавить();
	НоваяСтрока.НомерИзменения 	= 1;
	НоваяСтрока.ДатаВремя 		= '2025.03.11 12:03:21';
	НоваяСтрока.Пользователь 	= ПараметрыСеанса.ТекущийПользователь; 
	НоваяСтрока.Статус 			= "Черновик";
	
	
	НоваяСтрока = ИсторияСтатусов.Добавить();
	НоваяСтрока.НомерИзменения 	= 2;
	НоваяСтрока.ДатаВремя 		= '2025.03.15 11:12:05';
	НоваяСтрока.Пользователь 	= ПараметрыСеанса.ТекущийПользователь; 
	НоваяСтрока.Статус 			= "Черновик >> В работе"; 
	НоваяСтрока.Метка			= "Учтено: Установлен
									|Производство: Снят";	

КонецПроцедуры
