/////////////////////////////////////////////////////////
// Расширение базового объекта (Фабрика)
//
////////////////////////////////////////////////////////   

#Область ПрограммныйИнтерфейс


// Создает Объект-расширение по его имени.
// Функция возвращает ссылку на созданный объект-расширение
// Предпосылки:
//  1) Расширения должны быть предварительно зарегистрированы в настройке (см. РС "УН_РасширенияБизнесОбъектов"). 
//  2) Объект метаданных, на базе которого реализуется расширение должен быть создан.
//
// Параметры: 
//  Объект - объект - родительский объект для которого создается расширение
//  ИмяРасширения - строка - наименование расширения
Функция Создать(Объект, ИмяРасширения) Экспорт;
	// Проверяем по настройке, что расширение зарегистрировано, существует и активно
	
	
	// Создаем объект метаданных
	
	
	// Обработка ошибок
	
	
	// Возвращаем результат
КонецФункции


#КонецОбласти