////////////////////////////////////////////////////////////////////////////////
// Общий модуль УН_НастройкиКлиент
// 
// Реализует методы для работы с Руководством по внедрению
//////////////////////////////////////////////////////////////////////////////// 


#Область ПрограммныйИнтерфейс   

// Открывает форму документации для выбранной настройки.
//
// Параметры:
//   ТекущиеДанные - Произвольный - Строка данных, содержащая адрес документации
//	 Владелец - Форма - владелец формы
Процедура ПоказатьДокументацию(Знач ТекущиеДанные, Владелец = Неопределено) Экспорт
	ДанныеНастройки = УН_НастройкиКлиентСервер.НоваяНастройка();
	ЗаполнитьЗначенияСвойств(ДанныеНастройки, ТекущиеДанные);
	
	АдресДокументации = УН_НастройкиВызовСервера.ПолучитьАдресДокументацииВоВременномХранилище(ДанныеНастройки);
	
	// открываем форму
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДокументации", АдресДокументации);	
	ОткрытьФорму("ОбщаяФорма.УН_ДокументHTML", 
		ПараметрыФормы, 
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


// Открывает форму настройки указанной строки.
//
// Параметры:
//   ТекущаяСтрока - Произвольный - Строка, для которой необходимо открыть настройку
//   Владелец - Произвольный - Форма или элемент, являющийся владельцем открываемой формы
Процедура ОткрытьНастройку(ТекущаяСтрока, Владелец = Неопределено) Экспорт
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
			
	Если ТекущаяСтрока.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(ТекущаяСтрока.ПутьКФорме, 
		, 
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры
#КонецОбласти


