
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИсходнаяОрганизация") Тогда
        ИсходнаяОрганизация = Параметры.ИсходнаяОрганизация;
    КонецЕсли;

	Если Параметры.Свойство("ИсходныйКод") Тогда
        ИсходныйКод = Параметры.ИсходныйКод;
	КонецЕсли;
	
	Если Параметры.Свойство("ИсходныйИдентификатор") Тогда
        ИсходныйИдентификатор = Параметры.ИсходныйИдентификатор;
	КонецЕсли;
	
	Если Параметры.Свойство("ИсходноеНаименование") Тогда
        ИсходноеНаименование = Параметры.ИсходноеНаименование;
    КонецЕсли;	
	
	// значения по умолчанию
	ЦелеваяОрганизация 	= ИсходнаяОрганизация;
	ЦелевоеНаименование = ИсходноеНаименование;	
	ЦелеваяДействуетС  	= ТекущаяДата();
	
	// параметры копирования
	КопироватьВложения 			= Истина;
	КопироватьЗаметки 			= Истина;
	КопироватьИзмерения 		= Истина;
	КопироватьНапоминания 		= Истина;
	КопироватьОсновныеДанные 	= Истина;
	КопироватьПрисвоения 		= Истина;
	КопироватьАдресныеДанные 	= Истина;
КонецПроцедуры
