////////////////////////////////////////////////////////////////////////////////
// СПИСОК СООБЩЕНИЙ (Клиент)
//												 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

// Отркывает окно со списком сообщений
// Параметры:
//  АдресСпискаСообщений - Строка - адрес временного хранилища со списком сообщений
//  Владелец - Форма - форма-владелец
Процедура ПоказатьСписокСообщений(Знач АдресСпискаСообщений, Знач Владелец = неопределено) Экспорт;
	ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("АдресСпискаСообщений", АдресСпискаСообщений); 
	
	ОткрытьФорму("ОбщаяФорма.УН_Сообщения",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры



// Отображает окно с расширенным текстом сообщения.
//
// Параметры:
//   ТекущиеДанные - ДанныеФормыЭлементДерева - текущая строка дерева сообщений
//   Владелец - ФормаКлиентскогоПриложения - владелец открываемой формы, по умолчанию Неопределено
Процедура ПоказатьОкноСРасширеннымТекстомСообщения(Знач ТекущиеДанные, Знач Владелец = Неопределено) Экспорт;
	ДанныеСообщения = УН_СписокСообщенийКлиентСервер.НовыйСтруктураСообщения();
	ЗаполнитьЗначенияСвойств(ДанныеСообщения, ТекущиеДанные);
	
	АдресДокументации = УН_СписокСообщенийВызовСервера.ПолучитьАдресДокументацииВоВременномХранилище(ДанныеСообщения);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресДокументации", АдресДокументации);
	ОткрытьФорму("ОбщаяФорма.УН_ДокументHTML",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


// Открывает окно с данными контекста сообщения  
// Параметры:
//  ДанныеСообщения - ДанныеФормыЭлементДерева - строка дерева сообщений
Процедура ПоказатьОкноСКонтекстомСообщения(Знач ДанныеСообщения) Экспорт;
	Сообщение = УН_СписокСообщенийКлиентСервер.НовыйСтруктураСообщения();
	ЗаполнитьЗначенияСвойств(Сообщение, ДанныеСообщения);
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДанныеСообщения", Сообщение);
	ОткрытьФорму("ОбщаяФорма.УН_КонтекстСообщения",ПараметрыФормы ,,,,,,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

