////////////////////////////////////////////////////////////////////////////////
// ЖУРНАЛ СООБЩЕНИЙ
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

// Возвращает список журналов сообщений (только заголовочную часть), которые удовлетворяют критериям отбора.
// Дата/Время Журнала сообщений приводится к дате/времени часового пояса сеанса. 
// Если параметр Отбор не задан - будут выбраны все записи
// Параметры:
//  Отбор - Структура:
//	 * Объект - Массив элементов: строк или СправочникСсылка.УН_ОбъектыЖурналаСообщений.Код. 
//						ВАЖНО: Все элементы массива должны быть одного типа!
//						ВАЖНО: Массив не может содержать маски (элементы типа строка со спецсимволами)!
//					  - Строка - значение кода элемента справочника УН_ОбъектыЖурнал. Может содержать спец.символы:
//						 "%" - последовательность, содержащая любое количество произвольных символов;
//						 "_" - один произвольный символ;
//					  - СправочникСсылка.УН_ОбъектыЖурналаСообщений;
//	 * ВнутреннийКлюч - Строка(50) - пользовательский идентификатор. Может содержать спецсимволы:
//						 "%" - последовательность, содержащая любое количество произвольных символов;
//						 "_" - один произвольный символ;
//	 - Пользователь   - Массив элементов: строк или СправочникСсылка.Пользователи 
//						ВАЖНО: Все элементы массива должны быть одного типа! 
//					  - Строка - имя пользователя. Может содержать спец.символы:
//						 "%" - последовательность, содержащая любое количество произвольных символов;
//						 "_" - один произвольный символ; 
//					  - СправочникСсылка.Пользователи; 
//	 - НачалоПериода  - ДатаВремя - начальная дата периода(включительно), за который выбираются Журналы
//	 - КонецПериод    - ДатаВремя - конечная дата периода (включительно), за который выбиратся Журналы 
//
// Возвращаемое значение:
//  ТаблицаЗначений - формат строки см. УН_СписокСообщений.НовыйЗаголовок()
//  Неопределено - если нет Журналов сообщений, удовлетворяющих критериям отбора
Функция ЗаполнитьЗаголовки(Знач Отбор) Экспорт;
	Результат = Неопределено; 		
	
	ТекстЗапроса = НовыйТекстЗапросаЖурналы();
	
	ПараметрыЗапроса = Новый Структура();	
	МодифицироватьТекстЗапроса(ТекстЗапроса, Отбор, ПараметрыЗапроса);
	
	Если ЗначениеЗаполнено(ТекстЗапроса) = Ложь Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение(ТекстЗапроса);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	// параметры запроса
	Для каждого Параметр из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);
	КонецЦикла;	

	// разница во времени с учетом часового пояса (данные в регистре хранятся в универсальном времени)
	ЧасовойПоясСеанса = ЧасовойПоясСеанса();
	СмещениеВремени = СмещениеСтандартногоВремени(ЧасовойПоясСеанса);
	СмещениеВремени = СмещениеВремени + СмещениеЛетнегоВремени(ЧасовойПоясСеанса);	
	Запрос.УстановитьПараметр("СмещениеВремени", СмещениеВремени);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить();
	Возврат Результат;
КонецФункции

// Возвращает список сообщений, которые соответсвуют заданным критериям отбора  
// Если параметр КлючЖурналаСообщений не задан - будут выбраны все записи
// Параметры:
//  КлючЖурналаСообщений  - УникальныйИдентификатор - идентификатор журнала сооющений
//						  - Массив - массив уникальных идентификтаоров
// Возвращаемое значение:
//  ТаблицаЗначений - содержит список сообщений, удовлетворяющих ключам
//  Неопределено, если нет сообщений, удовлетворяющих критериям отбора
//
Функция ЗаполнитьСообщения(Знач КлючЖурналаСообщений) Экспорт;
	Результат = Неопределено;
	ПараметрыЗапроса = Новый Структура();
	
	ТекстЗапроса = НовыйТекстЗапросаСообщения();
	МодифицироватьТекстЗапросаСообщения(ТекстЗапроса, КлючЖурналаСообщений, ПараметрыЗапроса);	
	
	Если ЗначениеЗаполнено(ТекстЗапроса) = Ложь Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение(ТекстЗапроса);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;	
	                                                     	
	Для каждого Параметр из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ,Параметр.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить();
	Возврат Результат;
КонецФункции

#КонецОбласти



#Область СлужебныеПроцедурыИФункции   

#Область ЗаголовкиЖурналаСообщений

// Возвращает текст запроса для Заголовка журналов
Функция НовыйТекстЗапросаЖурналы()
	Результат = "ВЫБРАТЬ
	            |	УН_ЖурналСообщений.КлючЖурналаСообщений КАК КлючЖурналаСообщений,
	            |	УН_ЖурналСообщений.КоличествоОшибки КАК Ошибки,
	            |	УН_ЖурналСообщений.КоличествоПредупреждения КАК Предупреждения,
	            |	УН_ЖурналСообщений.КоличествоИнформация КАК Информация,
	            |	УН_ЖурналСообщений.КоличествоВсего КАК Всего,
	            |	УН_ЖурналСообщений.ВнутреннийКлюч КАК ВнутреннийКлюч,
	            |	УН_ЖурналСообщений.ОбъектЖурнала КАК ОбъектЖурнала,
	            |	УН_ОбъектыЖурналаСообщений.Код КАК КодОбъектЖурнала,
	            |	УН_ЖурналСообщений.ДатаВремяСозданияUTC КАК ДатаВремяСозданияUTC,
	            |   ДОБАВИТЬКДАТЕ(УН_ЖурналСообщений.ДатаВремяСозданияUTC, СЕКУНДА, &СмещениеВремени) КАК ДатаВремяСозданияМестное,
	            |	УН_ЖурналСообщений.Автор КАК Пользователь,
	            |	Пользователи.Наименование КАК КодПользователь,
	            |	УН_ЖурналСообщений.ИмяПриложения КАК ИмяПриложения,
	            |	УН_ЖурналСообщений.ИмяКомпьютера КАК ИмяКомпьютера,
	            |	УН_ЖурналСообщений.IPАдресКлиента КАК IPАдресКлиента,
	            |	УН_ЖурналСообщений.НомерСеанса КАК НомерСеанса,
	            |	ВЫБОР
	            |		КОГДА УН_ЖурналСообщений.КоличествоОшибки > 0
	            |			ТОГДА 0
	            |		КОГДА УН_ЖурналСообщений.КоличествоПредупреждения > 0
	            |			ТОГДА 1
	            |		КОГДА УН_ЖурналСообщений.КоличествоИнформация > 0
	            |			ТОГДА 2
	            |		ИНАЧЕ -1
	            |	КОНЕЦ КАК СтатусКартинки
	            |ИЗ
	            |	РегистрСведений.УН_ЖурналСообщений КАК УН_ЖурналСообщений
	            |		[&ИЗ]
	            |[&ГДЕ]
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ДатаВремя";	   
	Возврат Результат;	         	
КонецФункции 

// Модифицирует текст запроса для Заголовка журналов на основании Отбора.
// Анализирует содержимое параметра Отбор и заполняет структуру ПараметрыЗапроса парами значений: ИмяПараметра - Значение.
//
// Параметры:
//  ТекстЗапроса 	 - Строка 	 - исходный текст запроса
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структура - может соодержать отборы для: "Объект", "ВнутреннийКлюч", "Пользователь", "НачалоПериода" и "КонецПериода"
//		ИмяПараметра - содержит имя параметра в тексте запроса
//		Значение	 - содержит значение соответсвующего параметра запроса из параметра Отбор
Процедура МодифицироватьТекстЗапроса(ТекстЗапроса, Знач Отбор, ПараметрыЗапроса)
// Предпосылки	
	Если ЗначениеЗаполнено(ТекстЗапроса) = Ложь Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("ТекстЗапроса");
	КонецЕсли;	
		Если ТипЗнч(Отбор) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Отбор");
	КонецЕсли; 

// Основная часть
    ТекстИЗ 		 = Новый Массив();
	ТекстГДЕ 		 = Новый Массив();

	ОбработатьПараметрОбъект(Отбор, ПараметрыЗапроса, ТекстИЗ, ТекстГДЕ);
	ОбработатьПараметрВнутреннийКлюч(Отбор, ПараметрыЗапроса, ТекстИЗ, ТекстГДЕ);
	ОбработатьПараметрПользователь(Отбор, ПараметрыЗапроса, ТекстИЗ, ТекстГДЕ);
	ОбработатьПараметрНачалоПериода(Отбор, ПараметрыЗапроса, ТекстИЗ, ТекстГДЕ); 
	ОбработатьПараметрКонецПериода(Отбор, ПараметрыЗапроса, ТекстИЗ, ТекстГДЕ); 
	
	// корректируем предложение ИЗ в тексте запроса
	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ИЗ]",
			СтрСоединить(ТекстИЗ,Символы.ПС));   
	Иначе
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ИЗ]",
			"");			
	КонецЕсли;

	// корректируем предложение ГДЕ в тексте запроса	
	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ВыражениеГДЕ = СтрСоединить(ТекстГДЕ, " И "); 
		ВыражениеГДЕ = СтрШаблон("ГДЕ %1", ВыражениеГДЕ); 
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ГДЕ]",
			ВыражениеГДЕ);
	Иначе
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ГДЕ]",
			"");			
	КонецЕсли;
КонецПроцедуры	

// Проверяет наличие критерия отбора и при необходимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структрура - содержит элементы в формате ИмяПараметра - Значение
//		ИмяПараметра - содержит имя параметра в тексте запроса
//		Значение	 - содержит значение соответсвующего параметра запроса из параметра Отбор
//	ЗапросИЗ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ИЗ текста запроса. 
//								При необходимости добавляет в массив новый элемент
//  ЗапросГДЕ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.
Процедура ОбработатьПараметрОбъект(Знач Отбор, ПараметрыЗапроса, ЗапросИЗ, ЗапросГДЕ) 
// Предпосылки	 
    ИмяПараметра 	  = "Объект";
	ЗначениеПараметра = Неопределено;
	
	Если Отбор.Свойство(ИмяПараметра, ЗначениеПараметра) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЗапросИЗ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросИЗ");	
	КонецЕсли; 

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;
	
	ТекстИЗ 		  = "";
	ТекстГДЕ 		  = "";
	ЛеваяЧасть		  = "";
	ПраваяЧасть		  = ИмяПараметра;
	ОператорСравнения = "="; 
	НедопустимыйТип	  = Истина;
		
	// тип параметра - массив => анализируем только первый элемент 
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда  
		НедопустимыйТип	= Ложь;	
		
		Для каждого ЭлементМассива из Отбор.Объект Цикл
			ОператорСравнения = "В";
			ЗначениеПараметра = ЭлементМассива;
			Прервать;
		КонецЦикла;
	КонецЕсли;
		
	// тип параметра - ссылка на элемент справочника
	Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.УН_ОбъектыЖурналаСообщений") Тогда
		НедопустимыйТип	= Ложь;
		ЛеваяЧасть		= "УН_ЖурналСообщений.ОбъектЖурнала";						
	КонецЕсли;
	
	// тип параметра - строка
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
		НедопустимыйТип	= Ложь;
		
		// поиск по значению кода
		ЛеваяЧасть	= "УН_ОбъектыЖурналаСообщений.Код";
		
		// добавим таблицу в запрос
		ТекстИЗ = СтрШаблон("
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УН_ОбъектыЖурналаСообщений КАК УН_ОбъектыЖурналаСообщений
			|		ПО УН_ЖурналСообщений.ОбъектЖурнала = УН_ОбъектыЖурналаСообщений.Ссылка");
		
		// может быть строка содержит маску для поиска (спецсимволы)
		РегулярноеВыражение = "[%_]";
		ЭтоМаска = СтрНайтиПоРегулярномуВыражению(ЗначениеПараметра, РегулярноеВыражение);
		Если ЭтоМаска.Длина > 0 Тогда
			ОператорСравнения = "ПОДОБНО";
		КонецЕсли;
	КонецЕсли;

	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);	
	
	ПараметрыЗапроса.Вставить(ИмяПараметра,Отбор.Объект);
	
	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ЗапросИЗ.Добавить(ТекстИЗ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;	
КонецПроцедуры

// Проверяет наличие критерия отбора и при необхдимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  ТекстЗапроса 	 - Строка - исходный текст запроса
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структура - содержит список параметров запроса в формате ИмяПараметра - Значение
//	ЗапросИЗ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ИЗ текста запроса. 
//								При необходимости добавляет в массив новый элемент
//  ЗапросГДЕ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.
Процедура ОбработатьПараметрВнутреннийКлюч(Знач Отбор, ПараметрыЗапроса, ЗапросИЗ, ЗапросГДЕ);
// Предпосылки   
    ИмяПараметра 	  = "ВнутреннийКлюч";
	ЗначениеПараметра = Неопределено;
	
	Если Отбор.Свойство(ИмяПараметра, ЗначениеПараметра) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	Если ТипЗнч(ЗапросИЗ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросИЗ");	
	КонецЕсли; 

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;	

// Основная часть 	 
	ТекстИЗ 		  = ""; 
	ТекстГДЕ 		  = ""; 
	ЛеваяЧасть		  = "УН_ЖурналСообщений.ВнутреннийКлюч";
	ПраваяЧасть		  = ИмяПараметра;	
	ОператорСравнения = "=";  
	НедопустимыйТип	  = Истина;
	
	// тип параметра - строка
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда
		НедопустимыйТип = Ложь;
		РегулярноеВыражение = "[%_]";
		ЭтоМаска = СтрНайтиПоРегулярномуВыражению(ЗначениеПараметра, РегулярноеВыражение);
		Если ЭтоМаска.Длина > 0 Тогда
			ОператорСравнения = "ПОДОБНО";
		КонецЕсли;		
	КонецЕсли; 

	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);
	
	ПараметрыЗапроса.Вставить(ИмяПараметра,ЗначениеПараметра);   
	
	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ЗапросИЗ.Добавить(ТекстИЗ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;	
КонецПроцедуры

// Проверяет наличие критерия отбора и при необхдимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  ТекстЗапроса 	 - Строка - исходный текст запроса
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структура - содержит список параметров запроса в формате ИмяПараметра - Значение
//	ЗапросИЗ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ИЗ текста запроса. 
//								При необходимости добавляет в массив новый элемент
//  ЗапросГДЕ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.
Процедура ОбработатьПараметрПользователь(Знач Отбор, ПараметрыЗапроса, ЗапросИЗ, ЗапросГДЕ); 
// Предпосылки	 
    ИмяПараметра 	  = "Пользователь";
	ЗначениеПараметра = Неопределено;
	
	Если Отбор.Свойство(ИмяПараметра, ЗначениеПараметра) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	Если ТипЗнч(ЗапросИЗ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросИЗ");	
	КонецЕсли; 

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;	
	
	ТекстИЗ 		  = ""; 
	ТекстГДЕ 		  = ""; 
	ЛеваяЧасть		  = "";
	ПраваяЧасть		  = ИмяПараметра;	
	ОператорСравнения = "=";
	НедопустимыйТип   = Истина;
		
	// тип параметра - массив => анализируем только первый элемент 
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
		НедопустимыйТип = Ложь;
		
		Для каждого ЭлементМассива из Отбор.Пользователь Цикл
			ОператорСравнения = "В";
			ЗначениеПараметра = ЭлементМассива;
			Прервать;
		КонецЦикла;
	КонецЕсли;
		
	// тип параметра - ссылка на элемент справочника
	Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.Пользователи") Тогда
		НедопустимыйТип = Ложь;		
		ЛеваяЧасть 		= "УН_ЖурналСообщений.Автор"; 							
	КонецЕсли;
	
	// тип параметра - строка
	Если ТипЗнч(ЗначениеПараметра) = Тип("Строка") Тогда 
		НедопустимыйТип = Ложь;

		// поиск по значению логина
		ЛеваяЧасть = "Пользователи.Наименование";
		
		// добавим таблицу в запрос
		ТекстИЗ = СтрШаблон("
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	            |		ПО УН_ЖурналСообщений.Автор = Пользователи.Ссылка");
		
		// может быть строка содержит маску для поиска (спецсимволы)
		РегулярноеВыражение = "[%_]";
		ЭтоМаска = СтрНайтиПоРегулярномуВыражению(ЗначениеПараметра, РегулярноеВыражение);
		Если ЭтоМаска.Длина > 0 Тогда
			ОператорСравнения = "ПОДОБНО";
		КонецЕсли;			
	КонецЕсли; 

	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;	

	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);	
	
	ПараметрыЗапроса.Вставить(ИмяПараметра,Отбор.Пользователь);
	
	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ЗапросИЗ.Добавить(ТекстИЗ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;	
КонецПроцедуры

// Проверяет наличие критерия отбора и при необхдимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  ТекстЗапроса 	 - Строка - исходный текст запроса
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структура - содержит список параметров запроса в формате ИмяПараметра - Значение
//	ЗапросИЗ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ИЗ текста запроса. 
//								При необходимости добавляет в массив новый элемент
//  ЗапросГДЕ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.
Процедура ОбработатьПараметрНачалоПериода(Знач Отбор, ПараметрыЗапроса, ЗапросИЗ, ЗапросГДЕ); 
// Предпосылки
    ИмяПараметра 	  = "НачалоПериода";
	ЗначениеПараметра = Неопределено;
	
	Если Отбор.Свойство(ИмяПараметра, ЗначениеПараметра) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЗапросИЗ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросИЗ");	
	КонецЕсли; 

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;	

// Основная часть 	 
	ТекстГДЕ 		  = "";
	ТекстИЗ 		  = ""; 
	ЛеваяЧасть		  = "УН_ЖурналСообщений.ДатаВремяСоздания";
	ПраваяЧасть		  = ИмяПараметра;	
	ОператорСравнения = ">="; 
	НедопустимыйТип	  = Истина;
	
	// тип параметра - строка
	Если ТипЗнч(ЗначениеПараметра) = Тип("Дата") Тогда		
		НедопустимыйТип = Ложь;	
	КонецЕсли;

	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;
	
	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);
			
	ПараметрыЗапроса.Вставить(ИмяПараметра, ЗначениеПараметра);
	
	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ЗапросИЗ.Добавить(ТекстИЗ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;	
КонецПроцедуры

// Проверяет наличие критерия отбора и при необхдимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  ТекстЗапроса 	 - Строка - исходный текст запроса
//  Отбор		 	 - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса - Структура - содержит список параметров запроса в формате ИмяПараметра - Значение
//	ЗапросИЗ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ИЗ текста запроса. 
//								При необходимости добавляет в массив новый элемент
//  ЗапросГДЕ		 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.
Процедура ОбработатьПараметрКонецПериода(Знач Отбор, ПараметрыЗапроса, ЗапросИЗ, ЗапросГДЕ); 
// Предпосылки
    ИмяПараметра 	  = "КонецПериода";
	ЗначениеПараметра = Неопределено;
	
	Если Отбор.Свойство(ИмяПараметра, ЗначениеПараметра) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;  
	
	Если ТипЗнч(ЗапросИЗ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросИЗ");	
	КонецЕсли; 

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;	

// Основная часть 	 
	ТекстГДЕ 		  = "";
	ТекстИЗ 		  = ""; 
	ЛеваяЧасть		  = "УН_ЖурналСообщений.ДатаВремяСоздания";
	ПраваяЧасть		  = ИмяПараметра;
	ОператорСравнения = "<=";
	НедопустимыйТип	  = Истина;
	
	// тип параметра - строка
	Если ТипЗнч(ЗначениеПараметра) = Тип("Дата") Тогда		
		НедопустимыйТип = Ложь;		
	КонецЕсли;
	
	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;
		
	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);

	ПараметрыЗапроса.Вставить(ИмяПараметра,ЗначениеПараметра);

	Если ЗначениеЗаполнено(ТекстИЗ) Тогда
		ЗапросИЗ.Добавить(ТекстИЗ);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СообщенияЖурналаСообщений

// Возвращает текст запроса для Сообщений журналов
Функция НовыйТекстЗапросаСообщения()
	Результат = "ВЫБРАТЬ
	            |	УН_СообщенияЖурнала.КлючЖурналаСообщений КАК КлючЖурналаСообщений,
	            |	УН_СообщенияЖурнала.ВнутреннийНомерСообщения КАК ВнутреннийНомерСообщения,
	            |	УН_СообщенияЖурнала.КодПредметнойОбласти КАК КодПредметнойОбласти,
	            |	УН_СообщенияЖурнала.НомерСообщения КАК НомерСообщения,
	            |	УН_СообщенияЖурнала.ТипСообщения КАК ТипСообщения,
	            |	УН_СообщенияЖурнала.ТекстСообщения КАК ТекстСообщения,
	            |	УН_СообщенияЖурнала.Параметр1 КАК Параметр1,
	            |	УН_СообщенияЖурнала.Параметр2 КАК Параметр2,
	            |	УН_СообщенияЖурнала.Параметр3 КАК Параметр3,
	            |	УН_СообщенияЖурнала.Параметр4 КАК Параметр4,
	            |	УН_СообщенияЖурнала.Родитель КАК Родитель,
	            |	УН_СообщенияЖурнала.Контекст КАК Контекст,
	            |	УН_СообщенияЖурнала.СообщениеСсылка КАК СообщениеСсылка,
	            |	УН_ШаблоныСообщений.ЕстьДопТекст КАК ЕстьДопТекст
	            |ИЗ
	            |	РегистрСведений.УН_СообщенияЖурнала КАК УН_СообщенияЖурнала
	            |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УН_ШаблоныСообщений КАК УН_ШаблоныСообщений
	            |		ПО УН_СообщенияЖурнала.СообщениеСсылка = УН_ШаблоныСообщений.Ссылка
	            |[&ГДЕ]
				|
	            |УПОРЯДОЧИТЬ ПО
	            |	КлючЖурналаСообщений,
	            |	ВнутреннийНомерСообщения";	
	Возврат Результат;	         
КонецФункции

// Модифицирует текст запроса для полкучения Сообщений журналов на основании ключей журнала сообщений.
//
// Параметры:
//  ТекстЗапроса 	 	 - Строка - исходный текст запроса
//  КлючЖурналаСообщений - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса 	 - Структура - содержит элементы в формате ИмяПараметра - Значение, если параметр КлючЖурналаСообщений не пустой 
//		ИмяПараметра 		- содержит имя параметра в тексте запроса
//		Значение	 		- содержит значение соответсвующего параметра запроса из параметра Отбор
Процедура МодифицироватьТекстЗапросаСообщения(ТекстЗапроса, Знач КлючЖурналаСообщений, ПараметрыЗапроса)
// Предпосылки	
	Если ЗначениеЗаполнено(ТекстЗапроса) = Ложь Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("ТекстЗапроса");
	КонецЕсли;	
	
// Основная часть
	ТекстГДЕ = Новый Массив;

	ОбработатьПараметрКлючЖурналаСообщений(КлючЖурналаСообщений, ПараметрыЗапроса, ТекстГДЕ);

	// корректируем предложение ГДЕ в тексте запроса	
	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ВыражениеГДЕ = СтрСоединить(ТекстГДЕ, " И "); 
		ВыражениеГДЕ = СтрШаблон("ГДЕ %1", ВыражениеГДЕ); 
		
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ГДЕ]",
			ВыражениеГДЕ);
	Иначе
		ТекстЗапроса = СтрЗаменить(
			ТекстЗапроса,
			"[&ГДЕ]",
			"");			
	КонецЕсли;
КонецПроцедуры

// Проверяет наличие критерия отбора и при необхдимости корректирует текст запроса 
// и заполняет структуру ПараметрыЗапроса
//
// Параметры:
//  КлючЖурналаСообщений - Структура - см.  ЗаполнитьЗаголовки()
//  ПараметрыЗапроса 	 - Структура - содержащая элементы в формате ИмяПараметра - Значение
//		ИмяПараметра 	 - содержит имя параметра в тексте запроса
//		Значение	 	 - содержит значение соответсвующего параметра запроса из параметра Отбор
//  ЗапросГДЕ		 	 - Массив - содержит список элементов, которые долнжны участвовать в предложении ГДЕ текста запроса. 
//								При необходимости добавляет в массив новый элемент.       
Процедура ОбработатьПараметрКлючЖурналаСообщений(Знач КлючЖурналаСообщений, ПараметрыЗапроса, ЗапросГДЕ)
// Предпосылки	 
    ИмяПараметра 	  = "КлючЖурналаСообщений";
	ЗначениеПараметра = КлючЖурналаСообщений;
	
	Если ЗначениеПараметра = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЗапросГДЕ) <> Тип("Массив") Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ЗапросГДЕ");	
	КонецЕсли;
	
	ТекстГДЕ 		  = "";
	ЛеваяЧасть		  = "УН_СообщенияЖурнала.КлючЖурналаСообщений";
	ПраваяЧасть		  = ИмяПараметра;
	ОператорСравнения = "="; 
	НедопустимыйТип	  = Истина;
		
	// тип параметра - массив => анализируем только первый элемент 
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда  
		НедопустимыйТип	= Ложь;	
		
		Для каждого ЭлементМассива из КлючЖурналаСообщений Цикл
			ОператорСравнения = "В";
			ЗначениеПараметра = ЭлементМассива;
			Прервать;
		КонецЦикла;
	КонецЕсли;
		
	// тип параметра - УникальныйИдентификатор
	Если ТипЗнч(ЗначениеПараметра) = Тип("УникальныйИдентификатор") Тогда
		НедопустимыйТип	= Ложь;						
	КонецЕсли;
	
	Если НедопустимыйТип Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстГДЕ = СтрШаблон("%1 %2 &%3", 
		ЛеваяЧасть,
		ОператорСравнения,
		ПраваяЧасть);	
	
	ПараметрыЗапроса.Вставить(ИмяПараметра,КлючЖурналаСообщений);
	
	Если ЗначениеЗаполнено(ТекстГДЕ) Тогда
		ЗапросГДЕ.Добавить(ТекстГДЕ);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
			
#КонецОбласти