////////////////////////////////////////////////////////////////////////////////
// Настройки (сервер)
// 
// Реализует методы для работы с HTML, которые должны выполняться на сервере
//////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс   


// Формирует HTML-документацию на основе переданных настроек.
//
// Параметры:
//   ДанныеНастройки - Структура - данные настройки
//
// Возвращаемое значение:
//   Строка - HTML-документация
Функция ДокументацияHTML(Знач ДанныеНастройки) Экспорт;
	ДокументацияHTML = "";
	Документация = ПолучитьДокументацию(ДанныеНастройки);

	// Может быть документации нет => сформируем страницу по умолчанию
	Если Документация = Неопределено 
		ИЛИ Документация.ПолучитьЭлементы().Количество() = 0 Тогда
			ДокументацияHTML = ДокументацияПоУмолчанию(ДанныеНастройки);		
	Иначе	
		ДокументацияHTML = УН_HTMLСервисВызовСервера.СформироватьHTMLИзФорматированногоДокумента(Документация);
	КонецЕсли;	
	
	Возврат ДокументацияHTML;
КонецФункции

// Получает документацию к настройки в виде форматированного документа.
//
// Параметры:
//   ДанныеНастройки - Структура - данные настройки
//
// Возвращаемое значение:
//   ФорматированныйДокумент - Документация настройки или Неопределено, если документация отсутствует
Функция ПолучитьДокументацию(Знач ДанныеНастройки) Экспорт;
	Если ДанныеНастройки = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ДанныеНастройки");
	КонецЕсли;
  
	Если ДанныеНастройки.Свойство("КлючЗаписи") = Ложь Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("КлючЗаписи", "ДанныеНастройки");
	КонецЕсли;

	Если ТипЗнч(ДанныеНастройки.КлючЗаписи) <> Тип("УникальныйИдентификатор") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("КлючЗаписи");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|    УН_РеестрНастроек.Документация
		|ИЗ
		|    РегистрСведений.УН_РеестрНастроек КАК УН_РеестрНастроек
		|ГДЕ
		|    УН_РеестрНастроек.КлючЗаписи = &КлючЗаписи";

	Запрос.УстановитьПараметр("КлючЗаписи", ДанныеНастройки.КлючЗаписи);
	РезультатЗапроса = Запрос.Выполнить();

	Документация = "";
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокументацияАдрес = ВыборкаДетальныеЗаписи.Документация;
			Если ДокументацияАдрес <> Неопределено Тогда
				Документация = ДокументацияАдрес.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Документация;
КонецФункции



// Получает адрес документации во временном хранилище на основе настроек.
//
// Параметры:
//   ДанныеНастройки - Структура - содержит реквизиты настройки
//
// Возвращаемое значение:
//   Строка - адрес документации во временном хранилище
Функция ПолучитьАдресДокументацииВоВременномХранилище(ДанныеНастройки) Экспорт
	Если ДанныеНастройки = Неопределено Тогда
		Возврат неопределено;
	КонецЕсли;
  
	ДокументацияHTML = ДокументацияHTML(ДанныеНастройки);
	
	// АдресДокументации
	Возврат ПоместитьВоВременноеХранилище(ДокументацияHTML); 
КонецФункции

#КонецОбласти




#Область СлужебныеПроцедурыИФункции
// Формирует HTML-текст по умолчанию на основе переданных данных.
//
// Параметры:
//   ТекущиеДанные - Структура - Данные, используемые для формирования HTML-текста.
//
// Возвращаемое значение:
//   Строка - Сформированный HTML-текст
Функция ДокументацияПоУмолчанию(Знач ТекущиеДанные)
	ШаблонHTML = "
	|<!DOCTYPE html>
	|<html lang=""ru"">
	|<head>
	|    <meta charset=""UTF-8"">
	|    <title></title>
	|    <style>
	|        body {
	|            font-family: Arial, sans-serif;
	|            margin: 0;
	|            padding: 8px;
	|        }
	|        h1 {
	|			 color: #009646;
	|            margin: 0;
	|            padding: 0;
	|        }
	|        h2 {
	|            color: #009646;
	|			 margin: 0;
	|            padding: 0;
	|        }
	|        h3 {
	|			 color: #009646;
	|            margin: 0;
	|            padding: 0;
	|        }
	|        p {
	|            line-height: 1.1;
	|            margin: 0;
	|            padding: 0;
	|        }
	|    </style>
	|</head>
	|<body>
	|    <h3>Заголовок</h1>
	|    <p><br></p>
	|	 <p><br></p>
	|    <p>Текст<br></p>
	|</body>
	|</html>";
	
	Текст = СтрЗаменить(ШаблонHTML, "Заголовок", ТекущиеДанные.Наименование);
	Текст = СтрЗаменить(Текст, "Текст", ТекущиеДанные.Описание);
	
	Возврат Текст;
КонецФункции
#КонецОбласти