/////////////////////////////////////////////////////////
// Расширение базового объекта (Пример реализации)
//
/////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Функция вызывается при инициализации проверки изменения данных расширения
Функция ДанныеИзменены(Расширение) Экспорт;
КонецФункции

// Процедура вызывается при инициализации проверки объекта
Процедура ПроверитьВсе(Расширение, ЖурналСообщений) Экспорт;
КонецПроцедуры


// Процедура вызывается при начальном заполнении данных раширения
Процедура ИницализироватьПоРодителю(Расширение, Родитель) Экспорт;
КонецПроцедуры


// Процедура вызывается при копировании данных раширения
Процедура ИницализироватьПоШаблону(Расширение, Шаблон) Экспорт;
КонецПроцедуры


// Функция вызывается при запросе данных расширения
// Требуется реализовать получение данных объекта
Функция ПолучитьДанныеРасширения(Расширение) Экспорт;
КонецФункции


// Функция вызывается при сохранении данных расширения
Процедура РасширениеЗаписать(Расширение, ЖурналСообщений) Экспорт;
КонецПроцедуры


#КонецОбласти