////////////////////////////////////////////////////////////////////////////////
// Модуль формы - Реестра имущественных комплексов (список)
// 
// Реализует функции по ведению реестра: создание, изменение, просмотр
//////////////////////////////////////////////////////////////////////////////// 


#Область КомандыРеестра

// Команда Создать
// Создает новый обект
&НаКлиенте
Процедура СоздатьИмущественныйКомплекс(Команда)
	// Вызов диалога для выбора Организации и Типа объекта
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСозданиеИмущественногоКомплекса", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.УН_ИмущественныйКомплексПараметры",,,,,,
		ОписаниеОповещения, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	 
		
	// Инициализация констант
	РежимСоздание 		= ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Создание"); 	
	ТипБизнесОбъектаИК 	= ПредопределенноеЗначение("Справочник.УН_БизнесОбъекты.ИК");
	
	// Получить ключ объекта
	Ключ				= Неопределено;	  
	
	ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("Ключ",Ключ);
	ПараметрыФормы.Вставить("РежимОбъекта",РежимСоздание);
	ПараметрыФормы.Вставить("ТипБизнесОбъекта", ТипБизнесОбъектаИК); 
	ПараметрыФОрмы.Вставить("ИДРодительскийОбъект");
	
	ОткрытьФорму("Справочник.УН_ИмущественныеКомплексы.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры   

&НаКлиенте
Процедура ОбработатьСозданиеИмущественногоКомплекса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПараметрОрганизация = Результат.Организация;
		ПараметрТипИмущественногоКомплекса = Результат.ТипИмущественногоКомплекса;
	Исключение
		Сообщить("Что-то пошло не так");
	КонецПопытки;
	
	// Открываем форму
	Форма = ОткрытьФорму("Справочник.УН_ИмущественныеКомплексы.Форма.ФормаЭлемента");
	
    // Получаем объект формы
    ДанныеФормы = Форма.Объект;

	// Создаем новый ИмущественныйКомплекс
	СоздатьИмущественныйКомплексНаСервере(ДанныеФормы,
		ПараметрОрганизация, 
		ПараметрТипИмущественногоКомплекса);  
		
	
	// Копируем данные из нашего объекта в объект формы
    КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
	
	// Устанавливаем статус полей формы
КонецПроцедуры


// Команда Изменить
// Открывает выбранный Имущественный комплекс в режиме изменения
&НаКлиенте
Процедура ИзменитьИмущественныйКомплекс(Команда)
	// Инициализация констант
	РежимИзменение 		= ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Изменение"); 	
	ТипБизнесОбъектаИК 	= ПредопределенноеЗначение("Справочник.УН_БизнесОбъекты.ИК");
	
	// Получить ключ объекта
	Ключ				= Элементы.РеестрИмущественныхКомплексов.ТекущиеДанные.Ссылка;
	
	ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("Ключ",Ключ);
	ПараметрыФормы.Вставить("РежимОбъекта",РежимИзменение);
	ПараметрыФормы.Вставить("ТипБизнесОбъекта", ТипБизнесОбъектаИК); 
	ПараметрыФОрмы.Вставить("ИДРодительскийОбъект");
	
	ОткрытьФорму("Справочник.УН_ИмущественныеКомплексы.Форма.ФормаЭлемента", ПараметрыФормы);	
КонецПроцедуры


// Команда Просмотреть
// Открывает выбранный Имущественный комплекс в режиме просмотра
&НаКлиенте
Процедура ПросмотретьИмущественныйКомплекс(Команда)
	// Инициализация констант
	РежимПросмотр 		= ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Просмотр"); 	
	ТипБизнесОбъектаИК 	= ПредопределенноеЗначение("Справочник.УН_БизнесОбъекты.ИК");
	
	// Получить ключ объекта
	Ключ				= Элементы.РеестрИмущественныхКомплексов.ТекущиеДанные.Ссылка;
	
	ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("Ключ",Ключ);
	ПараметрыФормы.Вставить("РежимОбъекта",РежимПросмотр);
	ПараметрыФормы.Вставить("ТипБизнесОбъекта", ТипБизнесОбъектаИК); 
	ПараметрыФОрмы.Вставить("ИДРодительскийОбъект");
	
	ОткрытьФорму("Справочник.УН_ИмущественныеКомплексы.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры		


// Команда Обновить
// Выполняет обновление данных реестра 
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьРеестр();
КонецПроцедуры

// Изменение Организации
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
		ОбновитьРеестр();
КонецПроцедуры



&НаСервере
Функция СоздатьИмущественныйКомплексНаСервере(ДанныеФормы,Организация, ТипОбъекта)	
	// Создаем новый объект
	ИК = УН_ИмущественныйКомплексФабрика.Создать(Организация,ТипОбъекта); 
	ИК.МенеджерИзмерений();
	
    // Возвращаем заполненный документ в данные формы
    ЗначениеВДанныеФормы(ИК, ДанныеФормы);
КонецФункции
	
&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеФормыНаСервере(ДанныеФормы, Код, Режим)
	// ОбъектФормы
	ОбъектФормы = ДанныеФормыВЗначение(ДанныеФормы, Тип("СправочникОбъект.УН_ИмущественныеКомплексы"));

	// получаем объект
	ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(Код, Режим);
	
	ОбъектФормы = ИК;
	
    // Возвращаем заполненный документ в данные формы
    ЗначениеВДанныеФормы(ОбъектФормы, ДанныеФормы); 

КонецПроцедуры


&НаСервере
Процедура ОбновитьРеестр()
	// Запомним значение перечисления для режима "Просмотр"
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр; 	
	
	// Очистим таблицу
	РеестрИмущественныхКомплексов.Очистить();
	
	// Получим список имущественных комплексов по указанной Организации.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УН_ИмущественныеКомплексы.Организация КАК Организация,
	|	УН_ИмущественныеКомплексы.Код КАК Код,
	|	УН_ИмущественныеКомплексы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УН_ИмущественныеКомплексы КАК УН_ИмущественныеКомплексы
	|ГДЕ
	|	УН_ИмущественныеКомплексы.Организация = &Организация";
	 
	Запрос.Параметры.Вставить("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	 
	Пока Выборка.Следующий() Цикл
		ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(Выборка.Код, РежимПросмотр); 
		
		// Добавляем запись в реестр
		НоваяСтрока = РеестрИмущественныхКомплексов.Добавить();
		НоваяСтрока.Код 			= ИК.Код; 
		НоваяСтрока.Наименование    = ИК.Наименование; 
		НоваяСтрока.Ответственный 	= ИК.Ответственный;
		НоваяСтрока.Идентификатор  	= ИК.Идентификатор;
		НоваяСтрока.ТипОбъекта		= ИК.ТипИмущественногоКомплекса;
		НоваяСтрока.Ссылка			= ИК.Ссылка;
		
	КонецЦикла;	 	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Заполним Орагизацию по умолчанию "первым" значением
	Выборка = Справочники.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		Организация = Выборка.Ссылка;
		ОбновитьРеестр();
		Прервать;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ТестЖСНаСервере(АдресСпискаСообщений)
	// Создать Журнал сообщений
	Журнал = УН_СписокСообщений.НовыйСписокСообщений("ИмущественныйКомплекс","ИК ЛЮ/000000001");

	
	Контекст = УН_СписокСообщенийКлиентСервер.НовыйКонтекст(
		Метаданные.Обработки.Найти("УН_Навигатор").ПолноеИмя(),,								                						// объект метаданных ключ
        Элементы.Найти("ТипОбъектаНедвижимости").Имя,				
		ТипОбъектаНедвижимости); 
		
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0006", ,"Имущественный комплекс");
	
	УН_СписокСообщений.УвеличитьУровень(Журнал);
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0006", , "Основные данные");

	УН_СписокСообщений.УвеличитьУровень(Журнал);
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0001",, "XXX",,,,Контекст);
	
	УН_СписокСообщений.УменьшитьУровень(Журнал); 
	
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0006",, "Измерения"); 
	
	УН_СписокСообщений.УвеличитьУровень(Журнал);
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0001",, "ZZZ");
	
	УН_СписокСообщений.УвеличитьУровень(Журнал);
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0001",, "EEE");
	
	УН_СписокСообщений.УменьшитьУровень(Журнал);
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0001",, "YYY");
	УН_СписокСообщений.Добавить(Журнал, "Общие", "0003",, "AAAA", "1111");

	// возвращаем Журнал
	АдресСпискаСообщений = УН_СписокСообщений.СписокСообщенийВоВременноеХранилище(
		Журнал,
		ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ТестЖС(Команда)
	ТестЖСНаСервере(АдресЖурналаСообщений);
	УН_СписокСообщенийКлиент.ПоказатьСписокСообщений(АдресЖурналаСообщений,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЖС_ЗаписатьНаСервере(АдресЖурналаСообщений)
	Журнал = ПолучитьИзВременногоХранилища(АдресЖурналаСообщений);
	УН_СписокСообщений.ЗаписатьВЖурналСообщений(Журнал);	
КонецПроцедуры

&НаКлиенте
Процедура ЖС_Записать(Команда) 
	ЖС_ЗаписатьНаСервере(АдресЖурналаСообщений);
КонецПроцедуры


#КонецОбласти