////////////////////////////////////////////////////////////////////////////////
// СПИСОК СООБЩЕНИЙ (Сервер)
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Создает список сообщений и возвращает ссылку на него.
// Параметры:
//  КодОбъектаЖурналаСообщений - Строка - должен соответсвовать значению реквизита СправочникСсылка.УН_ОбъектыЖурналаСообщений.Код. Длина 50 символов.
//  ВнутреннийКлюч 			   - Строка - пользовательский идентификатор для Журнала сообщений. Длина 50 символов. 
// 
// Возвращаемое значение:
//  Структура:
//	 * Заголовок - Структура - см. УН_СписокСообщенийКлиентСервер.НовыйСтруктураЗаголовкаСообщения();
// 	 * Сообщения - ТаблицаЗначений - см. НовыйТаблицаСообщений()
Функция НовыйСписокСообщений(Знач КодОбъектаЖурналаСообщений = неопределено, Знач ВнутреннийКлюч = неопределено) Экспорт
	Журнал = Новый Структура();
	Журнал.Вставить("Заголовок", УН_СписокСообщенийКлиентСервер.НовыйСтруктураЗаголовкаСообщения());
	Журнал.Вставить("Сообщения", НовыйТаблицаСообщений());

	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();	
	
	// Начальное заполнение данными                    
	Журнал.Заголовок.КлючЖурналаСообщений = Новый УникальныйИдентификатор;
	
	Если ЗначениеЗаполнено(ВнутреннийКлюч) Тогда 
    	УстановитьВнутреннийКлючСпискаСообщений(Журнал, ВнутреннийКлюч);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(КодОбъектаЖурналаСообщений) Тогда 
    	УстановитьОбъектСпискаСообщений(Журнал, КодОбъектаЖурналаСообщений);
	КонецЕсли;
	
	Журнал.Заголовок.Автор					  = ПараметрыСеанса.ТекущийПользователь;
	Журнал.Заголовок.ДатаВремяСозданияUTC 	  = УниверсальноеВремя(ТекущаяДатаСеанса()); 
	Журнал.Заголовок.ДатаВремяСозданияМестное = ТекущаяДатаСеанса(); 
	Журнал.Заголовок.КоличествоВсего		  = 0; 
	Журнал.Заголовок.КоличествоОшибки		  = 0;
	Журнал.Заголовок.КоличествоПредупреждения = 0;
	Журнал.Заголовок.КоличествоИнформация	  = 0;	
	Журнал.Заголовок.ТекущийУровень			  = 1;          
	Журнал.Заголовок.Родитель				  = 0;      	
	Журнал.Заголовок.ТекущийНомер			  = 0; 
	Журнал.Заголовок.ИмяПриложения    		  = Сеанс.ИмяПриложения; 
	Журнал.Заголовок.ИмяКомпьютера            = Сеанс.ИмяКомпьютера; 
	Журнал.Заголовок.IPАдресКлиента           = Сеанс.IPАдресКлиента; 
	Журнал.Заголовок.НомерСеанса              = Сеанс.НомерСеанса; 
	
	Возврат Журнал; 	
КонецФункции

// Устанавливает значение реквизита "Объект" в заголовочной части списка сообщений
// Параметры:
//  СписокСообщений				- Структура - см.НовыйСписокСообщений()
//  КодОбъектаЖурналаСообщений  - Строка - должен соответсвовать значению реквизита СправочникСсылка.УН_ОбъектыЖурналаСообщений.Код
Процедура УстановитьОбъектСпискаСообщений(СписокСообщений, Знач КодОбъектаЖурналаСообщений) Экспорт
// ПРЕДПОСЫЛКИ 

	// тип корректный? 
	Если ТипЗнч(КодОбъектаЖурналаСообщений) <> Тип("Строка") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Объект");
	КонецЕсли; 
	
	// запись не существует или пустая?
	Если ЗначениеЗаполнено(КодОбъектаЖурналаСообщений) Тогда 
		ОбъектСсылка = Справочники.УН_ОбъектыЖурналаСообщений.НайтиПоКоду(КодОбъектаЖурналаСообщений); 
		
		Если ОбъектСсылка = Справочники.УН_ОбъектыЖурналаСообщений.ПустаяСсылка() Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(КодОбъектаЖурналаСообщений,	
				Метаданные.Справочники.УН_ОбъектыЖурналаСообщений.ПолноеИмя());		
		КонецЕсли;
	Иначе
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("КодОбъектаЖурналаСообщений");
	КонецЕсли;	 

// ОСНОВНАЯ ЧАСТЬ	
	СписокСообщений.Заголовок.ОбъектЖурнала = ОбъектСсылка;	
КонецПроцедуры

// Устанавливает значение реквизита "ВнутреннийКлюч" в заголовке списка сообщений
// Параметры:
//  СписокСообщений	- Структура - см.НовыйСписокСообщений()
//  ВнутреннийКлюч 	- Строка - произвольный пользовательский идентификатор Журнала сообщений, 
//								используется как критерий поиска
//    
Процедура УстановитьВнутреннийКлючСпискаСообщений(СписокСообщений, Знач ВнутреннийКлюч) Экспорт
// ПРЕДПОСЫЛКИ
	Если ТипЗнч(ВнутреннийКлюч) <> Тип("Строка") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ВнутреннийКлюч");
	КонецЕсли; 
	
	СписокСообщений.Заголовок.ВнутреннийКлюч = ВнутреннийКлюч;
КонецПроцедуры

// Добавляет сообщение в конец Журнала на текущий уровень.
// Параметры:
//  СписокСообщений		 - Структура - см.НовыйСписокСообщений()
//  КодПредметнойОбласти - Строка - код предметной области (Справочник.УН_ПредметныеОбласти.Код). Длина 50 символов.   
//  НомерСообщения 		 - Строка - код сообщения в пределах Предметной области (Справочник.УН_ШаблоныСообщений.Код). Длина - 4 символа.
//  ТипСообщения 		 - Строка - одно из значений: "Ошибка", "Предупреждение", "Информация"
//  Параметр1 			 - Строка - Параметр сообщения 1. Длина 50 символов. 
//  Параметр2 			 - Строка - Параметр сообщения 2. Длина 50 символов. 
//  Параметр3 			 - Строка - Параметр сообщения 3. Длина 50 символов.
//  Параметр4 			 - Строка - Параметр сообщения 4. Длина 50 символов. 
//  Контекст 			 - Структура - см.НовыйКонтекст() 
Процедура Добавить (СписокСообщений, 
		Знач КодПредметнойОбласти, 
		Знач НомерСообщения, 
		Знач ТипСообщения = неопределено, 
		Знач Параметр1 = Неопределено,
		Знач Параметр2 = Неопределено, 
		Знач Параметр3 = Неопределено, 
		Знач Параметр4 = Неопределено,
		Знач Контекст = неопределено) Экспорт 

// ПРЕДПОСЫЛКИ 
	// Код предметной области
	Если ТипЗнч(КодПредметнойОбласти) <> Тип("Строка") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("КодПредметнойОбласти");
	КонецЕсли;

	Если ЗначениеЗаполнено(КодПредметнойОбласти) Тогда 
		ПредметнаяОбластьСсылка = Справочники.УН_ПредметныеОбласти.НайтиПоКоду(КодПредметнойОбласти); 
		Если ПредметнаяОбластьСсылка = Справочники.УН_ПредметныеОбласти.ПустаяСсылка() Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(КодПредметнойОбласти, 
				Метаданные.Справочники.УН_ПредметныеОбласти.ПолноеИмя());		
		КонецЕсли;
	Иначе
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("КодПредметнойОбласти");
	КонецЕсли;
	
	// Номер (код) сообщения
	Если ТипЗнч(НомерСообщения) <> Тип("Строка") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("НомерСообщения");
	КонецЕсли;

	Если ЗначениеЗаполнено(НомерСообщения) Тогда 
		ШаблонСообщенияСсылка = Справочники.УН_ШаблоныСообщений.НайтиПоКоду(НомерСообщения,,,ПредметнаяОбластьСсылка); 
		Если ШаблонСообщенияСсылка = Справочники.УН_ШаблоныСообщений.ПустаяСсылка() Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(НомерСообщения, 
				Метаданные.Справочники.УН_ШаблоныСообщений.ПолноеИмя());			
		КонецЕсли;
	Иначе
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("НомерСообщения");
	КонецЕсли;	
	

	// Тип сообщения
	Если ТипСообщения <> Неопределено Тогда 
		Если ТипЗнч(ТипСообщения) <> Тип("Строка") Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ТипСообщения");
		КонецЕсли;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ТипСообщения) Тогда 
		ТипСообщенияСсылка = УН_Общие.ПолучитьСсылкуПоЗначениюПеречисления("УН_ТипыСообщений", ТипСообщения);
		Если ТипСообщенияСсылка = Неопределено Тогда
			УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(ТипСообщения, 
			Метаданные.Перечисления.УН_ТипыСообщений.ПолноеИмя());	
		КонецЕсли;
	Иначе
		// ТипСообщения по умолчанию 
		ТипСообщенияСсылка = ШаблонСообщенияСсылка.ТипСообщения;
		
		// Может быть Тип сообщения был переопределен => используем переопределенный Тип сообщения.
		// Если в настройке Пользователь указан явно - эта запись имеет приоритет 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УН_НастройкаСообщений.Пользователь КАК Пользователь,
		|	УН_НастройкаСообщений.ТипСообщенияЦелевой КАК ТипСообщенияЦелевой
		|ИЗ
		|	РегистрСведений.УН_НастройкаСообщений КАК УН_НастройкаСообщений
		|ГДЕ
		|	УН_НастройкаСообщений.Сообщение = &Сообщение И 
		|		(УН_НастройкаСообщений.Пользователь = &Пользователь ИЛИ
		|		 УН_НастройкаСообщений.Пользователь IS NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь ВОЗР";
		
		Запрос.УстановитьПараметр("Сообщение", ШаблонСообщенияСсылка);
		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		// выборка отсортирована по Пользователям по возрастанию, соответственно, 
		//  * запись специфичная для конкретного пользователя (если есть) будет последней.
		//  * запись специфичная для конкретного пользователя имеет наивысший приоритет.
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТипСообщенияСсылка = ВыборкаДетальныеЗаписи.ТипСообщенияЦелевой;
		КонецЦикла;		
	КонецЕсли;

	
// ОСНОВНАЯ ЧАСТЬ
    // обновим счетчики сообщений Журнала
	СписокСообщений.Заголовок.ТекущийНомер 	 = СписокСообщений.Заголовок.ТекущийНомер + 1;
	СписокСообщений.Заголовок.КоличествоВсего = СписокСообщений.Заголовок.КоличествоВсего + 1;  
	
	// добавим сообщение в Список
	Сообщение = СписокСообщений.Сообщения.Добавить();
	Сообщение.КлючЖурналаСообщений 		= СписокСообщений.Заголовок.КлючЖурналаСообщений;    
	Сообщение.ВнутреннийНомерСообщения 	= СписокСообщений.Заголовок.ТекущийНомер; 
	Сообщение.Родитель 					= СписокСообщений.Заголовок.Родитель;
	Сообщение.ТипСообщения				= ТипСообщенияСсылка; 
	Сообщение.КодПредметнойОбласти      = КодПредметнойОбласти;
	Сообщение.НомерСообщения			= НомерСообщения;
	Сообщение.ТекстСообщения			= ШаблонСообщенияСсылка.Наименование;	
	Сообщение.Параметр1					= Параметр1;
	Сообщение.Параметр2			  		= Параметр2;
	Сообщение.Параметр3			 		= Параметр3;
	Сообщение.Параметр4			 		= Параметр4;
	Сообщение.Контекст					= Контекст;		
	//Сообщение.Контекст					= ЗначениеВСтрокуВнутр(Контекст);	 
	Сообщение.СообщениеСсылка			= ШаблонСообщенияСсылка;    
	Сообщение.ЕстьДопТекст				= ШаблонСообщенияСсылка.ЕстьДопТекст;
	Сообщение.ЕстьКонтекст				= ЕстьКонтекст(Контекст);	

	// Обновим тип сообщения у родительских сообщений по всей иерархии вверх
	// Тип сообщения родителя должен соответствовать самому критичному из числа подчиненных сообщений
	ОбновитьТипыСообщенийВИерархии(СписокСообщений, Сообщение);

	// Обновим статистику сообщений Журнала
	ОбновитьСтатистикуСообщений(СписокСообщений);	
КонецПроцедуры   



// Добавляет список сообщений в существующий список на текущий уровень иерархии.
// Заголовок СпискаСообщений должен содержать актуальные значения полей: ТекущийНомер, Родитель, Уровень!
// 
// Параметры:
//   СписокСообщений - Структура - Существующий список сообщений, в который будут добавлены новые сообщения.
//   СписокСообщенийДляДобавления - Структура - Список сообщений, которые будут добавлены в существующий список.
Процедура ДобавитьСписокСообщений(СписокСообщений, Знач СписокСообщенийДляДобавления) Экспорт;
	
	// Может быть СписокСообщенийДляДобавления не содержит сообщений => выходим
	Если СписокСообщенийДляДобавления.Сообщения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Найдем последнее сообщение в СпискеСообщений
	ВсегоСообщений = СписокСообщений.Количество();
	Если ВсегоСообщений > 0 Тогда
		ПоследнееСообщение = СписокСообщений.Сообщения[ВсегоСообщений - 1];
		ТекущийВнутреннийНомер = ПоследнееСообщение.ВнутреннийНомер;
	Иначе
		// список не содержит сообщений => вернем СписокСообщенийДляДобавления
		СписокСообщений = СписокСообщенийДляДобавления;
		Возврат;
	КонецЕсли;
	
	// Нужен мэппинг внутренних номеров для добавляемых сообщениий
	//  * ключ 		- внутренний номер сообщения в СпискеСообщенийДляДобавления
	//  * значение 	- внутренний номер сообщения в СпискеСообщений после добавления
	// Используется для корректного заполнения поля Родитель
	МэппингКлючей = Новый Соответствие();
	
	СамыйКритичныйТипСообщения = Перечисления.УН_ТипыСообщений.Информация;
	ИндексСамогоКритичногоТипаСообщения = Перечисления.УН_ТипыСообщений.Индекс(СамыйКритичныйТипСообщения); 	
	
	Для каждого ДобавляемоеСообщение из СписокСообщенийДляДобавления.Сообщения Цикл
		ТекущийВнутреннийНомер = ТекущийВнутреннийНомер + 1;
		МэппингКлючей.Вставить(ДобавляемоеСообщение.ВнутреннийНомер, ТекущийВнутреннийНомер);
		
		Если ДобавляемоеСообщение.Родитель = 0 Тогда
			Родитель = СписокСообщений.Заголовок.Родитель;
			
			// Для того, чтобы не обновлять типы сообщений в иерархии для каждого добавляемого сообщения, 
			// сделаем это один раз после добавления всех сообщений. 
			// Нужен самый критичный тип сообщения. 
			// Интересуют только добавляемые сообщения у которых Родитель = 0.
			ИндексТипаСообщения = Перечисления.УН_ТипыСообщений.Индекс(ДобавляемоеСообщение.Тип);
			Если ИндексСамогоКритичногоТипаСообщения > ИндексТипаСообщения Тогда
				СамыйКритичныйТипСообщения = ДобавляемоеСообщение.ТипСообщения;
				ИндексСамогоКритичногоТипаСообщения	= ИндексТипаСообщения;
				
				// запомним сообщение, оно нам пригодится позже
				Сообщение = ДобавляемоеСообщение;
			КонецЕсли;
	
		Иначе			
			Родитель = МэппингКлючей[ДобавляемоеСообщение.Родитель];
		КонецЕсли;
		
		НовоеСообщение = СписокСообщений.Сообщения.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеСообщение, ДобавляемоеСообщение);	
		НовоеСообщение.ВнутреннийНомер = ТекущийВнутреннийНомер;
		НовоеСообщение.КлючЖурналаСообщений = СписокСообщений.Заголовок.КлючЖурналаСообщений;
		НовоеСообщение.Родитель = Родитель;
	КонецЦикла;
	
	// Обновим типы сообщений в иерархии
	Сообщение.ТипСообщения = СамыйКритичныйТипСообщения;
	ОбновитьТипыСообщенийВИерархии(СписокСообщений, Сообщение);
	
	// Обновим уровень вложенности и текущий номер
	ВсегоСообщений = СписокСообщений.Количество();
	Если ВсегоСообщений > 0 Тогда
		ПоследнееСообщение = СписокСообщений.Сообщения[ВсегоСообщений - 1];
		Уровень = УровеньвложенностиСообщения(СписокСообщений, ПоследнееСообщение.ВнутреннийНомер);
		
		СписокСообщений.Заголовок.Уровень 		= Уровень;
		СписокСообщений.Заголовок.ТекущийНомер	= ПоследнееСообщение.ВнутреннийНомер;
	КонецЕсли;

	// Обновим статистику сообщений Журнала
	ОбновитьСтатистикуСообщений(СписокСообщений);
КонецПроцедуры



// Увеличивает уровень вложенности сообщений на 1 относительно текущего сообщения    
// Параметры:
//  СписокСообщений		- Структура - см.НовыйСписокСообщений()
Процедура УвеличитьУровень(СписокСообщений) Экспорт;
	// новым Родителем становится последнее сообщение в Журнале
	СписокСообщений.Заголовок.Родитель = СписокСообщений.Заголовок.ТекущийНомер; 
	СписокСообщений.Заголовок.ТекущийУровень = СписокСообщений.Заголовок.ТекущийУровень + 1;	
КонецПроцедуры

//Уменьшает уровень вложенности сообщений на 1.  
// Параметры:
//  СписокСообщений	- Структура - см.НовыйСписокСообщений()
Процедура УменьшитьУровень(СписокСообщений) Экспорт;	
	// новым Родителем становится Родитель родителя текущего сообщения 
	ТекущийРодитель = СписокСообщений.Заголовок.Родитель; 
	НовыйРодитель   = СписокСообщений.Сообщения[ТекущийРодитель].Родитель;
	СписокСообщений.Заголовок.Родитель = НовыйРодитель; 
	
	// корректируем уровень 
	СписокСообщений.Заголовок.ТекущийУровень = СписокСообщений.Заголовок.ТекущийУровень - 1; 	
	Если СписокСообщений.Заголовок.ТекущийУровень <= 1 Тогда
		СписокСообщений.Заголовок.Родитель = 0;
		СписокСообщений.Заголовок.ТекущийУровень = 1;
	КонецЕсли;	
КонецПроцедуры



// Сохраняет данные Журнала сообщений в информационной базе
// Параметры:
//  СписокСообщений		 - Структура - см.НовыйСписокСообщений()
//  КлючЖурналаСообщений - УникальныйИдентификатор - содержит ключ записи Журнала сообщений в случае успешного сохранения
Процедура ЗаписатьВЖурналСообщений(СписокСообщений, КлючЖурналаСообщений = неопределено) Экспорт;  
// ПРЕДПОСЫЛКИ
	ПроверитьСписокСообщений(СписокСообщений);

// ОСНОВНАЯ ЧАСТЬ	
	НачатьТранзакцию();

	Попытка 
		// Заголовок
		МенеджерЗаписи = РегистрыСведений.УН_ЖурналСообщений.СоздатьМенеджерЗаписи();		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СписокСообщений.Заголовок); 
		МенеджерЗаписи.Записать();
		
		// Сообщения
		НаборЗаписей = РегистрыСведений.УН_СообщенияЖурнала.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КлючЖурналаСообщений.Установить(СписокСообщений.Заголовок.КлючЖурналаСообщений);  

		Для Каждого Сообщение Из СписокСообщений.Сообщения Цикл 
		   НоваяЗапись = НаборЗаписей.Добавить(); 
		   ЗаполнитьЗначенияСвойств(НоваяЗапись, Сообщение); 
		   
		   // контекст сообщения
		   Контекст =  ЗначениеВСтрокуВнутр(Сообщение.Контекст);
		   НоваяЗапись.Контекст = Контекст; 
		КонецЦикла; 

		НаборЗаписей.Записать();		
		
		ЗафиксироватьТранзакцию();	
		КлючЖурналаСообщений = СписокСообщений.Заголовок.КлючЖурналаСообщений; 
	Исключение
		ОтменитьТранзакцию(); 
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("УН_СписокСообщений", УровеньЖурналаРегистрации.Ошибка,,,Ошибка);
		ВызватьИсключение(Ошибка, КатегорияОшибки.ОшибкаКонфигурации);
	КонецПопытки;	
КонецПроцедуры



// Возвращает данные заголовка списка сообщений
// Параметры: 
//  СписокСообщений		 - Структура - см.НовыйСписокСообщений()
// 						 - ВременноеХранилище -  адрес списка сообщений во временном хранилище	
// Возвращаемое значение:
//  Структура - см. НовыйЗаголовок();
Функция ДанныеЗаголовкаСообщений(Знач СписокСообщений) Экспорт;
	Результат = Неопределено;
	НедопустимыйТипПараметра = Истина;
	
	Если ЭтоАдресВременногоХранилища(СписокСообщений) Тогда
		Попытка
			Заголовок = ПолучитьИзВременногоХранилища(СписокСообщений).Заголовок;
			НедопустимыйТипПараметра = Ложь;
		Исключение
			ВызватьИсключение(ОписаниеОшибки(), КатегорияОшибки.ОшибкаКонфигурации);	
		КонецПопытки;
	КонецЕсли;
	
	Если ТипЗнч(СписокСообщений) = Тип("Структура") Тогда
		НедопустимыйТипПараметра = Ложь;
		Попытка
			Заголовок = СписокСообщений.Заголовок;
		Исключение
			ВызватьИсключение(ОписаниеОшибки(), КатегорияОшибки.ОшибкаКонфигурации);	
		КонецПопытки;
	КонецЕсли;
	
	Если НедопустимыйТипПараметра = Истина Тогда
		Возврат Результат;
	КонецЕсли;
		
	Результат = УН_СписокСообщенийКлиентСервер.НовыйСтруктураЗаголовкаСообщения();
	ЗаполнитьЗначенияСвойств(Результат, Заголовок);	
	Возврат Результат;
КонецФункции

// Выгружает сообщения из таблицы значений в массив.
//
// Параметры:
//   Сообщения       - ТаблицаЗначений - сообщения, см. НовыйТаблицаСообщений()
//   МассивСообщений - Массив - элементы массива имеют структуру, см. НовыйТаблицаСообщений()
//                  - Неопределено, если не получилось преобразовать в массив.
Процедура ВыгрузитьСообщенияВМассив(Знач Сообщения, МассивСообщений) Экспорт;
// ПРЕДПОСЫЛКИ	
	Если ТипЗнч(Сообщения) <> Тип("ТаблицаЗначений") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Сообщения");
	КонецЕсли;

// ОСНОВНАЯ ЧАСТЬ	
	ТЗСообщения = Сообщения;
	ТЗСообщения.Сортировать("КлючЖурналаСообщений, ВнутреннийНомерСообщения");	
	
	МассивСообщений = Неопределено;
	
	Попытка
		МассивСообщений = ОбщегоНазначения.ТаблицаЗначенийВМассив(Сообщения);
	Исключение    	
		Ошибка = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("УН_СписокСообщений", УровеньЖурналаРегистрации.Ошибка,,,Ошибка);		
		ВызватьИсключение(ОписаниеОшибки(),КатегорияОшибки.ОшибкаКонфигурации);
	КонецПопытки;	
КонецПроцедуры

// Выгружает сообщения в дерево значений на основании таблицы значений сообщений.
// Если установлен отбор по типам сообщений, дерево строится без иерархии.
//
// Параметры:
//   Сообщения      - ТаблицаЗначений - таблица с сообщениями для выгрузки
//   ДеревоЗначений - ДеревоЗначений  - дерево значений, в которое будут выгружены сообщения
//   ТипыСообщений  - Структура       - структура с типами сообщений и их отбором. Содержит три элемента:
//      * Ошибка - Булево - флаг отбора по типу Ошибка
//      * Предупреждение - Булево - флаг отбора по типу Предупреждение
//      * Информация - Булево - флаг отбора по типу Информация											
Процедура ВыгрузитьСообщенияВДеревоЗначений(Знач Сообщения, ДеревоЗначений, Знач ТипыСообщений = неопределено) Экспорт;
// ПРЕДПОСЫЛКИ	
	Если ТипЗнч(Сообщения) <> Тип("ТаблицаЗначений") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений");
	КонецЕсли;
	
	Если ТипЗнч(ДеревоЗначений) <> Тип("ДеревоЗначений") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ДеревоЗначений");
	КонецЕсли;
	
// ОСНОВНАЯ ЧАСТЬ
	ТЗСообщения = Сообщения;
	ТЗСообщения.Сортировать("КлючЖурналаСообщений, ВнутреннийНомерСообщения");
	
	ДеревоЗначений.Строки.Очистить();
	
	СИерархией = Истина;  // по умолчанию строим дерево с иерархией
	
	Если ТипыСообщений <> Неопределено Тогда
		Для каждого ТипСообщения из ТипыСообщений Цикл
			Если ТипСообщения.Значение = Ложь Тогда
				СИерархией = Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;	

    // используем для быстрого доступа к элементам для построения иерархии
    ЭлементыДерева = Новый Соответствие;
    
	Ошибка 		   	= Перечисления.УН_ТипыСообщений.Ошибка;
	Предупреждение 	= Перечисления.УН_ТипыСообщений.Предупреждение;
	Информация 	  	= Перечисления.УН_ТипыСообщений.Информация;

	Для Каждого Сообщение Из ТЗСообщения Цикл
		// Тип сообщения
		// ошибки
		Если Сообщение.ТипСообщения = Ошибка 
			И ТипыСообщений.Ошибка = Ложь Тогда 
			Продолжить;
		КонецЕсли;
		
		// предупреждения
		Если Сообщение.ТипСообщения = Предупреждение 
			И ТипыСообщений.Предупреждение = Ложь Тогда 
			Продолжить;		
		КонецЕсли;

		// информация
		Если Сообщение.ТипСообщения = Информация 
			И ТипыСообщений.Информация = Ложь Тогда 
			Продолжить;	
		КонецЕсли;
		
		Если Сообщение.Родитель <> Неопределено 
			И Сообщение.Родитель <> 0 
			И СИерархией Тогда
			
            // Ищем родительский элемент
            РодительскаяСтрока = ЭлементыДерева.Получить(Сообщение.Родитель); 
            Если РодительскаяСтрока = Неопределено Тогда
                СтрокаДерева = ДеревоЗначений.Строки.Добавить();
			Иначе
				СтрокаДерева = РодительскаяСтрока.Строки.Добавить();
			КонецЕсли;	
		Иначе
			СтрокаДерева = ДеревоЗначений.Строки.Добавить();	
		КонецЕсли;  
		
		ТипСообщения 					  	  = Сообщение.ТипСообщения; 
		ТипСообщенияКартинка 			  	  = ИндексКартинкиДляТипаСообщения(ТипСообщения);
				
		СтрокаДерева.КлючЖурналаСообщений 	  = Сообщение.КлючЖурналаСообщений;
		СтрокаДерева.ВнутреннийНомерРодителя  = Сообщение.Родитель;		
		СтрокаДерева.ВнутреннийНомерСообщения = Сообщение.ВнутреннийНомерСообщения;
		СтрокаДерева.ТипСообщения 		  	  = ТипСообщения;       
		СтрокаДерева.ТипСообщенияКартинка 	  = ТипСообщенияКартинка;  		
		СтрокаДерева.КодПредметнойОбласти 	  = Сообщение.КодПредметнойОбласти;	
        СтрокаДерева.НомерСообщения 	  	  = Сообщение.НомерСообщения;
        СтрокаДерева.ТекстСообщения       	  = УН_СписокСообщенийКлиентСервер.ЗаполнитьТекстСообщения(
													Сообщение.ТекстСообщения, 
													Сообщение.Параметр1,
													Сообщение.Параметр2,
													Сообщение.Параметр3,
													Сообщение.Параметр4); 
		СтрокаДерева.Ссылка	  	  			  = Сообщение.СообщениеСсылка; 
		
		// Доптекст									
        СтрокаДерева.ЕстьДопТекст	      	  = Сообщение.ЕстьДопТекст;    
		СтрокаДерева.ЕстьДопТекстКартинка 	  = -1;
		Если СтрокаДерева.ЕстьДопТекст Тогда
			СтрокаДерева.ЕстьДопТекстКартинка = 0;
		КонецЕсли;
		
		// контекст
		Если ТипЗнч(Сообщение.Контекст) = Тип("Структура") Тогда
			СтрокаДерева.Контекст 			  = УН_СписокСообщенийКлиентСервер.НовыйСтруктураКонтекст();
			СтрокаДерева.Контекст 			  = Сообщение.Контекст;
		Иначе
			СтрокаДерева.Контекст 			  = Сообщение.Контекст;
		КонецЕсли;	
		СтрокаДерева.ЕстьКонтекст 			  = ЕстьКонтекст(Сообщение.Контекст);	
		СтрокаДерева.ЕстьКонтекстКартинка 	  = -1;
		Если СтрокаДерева.ЕстьКонтекст Тогда 
			СтрокаДерева.ЕстьКонтекстКартинка = 0;
		КонецЕсли;

        // Сохраняем ссылку на строку дерева для быстрого доступа
        ЭлементыДерева.Вставить(Сообщение.ВнутреннийНомерСообщения, СтрокаДерева);  
    КонецЦикла;    
КонецПроцедуры 


// Помещает Список сообщений во временное хранилище с указанным уникальным идентификатором и 
// возвращает ссылку на адрес временного хранилища.
// Параметры: 
//  СписокСообщений	- Структура - см.НовыйСписокСообщений()
//	Адрес 			- УникальныйИдентификатор - см. документацию к ПоместитьВоВременноеХранилище()
// 
// Возвращаемое значение:
//  Строка - адрес временного хранилища
Функция СписокСообщенийВоВременноеХранилище(Знач СписокСообщений, Знач Адрес = неопределено) Экспорт;
	Возврат ПоместитьВоВременноеХранилище(СписокСообщений,Адрес);
КонецФункции

// Получает список сообщений из временного хранилища.
//
// Параметры:
//   АдресВременногоХранилища - Строка - Адрес временного хранилища, содержащего список сообщений
//
// Возвращаемое значение:
//   Произвольный - Список сообщений, полученный из временного хранилища, или Неопределено, если адрес хранилища недействителен
Функция СписокСообщенийИзВременногоХранилища(Знач АдресВременногоХранилища) Экспорт;
	Результат = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		Попытка
			Результат = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		Исключение
			ВызватьИсключение(ОписаниеОшибки(), КатегорияОшибки.ОшибкаКонфигурации);	
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


// Возвращает количество ошибок в списке сообщений.
//
// Параметры:
//   СписокСообщений - Структура или АдресВременногоХранилища - список сообщений или адрес во временном хранилище
//
// Возвращаемое значение:
//   Число - количество ошибок в списке сообщений
Функция КоличествоОшибок(Знач СписокСообщений) Экспорт
    // Проверка на пустое значение или Неопределено
    Если СписокСообщений = Неопределено ИЛИ СписокСообщений = "" Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("СписокСообщений");
    КонецЕсли;

    // Преобразование из временного хранилища, если необходимо
    Если ТипЗнч(СписокСообщений) = Тип("Строка") И ЭтоАдресВременногоХранилища(СписокСообщений) Тогда
        СписокСообщений = ПолучитьИзВременногоХранилища(СписокСообщений);
    КонецЕсли;

    // Проверка типа СписокСообщений
    Если ТипЗнч(СписокСообщений) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений");
    КонецЕсли;

    // Проверка наличия свойства Заголовок
    Если НЕ СписокСообщений.Свойство("Заголовок") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Заголовок", "СписокСообщений");
    КонецЕсли;

    // Проверка типа Заголовок
    Если ТипЗнч(СписокСообщений.Заголовок) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений.Заголовок");
    КонецЕсли;

    // Получение количества ошибок
    КоличествоОшибок = 0;
    Если НЕ СписокСообщений.Заголовок.Свойство("КоличествоОшибки", КоличествоОшибок) Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("КоличествоОшибки", "СписокСообщений.Заголовок");
    КонецЕсли;

    Возврат КоличествоОшибок;
КонецФункции

// Возвращает количество сообщений с типом Предупреждение в списке сообщений.
//
// Параметры:
//   СписокСообщений - Структура или АдресВременногоХранилища - список сообщений или адрес во временном хранилище
//
// Возвращаемое значение:
//   Число - количество предупреждений в списке сообщений
Функция КоличествоПредупреждений(Знач СписокСообщений) Экспорт
    // Проверка на пустое значение или Неопределено
    Если СписокСообщений = Неопределено ИЛИ СписокСообщений = "" Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("СписокСообщений");
    КонецЕсли;

    // Преобразование из временного хранилища, если необходимо
    Если ТипЗнч(СписокСообщений) = Тип("Строка") И ЭтоАдресВременногоХранилища(СписокСообщений) Тогда
        СписокСообщений = ПолучитьИзВременногоХранилища(СписокСообщений);
    КонецЕсли;

    // Проверка типа СписокСообщений
    Если ТипЗнч(СписокСообщений) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений");
    КонецЕсли;

    // Проверка наличия свойства Заголовок
    Если НЕ СписокСообщений.Свойство("Заголовок") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Заголовок", "СписокСообщений");
    КонецЕсли;

    // Проверка типа Заголовок
    Если ТипЗнч(СписокСообщений.Заголовок) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений.Заголовок");
    КонецЕсли;

    // Получение количества ошибок
    КоличествоПредупреждений = 0;
    Если НЕ СписокСообщений.Заголовок.Свойство("КоличествоПредупреждения", КоличествоПредупреждений) Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("КоличествоПредупреждения", "СписокСообщений.Заголовок");
    КонецЕсли;

    Возврат КоличествоПредупреждений;
КонецФункции		

// Возвращает количество сообщений с типом Инфомация в списке сообщений.
//
// Параметры:
//   СписокСообщений - Структура или АдресВременногоХранилища - список сообщений или адрес во временном хранилище
//
// Возвращаемое значение:
//   Число - количество сообщений с типом Информация в списке сообщений
Функция КоличествоИнформация(Знач СписокСообщений) Экспорт
    // Проверка на пустое значение или Неопределено
    Если СписокСообщений = Неопределено ИЛИ СписокСообщений = "" Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("СписокСообщений");
    КонецЕсли;

    // Преобразование из временного хранилища, если необходимо
    Если ТипЗнч(СписокСообщений) = Тип("Строка") И ЭтоАдресВременногоХранилища(СписокСообщений) Тогда
        СписокСообщений = ПолучитьИзВременногоХранилища(СписокСообщений);
    КонецЕсли;

    // Проверка типа СписокСообщений
    Если ТипЗнч(СписокСообщений) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений");
    КонецЕсли;

    // Проверка наличия свойства Заголовок
    Если НЕ СписокСообщений.Свойство("Заголовок") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Заголовок", "СписокСообщений");
    КонецЕсли;

    // Проверка типа Заголовок
    Если ТипЗнч(СписокСообщений.Заголовок) <> Тип("Структура") Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("СписокСообщений.Заголовок");
    КонецЕсли;

    // Получение количества ошибок
    КоличествоИнформация = 0;
    Если НЕ СписокСообщений.Заголовок.Свойство("КоличествоИнформация", КоличествоИнформация) Тогда
        УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("КоличествоИнформация", "СписокСообщений.Заголовок");
    КонецЕсли;

    Возврат КоличествоИнформация;
КонецФункции

// Возвращает уровень вложенности сообщения с указанным внутренним номером.
//
// Параметры:
//   СписокСообщений - Структура - Список сообщений, в котором производится поиск.
//   ВнутреннийНомер - Число - Внутренний номер сообщения, для которого определяется уровень вложенности.
//
// Возвращаемое значение:
//   Число - Уровень вложенности сообщения.
Функция УровеньВложенностиСообщения(Знач СписокСообщений, Знач ВнутреннийНомер) Экспорт
	Если СписокСообщений.Сообщения.Количество() = 0 Тогда
		Возврат 0; 
	КонецЕсли;

	Сообщения = СписокСообщений.Сообщения;
	ТекущийВнутреннийНомер = ВнутреннийНомер;
	Уровень = 0;

	Пока Истина Цикл
		Сообщение = Сообщения.Найти(ТекущийВнутреннийНомер, "ВнутреннийНомерСообщения");
		Если Сообщение = Неопределено Тогда
			Прервать;
		КонецЕсли;

		Родитель = Сообщение.Родитель;
		Если Родитель = 0 ИЛИ Родитель = Неопределено Тогда
			Прервать;
		КонецЕсли;

		ТекущийВнутреннийНомер = Родитель;
		Уровень = Уровень + 1;
	КонецЦикла;

	Возврат Уровень;
КонецФункции


// Определяет статус списка сообщений на основе наличия ошибок, предупреждений и информационных сообщений.
//
// Параметры:
//   СписокСообщений - Структура - объект, содержащий информацию о списке сообщений и его заголовке
//
// Возвращаемое значение:
//   ПеречислениеСсылка.УН_ТипыСообщений - статус списка сообщений (Ошибка, Предупреждение, Информация или Неопределено)
Функция СтатусСпискаСообщений(Знач СписокСообщений) Экспорт;
    Если СписокСообщений.Сообщения.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;

    Заголовок = СписокСообщений.Заголовок;
    Ошибка = Перечисления.УН_ТипыСообщений.Ошибка;
    Предупреждение = Перечисления.УН_ТипыСообщений.Предупреждение;
    Информация = Перечисления.УН_ТипыСообщений.Информация; 

    Если Заголовок.КоличествоОшибки > 0 Тогда
        Возврат Ошибка;
    ИначеЕсли Заголовок.КоличествоПредупреждения > 0 Тогда
        Возврат Предупреждение;
    ИначеЕсли Заголовок.КоличествоИнформация > 0 Тогда
        Возврат Информация;
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции





#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс  
// Создает поля в таблице заголовков.
// 
// Параметры:
//  ТаблицаЗаголовок - ТаблицаЗначений - таблица заголовков
Процедура УстановитьСтруктуруТаблицыЗаголовков(ТаблицаЗаголовок) Экспорт;
// ПРЕДПОСЫЛКИ
	Если ТаблицаЗаголовок = неопределено Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ТаблицаЗаголовок");
	КонецЕсли; 
	
	Если ТипЗнч(ТаблицаЗаголовок) <> Тип("ТаблицаЗначений") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ТаблицаЗаголовок");
	КонецЕсли;

// ОСНОВНАЯ ЧАСТЬ
	// Определение типов
	ТипСтрока30  = ОбщегоНазначения.ОписаниеТипаСтрока(30);	
	ТипСтрока50  = ОбщегоНазначения.ОписаниеТипаСтрока(50);
	ТипСтрока255 = ОбщегоНазначения.ОписаниеТипаСтрока(255);	
	ТипЧисло6	 = ОбщегоНазначения.ОписаниеТипаЧисло(6,0,ДопустимыйЗнак.Неотрицательный);
	ТипЧисло7	 = ОбщегоНазначения.ОписаниеТипаЧисло(7,0,ДопустимыйЗнак.Неотрицательный);	
	ТипЧисло10	 = ОбщегоНазначения.ОписаниеТипаЧисло(10,0,ДопустимыйЗнак.Неотрицательный);	
	ТипДата 	 = ОбщегоНазначения.ОписаниеТипаДата();
		
	// Создание полей
	ТаблицаЗаголовок.Колонки.Добавить("КлючЖурналаСообщений"); 	
	ТаблицаЗаголовок.Колонки.Добавить("ВнутреннийКлюч",ТипСтрока50);   
	ТаблицаЗаголовок.Колонки.Добавить("ОбъектЖурнала");
	ТаблицаЗаголовок.Колонки.Добавить("Автор");    
	ТаблицаЗаголовок.Колонки.Добавить("ДатаВремяСозданияUTC", ТипДата); 
	ТаблицаЗаголовок.Колонки.Добавить("ДатаВремяСозданияМестное", ТипДата);  
	ТаблицаЗаголовок.Колонки.Добавить("КоличествоВсего", ТипЧисло7);
    ТаблицаЗаголовок.Колонки.Добавить("КоличествоОшибки", ТипЧисло6);
	ТаблицаЗаголовок.Колонки.Добавить("КоличествоПредупреждения", ТипЧисло6);
	ТаблицаЗаголовок.Колонки.Добавить("КоличествоИнформация", ТипЧисло6);
	ТаблицаЗаголовок.Колонки.Добавить("ИмяПриложения", ТипСтрока30);
	ТаблицаЗаголовок.Колонки.Добавить("ИмяКомпьютера", ТипСтрока255);
	ТаблицаЗаголовок.Колонки.Добавить("IPАдресКлиента", ТипСтрока50);	
	ТаблицаЗаголовок.Колонки.Добавить("НомерСеанса", ТипЧисло10);		
КонецПроцедуры


// Создает поля для таблицы сообщений.
// Процедура используется во вногих местах с тем, чтобы гарантировать непротиворечивость данных
// Параметры:
//  ТаблицаСообщений - ТаблицаЗначений - таблица сообщений
//
Процедура УстановитьСтруктуруТаблицыСообщений(ТаблицаСообщений) Экспорт;
// ПРЕДПОСЫЛКИ
	Если ТаблицаСообщений = неопределено Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ТаблицаСообщений");
	КонецЕсли; 
	
	Если ТипЗнч(ТаблицаСообщений) <> Тип("ТаблицаЗначений") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ТаблицаСообщений");
	КонецЕсли; 
		
// ОСНОВНАЯ ЧАСТЬ	
	// Квалификаторы 
	Строка50 	= Новый КвалификаторыСтроки(50);
	Строка150 	= Новый КвалификаторыСтроки(150);
	Строка4     = Новый КвалификаторыСтроки(4);
		
	// Типы  
	Тип_Число 	 				= Новый ОписаниеТипов("Число"); 
	Тип_КодПредметнойОбласти	= Новый ОписаниеТипов("Строка", ,Строка50);
	Тип_Параметр  				= Новый ОписаниеТипов("Строка", ,Строка50);
	Тип_ТипСообщения 			= Новый ОписаниеТипов("ПеречислениеСсылка.УН_ТипыСообщений");
	Тип_НомерСообщения 			= Новый ОписаниеТипов("Строка", ,Строка4 ); 
	Тип_ТекстСообщения 			= Новый ОписаниеТипов("Строка", ,Строка150);

	ТаблицаСообщений.Колонки.Очистить();	
	
	// создаем поля
	ТаблицаСообщений.Колонки.Добавить("КлючЖурналаСообщений"); 	
	ТаблицаСообщений.Колонки.Добавить("ВнутреннийНомерСообщения", Тип_Число);   
	ТаблицаСообщений.Колонки.Добавить("Родитель" ,Тип_Число);
	ТаблицаСообщений.Колонки.Добавить("ТипСообщения" ,Тип_ТипСообщения);    
	ТаблицаСообщений.Колонки.Добавить("КодПредметнойОбласти" ,Тип_КодПредметнойОбласти);  
	ТаблицаСообщений.Колонки.Добавить("НомерСообщения"	,Тип_НомерСообщения);
    ТаблицаСообщений.Колонки.Добавить("ТекстСообщения" ,Тип_ТекстСообщения);
	ТаблицаСообщений.Колонки.Добавить("Параметр1" ,Тип_Параметр);
	ТаблицаСообщений.Колонки.Добавить("Параметр2" ,Тип_Параметр);
	ТаблицаСообщений.Колонки.Добавить("Параметр3" ,Тип_Параметр);
	ТаблицаСообщений.Колонки.Добавить("Параметр4" ,Тип_Параметр);
	ТаблицаСообщений.Колонки.Добавить("Контекст");
	ТаблицаСообщений.Колонки.Добавить("СообщениеСсылка");  
	ТаблицаСообщений.Колонки.Добавить("ЕстьДопТекст");
	ТаблицаСообщений.Колонки.Добавить("ЕстьКонтекст");	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает и возвращает таблицу значений для хранения списка сообщений Журнала сообщений
// Возвращаемое значение:
//  ТаблицаЗначений:
//		* КлючЖурналаСообщений 		- строка - уникальный идентификтаор Журнала сообщений
// 		* ВнутреннийНомерСообщения 	- число	 - порядковый номер сообщения в списке
//		* Родитель					- число  - порядковый номер сообщения, который является родителем тек.сообщения
// 		* ТипСообщения				- ПеречислениеСсылка.УН_ТипСообщения - тип сообщения: Ошибка, Предупреждение, Информация
// 		* КодПредметнойОбласти		- строка(50) - КодПредметнойОбласти значение кода элемента (СправочникСсылка.УН_ПредметныеОбласти)
//		* НомерСообщения			- строка(4) - код сообщения (СправочникСсылка.УН_ШаблоныСообщений.Код)
//		* ТекстСообщения			- строка(150) - текст шаблона сообщения
// 		* Параметр1					- строка(50) - значение Параметра 1
//		* Параметр2					- строка(50) - значение Параметра 2
// 		* Параметр3					- строка(50) - значение Параметра 3
// 		* Параметр4	      			- строка(50) - значение Параметра 4
// 		* Контекст					- структура - контекст сообщения:
// 			** ОбъектМетаданных		- строка
//			** ОбъектМетаданныхКлюч - строка
//			** ИмяРеквизита			- строка
// 			** ЗначениеРеквизита	- строка
//		* СообщениеСсылка			- СправочникСсылка.УН_ШаблоныСообщений - ссылка на шаблон сообщения
//		ЕстьДопТекст				- булево - признак наличия дополнительного текста 
//		ЕстьКонтекст				- булево - признак наличия контекста
//
Функция НовыйТаблицаСообщений() 
	Сообщения = Новый ТаблицаЗначений;
	УстановитьСтруктуруТаблицыСообщений(Сообщения);	
	Возврат Сообщения; 
КонецФункции


// Обновляет типы сообщений в иерархии на основе типа переданного сообщения.
// Если подчиненное сообщение имеет более критичный тип сообщения, чем тип сообщения Родителя, 
// то тип сообщения Родителя изменяется на тип подчиненного сообщения.
//
// Параметры:
//   СписокСообщений - Структура - см. НовыйСписокСообщений()
//   Сообщение - Структура - см. УН_СписокСообщенийКлиентСервер.НовыйСтруктураСообщения()
//
Процедура ОбновитьТипыСообщенийВИерархии(СписокСообщений, Знач Сообщение) 
	Если СписокСообщений.Сообщения.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;

	Сообщения = СписокСообщений.Сообщения;
	ТекущееСообщение = Сообщение;
	ВнутреннийНомерРодителя = Сообщение.Родитель;

	Пока Истина Цикл
		ВышестоящееСообщение = Сообщения.Найти(ВнутреннийНомерРодителя, "ВнутреннийНомерСообщения");
		Если ВышестоящееСообщение = Неопределено Тогда
			Прервать;
		КонецЕсли;

		ИндексТипаСообщенияРодителя = Перечисления.УН_ТипыСообщений.Индекс(ВышестоящееСообщение.ТипСообщения);
		ИндексТипаСообщенияТекущего = Перечисления.УН_ТипыСообщений.Индекс(ТекущееСообщение.ТипСообщения);	
		
		Если ИндексТипаСообщенияРодителя > ИндексТипаСообщенияТекущего Тогда 
			ВышестоящееСообщение.ТипСообщения = Сообщение.ТипСообщения; 
		КонецЕсли;
		
		ВнутреннийНомерРодителя = ВышестоящееСообщение.Родитель;
		ТекущееСообщение = ВышестоящееСообщение;
	КонецЦикла;
КонецПроцедуры


// Обновляет статистику сообщений в переданном списке сообщений.
//
// Параметры:
//   СписокСообщений - Структура - Список сообщений, см. НовыйСписокСообщений()
Процедура ОбновитьСтатистикуСообщений(СписокСообщений)
	ТипОшибка = Перечисления.УН_ТипыСообщений.Ошибка;
	ТипПредупреждение = Перечисления.УН_ТипыСообщений.Предупреждение;
	ТипИнформация = Перечисления.УН_ТипыСообщений.Информация;
	
	Ошибок 			= 0;
	Предупреждений 	= 0;
	Информация 		= 0; 
	Всего			= 0;
	
	Для каждого Сообщение из СписокСообщений.Сообщения Цикл
		Всего = Всего + 1;
		
		Если Сообщение.ТипСообщения = ТипОшибка Тогда
			Ошибок = Ошибок +1;
		ИначеЕсли Сообщение.ТипСообщения = ТипПредупреждение Тогда
			Предупреждений = Предупреждений + 1;
		ИначеЕсли Сообщение.ТипСообщения = ТипИнформация Тогда
			Информация = Информация + 1;
		Иначе
		КонецЕсли;		
	КонецЦикла;
			
	СписокСообщений.Заголовок.КоличествоОшибки 			= Ошибок;	
	СписокСообщений.Заголовок.КоличествоПредупреждения  = Предупреждений;
	СписокСообщений.Заголовок.КоличествоИнформация 		= Информация;
	СписокСообщений.Заголовок.КоличествоВсего			= Всего;
КонецПроцедуры


// Процедура вызывает исключение, если есть ошибки 
// Параметры:
//  СписокСообщений	- Структура - см.НовыйСписокСообщений()
Процедура ПроверитьСписокСообщений(СписокСообщений)
	// Проверка реквизита "Объект Журнала"
	Объект = СписокСообщений.Заголовок.ОбъектЖурнала; 
	Если Объект = неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ОбъектЖурнала");		
	КонецЕсли;
КонецПроцедуры

// Возвращает номера картинки в коллекции картинок для значения перечислени УН_ТипыСообщений.
// Коллекция картинок содержит изображения в следующей последовательности: Ошибка, Предупреждение, Информация
// Параметры: 
//  ТипСообщения - ПеречислениеСсылка.УН_ТипыСообщений - значение перечисления
// 
// Возвращаемое значение:
//  Число - номер картинки в коллекции картинок. Возвращает значение -1, 
//					если не удалось значение перечисления.
Функция ИндексКартинкиДляТипаСообщения(Знач ТипСообщения)
	Ошибка 		   = Перечисления.УН_ТипыСообщений.Ошибка;
	Предупреждение = Перечисления.УН_ТипыСообщений.Предупреждение;
	Информация 	   = Перечисления.УН_ТипыСообщений.Информация;
	
	Результат  = -1;
	
	// ошибка
	Если ТипСообщения = Ошибка Тогда
		Результат = 0;
	КонецЕсли; 
	
	// предупреждение
	Если ТипСообщения = Предупреждение Тогда
		Результат = 1;
	КонецЕсли;

	// информация
	Если ТипСообщения = Информация Тогда
		Результат = 2;
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

Функция ЕстьКонтекст(Знач Контекст)
	// Проверка на пустое значение
	Если Контекст = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Может быть параметр представлен строкой => преобразуем к Структуре
	Если ТипЗнч(Контекст) = Тип("Строка") Тогда
		Попытка
			СтруктураКонтекст = ЗначениеИзСтрокиВнутр(Контекст);
		Исключение
			УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Контекст");
		КонецПопытки;
	Иначе
		СтруктураКонтекст = Контекст;
	КонецЕсли;
	
    // Может быть значение Неопределено => нет контекста
    Если СтруктураКонтекст = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;		
	
	// Если значение не является Структурой => ошибка
	Если ТипЗнч(СтруктураКонтекст) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Контекст");
	КонецЕсли;
	
    // Проверка наличия заполненных значений в структуре
    Если СтруктураКонтекст.Количество() = 0 Тогда
        Возврат Ложь;
    КонецЕсли;	
	
	Для Каждого Элемент Из СтруктураКонтекст Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции


#КонецОбласти
