////////////////////////////////////////////////////////////////////////////////
// Имущественный комплекс (Фабрика)
// 
// Реализует функции по созданию объектов (Имущественный комплекс)и управлению ими
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс  

// Создает новый объект ИмущественныйКомплекс без записи в базу данных.
//
// Параметры:
//   ОсновныеДанныеИмущественногоКомплекса - структура - содержит основные данные Имущественного комплекса, 
//   	см. УН_ИмущественныйКомплексСервисВызовСервера.НовыйСтруктураИмущественныйКомплекс()
//
// Возвращаемое значение:
//   СправочникОбъект.УН_ИмущественныеКомплексы - созданный объект ИмущественныйКомплекс
Функция Создать(Знач ОсновныеДанныеИмущественногоКомплекса) Экспорт; 
	Организация 		= Неопределено; 
	Номер 				= Неопределено;	// номер ИмущественногоКомплекса в рамках Организации
	Тип 				= Неопределено;	// тип ИмущественногоКомплекса (ключевой реквизит)
	ГруппаПолномочий 	= Неопределено;
	
// Предпосылки
	Если НЕ ПолучитьФункциональнуюОпцию("УН_ИспользоватьУправлениеНедвижимостью") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеУправлениеНедвижимостьюНеактивно();	
	КонецЕсли;
	
	Если ОсновныеДанныеИмущественногоКомплекса = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено(ОсновныеДанныеИмущественногоКомплекса);
	КонецЕсли;
	
	Если ТипЗнч(ОсновныеДанныеИмущественногоКомплекса) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
		
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("Организация", Организация) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Организация", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
	
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("ТипИмущественногоКомплекса", Тип) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ТипИмущественногоКомплекса", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
	
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("ГруппаПолномочий", ГруппаПолномочий) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ГруппаПолномочий", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
	
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("Номер", Номер) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Номер", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("Организация");
	КонецЕсли;
			
	Если НЕ ЗначениеЗаполнено(Тип) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("ТипИмущественногоКомплекса");
	КонецЕсли;
	

// Основная часть
	
	// Проверка полномочий на операцию без учета RLS (с учетом RLS выполним позже - после создания объекта) 
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.УН_ИмущественныеКомплексы");
	Право 			 = "Добавление";
	Если НЕ ПравоДоступа(Право,ОбъектМетаданных) Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеНетПраваДоступа(Право, ОбъектМетаданных.ПолноеИмя());
	КонецЕсли;
		
	// Создание нового объекта
	Объект = Справочники.УН_ИмущественныеКомплексы.СоздатьЭлемент();  
	
	СвойстваОбъекта = Объект.ДополнительныеСвойства;	
	СвойстваОбъекта.Вставить("Режим",Перечисления.УН_РежимОбъекта.Создание);
	СвойстваОбъекта.Вставить("ТипОбъекта", Справочники.УН_БизнесОбъекты.ИК);
	СвойстваОбъекта.Вставить("Родитель");
	СвойстваОбъекта.Вставить("Потомки",Новый Соответствие); 
	СвойстваОбъекта.Вставить("ПользовательскиеОбъекты",Новый Соответствие); 
	
	// Перед проверкой полномочий RLS необходимо заполнить реквизиты объекта
	Объект.Организация 					= Организация;
	Объект.Номер 						= Номер;
	Объект.ТипИмущественногоКомплекса 	= Тип;
	Объект.ГруппаПолномочий 			= ГруппаПолномочий;
	
	// Проверка полномочий (RLS)
	ВидыДоступа = Новый Массив();
	ВидыДоступа.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля", 
		"Организация", Строка(Объект.Организация)));
	
	ВидыДоступа.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля",
		"Тип имущественного комплекса", Строка(Объект.ТипИмущественногоКомплекса)));
	
	ВидыДоступа.Добавить(Новый Структура("ИмяПоля, ЗначениеПоля",
		"Группа полномочий", Строка(Объект.ГруппаПолномочий))); 
	
	Если НЕ УправлениеДоступом.ИзменениеРазрешено(Объект) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНетПраваДоступаДляВидовДоступа(Право, ОбъектМетаданных.ПолноеИмя(), ВидыДоступа);
	КонецЕсли;
	
	// Нужны настройки для типа бизнес-объекта
	НастройкиДляТипаБизнесОбъекта = Справочники.УН_БизнесОбъекты.ИК;
	Если НастройкиДляТипаБизнесОбъекта = Неопределено ИЛИ
		 НастройкиДляТипаБизнесОбъекта = Справочники.УН_БизнесОбъекты.ПустаяСсылка() Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(Справочники.УН_БизнесОбъекты.ИК.Код, "Справочник.УН_БизнесОбъекты");  
	КонецЕсли;

	// Нужны настройки для объекта
	НастройкиДляТипаИмущественногоКомплекса = Справочники.УН_ТипыИмущественныхКомплексов.НайтиПоКоду(Тип.Код);
	Если НастройкиДляТипаИмущественногоКомплекса = Неопределено ИЛИ
		 НастройкиДляТипаИмущественногоКомплекса = Справочники.УН_ТипыИмущественныхКомплексов.ПустаяСсылка() Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗаписьНеСуществует(Тип.Код, "Справочник.УН_ТипыИмущественныхКомплексов");  
	КонецЕсли;
	
	// Нужны настройки нумерации
	ОбъектНумерации = НастройкиДляТипаБизнесОбъекта.ОбъектНумерации;
	Если НЕ ЗначениеЗаполнено(ОбъектНумерации) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("ОбъектНумерации");
	КонецЕсли;
		
	ДиапазонНомеров = НастройкиДляТипаИмущественногоКомплекса.ДиапазонНомеров;
	Если НЕ ЗначениеЗаполнено(ДиапазонНомеров) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеПустоеЗначение("ДиапазонНомеров");
	КонецЕсли; 

	ПараметрыНумерации = УН_СервисНумерации.ПараметрыНумерации(ОбъектНумерации, ДиапазонНомеров);
	// Нумерация имущественных комплексов ведется в разрере Организаций (префиксов)
	Подобъект = Организация.Префикс;

	// Проверка номера (в случае с внешней нумерации)	
	Если НЕ ПараметрыНумерации.Автонумерация Тогда
		УН_СервисНумерации.ПроверитьНомер(ОбъектНумерации, Подобъект, ДиапазонНомеров,,Номер);
	КонецЕсли;
	
	
	// Инициализируем объект (общая для бизнес-объектов логика)
	Объект.ИнициализироватьБизнесОбъект();
	// * основные данные
	// * операция
	// 		Алгоритм:
	// 		Проверка на метку удаления => переключить Операцию
	// 		Копирование входящих значений
	// 		Установка дат
	//		Модель:Вызов метода инициализации модели
	// 		Проверка, что бизнес-объект активен
	//		Модель: Вызов метода установки значений по умолчанию (для новых объектов)
	//		МенеджерСтатусов: проверяем возможность изменения (для режима изменения) + метка удаления
	//		В случае с созданием - регистрируем всех потомков
	
	

	// Вызов пользовательской проверки полномочий

	// Возвращаем объект
	Возврат Объект; 
КонецФункции

// Возвращает объект Имущественный комплекс по заданным критериям
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Код - Строка - код элемента справочника "Имущественные комплексы"
//  Режим - Перечисление.УН_РежимОбъекта - режим открытия объекта: Изменение или Просмотр 
Функция НайтиПоКлючу(Код, Режим) Экспорт; 
	Результат = Неопределено;
	
	// запомним значение перечисления для режима "Просмотр"
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр;   
	
	Объект = Справочники.УН_ИмущественныеКомплексы.НайтиПоКоду(Код).ПолучитьОбъект();
	
	// Проверить, что Объект определен
	Если Объект = Неопределено Тогда
		Возврат Результат;		
	КонецЕсли;
		
	// Проверить полномочия на Объект / Организацию / Режим
	// УН_УправлениеДоступом.ПроверитьПолномочия();

		
	// Возможность изменения
	Если Режим <> РежимПросмотр Тогда

		// Проверить возможность открытия объекта в режиме изменения 
		
		// 	* пользовательский статус допускает редактирование?
		
		//	* системный статус допускает редатктирование?
		Если Объект.ПометкаУдаления Тогда
			// обработка ошибок  
			Сообщить("Объект помечен на удаление. Возможен только просмотр."); 
			
			// меняем режим
			Режим = РежимПросмотр;
		КонецЕсли;
	КонецЕсли;
		
	// Установка блокировки объекта
	Если Режим <> РежимПросмотр Тогда		
		Попытка 
			//Блокировка = Новый БлокировкаДанных;
			//ЭлементБлокировки = Блокировка.Добавить("Справочник.УН_ИмущественныеКомплексы");
			//ЭлементБлокировки.УстановитьЗначение("Ссылка",Объект.Ссылка);
			//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			//Блокировка.Заблокировать();
			
			
			//ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка);
			//Объект.Заблокировать();	
		Исключение
			// обработка ошибок
			Сообщить(ОписаниеОшибки()); 
		
			// меняем режим
			Режим = РежимПросмотр;  
		КонецПопытки;
	КонецЕсли;
		
	// расширяем структуру для объекта
	СвойстваОбъекта = Объект.ДополнительныеСвойства;	
	СвойстваОбъекта.Вставить("Режим",Режим);
	СвойстваОбъекта.Вставить("ТипОбъекта", Справочники.УН_БизнесОбъекты.ИК);
	СвойстваОбъекта.Вставить("Родитель");
	СвойстваОбъекта.Вставить("Потомки",Новый Соответствие); 
	СвойстваОбъекта.Вставить("Расширения",Новый Соответствие);  
		
	// объект готов
	Результат = Объект;

	// возвращаем объект
	Возврат Результат;			
КонецФункции




#КонецОбласти
