
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ДанныеСообщения;
		
	// Проверим существование параметра
    Если Параметры.Свойство("ДанныеСообщения", ДанныеСообщения) Тогда
		ДанныеСообщения = Параметры.ДанныеСообщения;
	Иначе
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ДанныеСообщения");
	КонецЕсли;
	
    Если ДанныеСообщения.ЕстьКонтекст Тогда	
		Попытка
			КонтекстСообщения = УН_СписокСообщенийКлиентСервер.НовыйСтруктураКонтекст();
			
			Если ТипЗнч(ДанныеСообщения.Контекст) = Тип("Структура") Тогда
				ЗаполнитьЗначенияСвойств(КонтекстСообщения, ДанныеСообщения.Контекст);
				
			ИначеЕсли ТипЗнч(ДанныеСообщения.Контекст) = Тип("Строка") Тогда
				КонтекстСообщения = ЗначениеИзСтрокиВнутр(ДанныеСообщения.Контекст);
			Иначе
				// ничего не делаем
			КонецЕсли;

			ОбъектКонтекст = РеквизитФормыВЗначение("Контекст");
			Для Каждого ЭлементКонтекста Из КонтекстСообщения Цикл
				СтрокаКонтекста = ОбъектКонтекст.Добавить();
				СтрокаКонтекста.Имя = ЭлементКонтекста.Ключ;
				СтрокаКонтекста.Значение = ЭлементКонтекста.Значение;
			КонецЦикла;
			ЗначениеВРеквизитФормы(ОбъектКонтекст, "Контекст");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

