////////////////////////////////////////////////////////////////////////////////
// Справочник Имущественный комплекс - модуль объекта
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс 

#Область УнаследованныеОтБазовогоКласса

Процедура ЗарегистрироватьПотомка(НазваниеПотомка, Потомок) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(ЭтотОбъект, НазваниеПотомка, Потомок);
КонецПроцедуры

Процедура ЗарегистрироватьВсехПотомков() Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьВсехПотомков(ЭтотОбъект);
КонецПроцедуры

Функция ЗарегистрироватьРасширение(ИмяРасширения) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьРасширение(ЭтотОбъект, ИмяРасширения);
КонецФункции 

Функция ИнициализироватьПоОбразцу(Образец) Экспорт;
	Возврат УН_БазовыйОбъект.ИнициализироватьПоОбразцу(ЭтотОбъект, Образец);
КонецФункции

Процедура ЗаполнитьИзВременногоХранилища(Знач Адрес) Экспорт;
	УН_БазовыйОбъект.ЗаполнитьИзВременногоХранилища(ЭтотОбъект, Адрес);
КонецПроцедуры


Процедура ПроверитьВсе(ЖурналСообщений) Экспорт;
	УН_БазовыйОбъект.ПроверитьВсе(ЭтотОбъект, ЖурналСообщений);
КонецПроцедуры

Процедура ЗаписатьВсе(ЖурналСообщений) Экспорт;      
	УН_БазовыйОбъект.ЗаписатьВсе(ЭтотОбъект, ЖурналСообщений);
КонецПроцедуры

// Устанавливает режим для объекта (Создание/Изменение/Просмотр)
Процедура УстановитьРежим(Знач Режим) Экспорт;
	УН_БазовыйОбъект.УстановитьРежим(ЭтотОбъект,Режим); 			
КонецПроцедуры

// Возвращает режим Объекта (Создание/Изменение/Просмотр)   
Функция Режим() Экспорт;  
	Возврат УН_БазовыйОбъект.Режим(ЭтотОбъект);
КонецФункции

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////


#Область УнаследованныеОтБизнесОбъекта
Функция Идентификатор() Экспорт;	
	Возврат УН_БизнесОбъект.Идентификатор(ЭтотОбъект);	
КонецФункции   


Функция ТипБизнесОбъекта() Экспорт;	
	Возврат УН_БизнесОбъект.ТипБизнесОбъекта(ЭтотОбъект);	
КонецФункции

Процедура ИнициализироватьБизнесОбъект() Экспорт;
	УН_БизнесОбъект.ИнициализироватьБизнесОбъект(ЭтотОбъект);		
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////


#Область УнаследованныеОтИмущественногоКомплекса
Функция ПолучитьИдентификатор() Экспорт;	
	Возврат УН_ИмущественныйКомплекс.ПолучитьИдентификатор(ЭтотОбъект);	
КонецФункции
	
// Начальная инициализация объекта
Процедура ИнициализироватьПоРодителю(Родитель) Экспорт; 
	УН_ИмущественныйКомплекс.ИнициализироватьПоРодителю(ЭтотОбъект, Родитель);	
КонецПроцедуры

// Возвращает объект - Менеджер измерений 
Функция МенеджерИзмерений() Экспорт;
	Возврат УН_ИмущественныйКомплекс.МенеджерИзмерений(ЭтотОбъект);
КонецФункции

// Возвращает объект - Менеджер статусов 
Функция МенеджерСтатусов() Экспорт;
	Возврат УН_ИмущественныйКомплекс.МенеджерСтатусов(ЭтотОбъект);	
КонецФункции

#КонецОбласти
 	
#КонецОбласти








#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти



#Область СлужебныеПроцедурыИФункции


// Выполняет запись основных данных объекта. Результат записывается в ЖурналСообщений
//
// Параметры: 
//  * ЖурналСообщений - объект - Журнал сообщений
Процедура ОбъектЗаписать(ЖурналСообщений);
КонецПроцедуры



#КонецОбласти
