////////////////////////////////////////////////////////////////////////////////
// Менеджер измерений
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

#Область УнаследованныеОтБазовогоКласса

Процедура ЗарегистрироватьПотомка(Объект, НазваниеПотомка, Потомок) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(Объект, НазваниеПотомка, Потомок);
КонецПроцедуры

Процедура ЗарегистрироватьВсехПотомков(Объект) Экспорт;
	УН_БазовыйОбъект.ЗарегистрироватьПотомка(Объект);
КонецПроцедуры

Функция ЗарегистрироватьРасширение(Объект, ИмяРасширения) Экспорт;
	Возврат УН_БазовыйОбъект.ЗарегистрироватьРасширение(Объект, ИмяРасширения);
КонецФункции

Функция ИнициализироватьПоОбразцу(Объект, Образец) Экспорт;
	Возврат УН_БазовыйОбъект.ИнициализироватьПоОбразцу(Объект, Образец);
КонецФункции

Процедура ЗаполнитьИзВременногоХранилища(Объект, Знач Адрес) Экспорт; 
	УН_БазовыйОбъект.ЗаполнитьИзВременногоХранилища(Объект, Адрес);	
КонецПроцедуры

Процедура ПроверитьВсе(Объект, ЖурналСообщений) Экспорт;
	УН_БазовыйОбъект.ПроверитьВсе(Объект, ЖурналСообщений);
КонецПроцедуры

Процедура ЗаписатьВсе(Объект, ЖурналСообщений) Экспорт;      
	УН_БазовыйОбъект.ЗаписатьВсе(Объект, ЖурналСообщений);
КонецПроцедуры

// Устанавливает режим для объекта (Создание/Изменение/Просмотр)
Процедура УстановитьРежим(Объект, Знач Режим) Экспорт;
	УН_БазовыйОбъект.УстановитьРежим(Объект,Режим); 			
КонецПроцедуры

// Возвращает режим Объекта (Создание/Изменение/Просмотр)   
Функция Режим(Объект) Экспорт;  
	Возврат УН_БазовыйОбъект.Режим(Объект);
КонецФункции

#КонецОбласти



#Область МенеджерИзмерений   

// Начальная инициализация объекта
Процедура ИнициализироватьПоРодителю(МенеджерИзмерений, Родитель) Экспорт; 
    РежимСоздание = Перечисления.УН_РежимОбъекта.Создание;
	
	// Прочитать записи из базы
	Если Родитель.Режим() <> РежимСоздание Тогда
		МенеджерИзмерений.Отбор.Идентификатор.Установить(Родитель.Идентификатор());
		МенеджерИзмерений.Прочитать();
		
		// запомним считанные из базы значения
		МенеджерИзмерений.ДополнительныеСвойства.ДанныеДоИзменения = МенеджерИзмерений.Выгрузить();  
	КонецЕсли;
	
КонецПроцедуры
	
// Создает запись об измерении, добавляет ее в набор записей.
// Функция возвращает добавленную запись, если операция выполнена успешно или Неопределено.
// 
// Параметры:
// 	* Объект - менеджер измерений
//  * Запись - структура - запись об измерении:
// 		- Идентификатор - строка(22)	- бизнес-ключ объекта, к которому относится измерение;
//		- ВидИзмерения - справочник 	- вид измерения    
// 		- ДействуетС - дата 			- дата начала действия измерения
// 		- ДействуетПо - дата			- дата окончания действия измерения
// 		- Значение - число(17,4) 		- значение измерения
// 		- ЕдиницаИзмерения - справочник - единица измерения
Функция ДобавитьЗапись(МенеджерИзмерений, Запись) Экспорт; 
	Результат = Неопределено;
	
	Если МенеджерИзмерений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	НоваяЗапись = МенеджерИзмерений.Добавить();
	НоваяЗапись.Идентификатор = Запись.Идентификатор;
	НоваяЗапись.ВидИзмерения = Запись.ВидИзмерения;
	НоваяЗапись.ДействуетС = Запись.ДействуетС;
	НоваяЗапись.ДействуетПо = Запись.ДействуетПо;
	НоваяЗапись.Значение = Запись.Значение;
	НоваяЗапись.ЕдиницаИзмерения = Запись.ЕдиницаИзмерения;
	
	Результат = НоваяЗапись;
	Возврат Результат;
КонецФункции

// Возвращает запись по ключу в формате структуры записи об измерении.
Функция ПолучитьЗапись(МенеджерИзмерений, ВидИзмерения, ДействуетС) Экспорт; 
	Результат = неопределено;
	Для каждого Запись из МенеджерИзмерений Цикл
		Если 	Запись.ВидИзмерения = ВидИзмерения
			И	Запись.ДействуетС = ДействуетС Тогда
			// нашли запись
			Результат = УН_МенеджерИзмеренийФабрика.СоздатьЗапись();
			
			Результат.Идентификатор		= Запись.Идентификатор;
			Результат.ВидИзмерения 		= Запись.ВидИзмерения; 
			Результат.ДействуетС 		= Запись.ДействуетС; 
			Результат.ДействуетПо 		= Запись.ДействуетПо; 
			Результат.Значение 			= Запись.Значение; 
			Результат.ЕдиницаИзмерения 	= Запись.ЕдиницаИзмерения;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Удаляет запись по ключу. Возвращает номер удаленной записи или -1, если запись для удаления не найдена.
Функция УдалитьЗапись(МенеджерИзмерений, ВидИзмерения, ДействуетС) Экспорт; 
	Результат = -1;
	Счетчик = -1;
	Для каждого Запись из МенеджерИзмерений Цикл
		Счетчик = Счетчик + 1;
		Если 	Запись.ВидИзмерения = ВидИзмерения
			И	Запись.ДействуетС 	= ДействуетС Тогда
			// нашли запись
			// удалить
			МенеджерИзмерений.Удалить(Счетчик);
			Результат = Счетчик;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Возвращает список всех записей в формате таблицы значений
Функция ВсеИзмерения(МенеджерИзмерений) Экспорт; 
	Возврат МенеджерИзмерений.Выгрузить();
КонецФункции

#КонецОбласти



#Область СлужебныеПроцедурыИФункции 

// Реализует конкретную функциональность проверки объекта
Процедура ОбъектПроверить(МенеджерИзмерений, ЖурналСообщений);
	// Здесь будут проверки основных данных   
	
	// Проверка 1
	
	
	// Проверка 2
	
	
	// и т.д.
	
	
КонецПроцедуры    


// Реализует конкретную функциональность записи объекта в базу (сохранения изменений)
Процедура ОбъектЗаписать(МенеджерИзмерений, ЖурналСообщений)
	// Заполним Идентификатор для всех записей
	Попытка
		ДополнительныеСвойства = МенеджерИзмерений.ДополнительныеСвойства;
		Родитель = ДополнительныеСвойства.Родитель;	
	Исключение
		// Обработка ошибок
		Сообщить("Невозможно получить Родителя для Менеджера измерений");  
		Возврат;
	КонецПопытки;
	
	Идентификатор = Родитель.ПолучитьИдентификатор();	
	
	Для каждого Запись из МенеджерИзмерений Цикл
		Запись.Идентификатор = Идентификатор;	
	КонецЦикла; 
	
	МенеджерИзмерений.Записать();	
КонецПроцедуры  

// Реализует конкретную функциональность регистрации всех потомков
Процедура ОбъектЗарегистрироватьВсехПотомков(МенеджерИзмерений)
	// У измерений нет потомков
КонецПроцедуры  

// Заполнить из временного хранилища
Процедура ОбъектЗаполнитьИзВременногоХранилища(МенеджерИзмерений, Знач Адрес) 
	Если Адрес = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// Читаем значения из временного хранилища
	Попытка
		Данные = ПолучитьИзВременногоХранилища(Адрес);
	Исключение
		Сообщить(ИнформацияОбОшибке());
	КонецПопытки;
	
	МенеджерИзмерений.Загрузить(Данные);	
КонецПроцедуры


#КонецОбласти

#КонецОбласти
