#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоЗначений = РеквизитФормыВЗначение("РуководствоПоВнедрению");
	ТекстЗапроса = ТекстЗапросаДляРуководстваПоВнедрению();

	ЗаполнитьДеревоЗначений(ДеревоЗначений, ТекстЗапроса);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "РуководствоПоВнедрению");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущиеДанные = Элементы.РуководствоПоВнедрению.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УправлениеСтатусомПолейФормы(ТекущиеДанные);
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовТаблицыФормыРуководствоПоВнедрению

&НаКлиенте
Процедура РуководствоПоВнедрениюВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ТекущиеДанные = РуководствоПоВнедрению.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	// Имя поля содержащего картинку, если есть Контекст
	ПолеДокументацияКартинкой = "РуководствоКартинкаДокументации";

	Если Поле.Имя = ПолеДокументацияКартинкой Тогда
		УН_НастройкиКлиент.ПоказатьДокументацию(ТекущиеДанные, ЭтотОбъект);
	Иначе
		УН_НастройкиКлиент.ОткрытьНастройку(ТекущиеДанные);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РуководствоПоВнедрениюПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.РуководствоПоВнедрению.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УправлениеСтатусомПолейФормы(ТекущиеДанные);
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиКомандФормы      
&НаКлиенте
Процедура ОткрытьНастройку(Команда)
	ТекущиеДанные = Элементы.РуководствоПоВнедрению.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УН_НастройкиКлиент.ОткрытьНастройку(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументацию(Команда)
	// Нужны выделенные записи
	ВыделенныеСтроки = Элементы.РуководствоПоВнедрению.ВыделенныеСтроки;
	 
	// Нужен текст заголовка для диалоговых окон
	ТекстЗаголовка = НСтр("ru = 'Просмотр Документации'");	 
	
	// Проверяем
	Если ВыделенныеСтроки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = '
			|Не выбрана ни одна запись!
			|Выделите только одну запись.'");		
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Выделите только одну запись для просмотра документации!'");
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	// Открываем форму документации
	ТекущиеДанные = РуководствоПоВнедрению.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	УН_НастройкиКлиент.ПоказатьДокументацию(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	ТекущиеДанные = Элементы.РуководствоПоВнедрению.ТекущиеДанные;
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();	
	Элементы.РуководствоПоВнедрению.Развернуть(ИдентификаторСтроки, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	ТекущиеДанные = Элементы.РуководствоПоВнедрению.ТекущиеДанные;
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();	
	Элементы.РуководствоПоВнедрению.Свернуть(ИдентификаторСтроки);
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции 
// Заполняет дерево значений данными из запроса.
//
// Параметры:
//   ДеревоЗначений - ДеревоЗначений - Дерево значений, которое необходимо заполнить данными
//   ТекстЗапроса - Строка - Текст запроса для получения данных
&НаСервере
Процедура ЗаполнитьДеревоЗначений(ДеревоЗначений, Знач ТекстЗапроса)

// Предпосылки	
	Если ДеревоЗначений = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("ДеревоЗначений");
	КонецЕсли; 
	
	Если ТипЗнч(ДеревоЗначений) <> Тип(ДеревоЗначений) Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ДеревоЗначений");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
// Основная часть
	ДеревоЗначений.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
    РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
		
	// Создаем временное хранилище для связи ключей и строк дерева
	Соответствие = Новый Соответствие;
	
	// Создаем дерево
	Пока Выборка.Следующий() Цикл
		РодительскаяСтрока = Соответствие[Выборка.ВышестоящийУзел];

		Если РодительскаяСтрока = Неопределено Тогда                 
			СтрокаДерева = ДеревоЗначений.Строки.Вставить(Выборка.Порядок);
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);				
		Иначе
		    СтрокаДерева = РодительскаяСтрока.Строки.Вставить(Выборка.Порядок);
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);				
		КонецЕсли;                                                    
		
		Соответствие.Вставить(Выборка.КлючЗаписи, СтрокаДерева);
	КонецЦикла;   
КонецПроцедуры


// Возвращает текст запроса для выборки всех списка всех настроек Руководства по внедрению.
//
// Возвращаемое значение:
//   Строка - текст запроса для руководства по внедрению
&НаСервере
Функция ТекстЗапросаДляРуководстваПоВнедрению()
	Возврат 
		"ВЫБРАТЬ
		|	УН_РеестрНастроек.КлючЗаписи КАК КлючЗаписи,
		|	УН_РеестрНастроек.Родитель КАК ВышестоящийУзел,
		|	УН_РеестрНастроек.Порядок КАК Порядок,
		|	УН_РеестрНастроек.Наименование КАК Наименование,
		|	УН_РеестрНастроек.Описание КАК Описание,
		|	УН_РеестрНастроек.ПутьКФорме КАК ПутьКФорме,
		|	УН_РеестрНастроек.ЭтоГруппа КАК ЭтоГруппа,
		|	ВЫБОР
		|		КОГДА ЭтоГруппа = ИСТИНА
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КартинкаУзла,
		|	ВЫБОР
		|		КОГДА ЕстьДокументация = ИСТИНА
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КартинкаДокументации
		|	
		|ИЗ
		|	РегистрСведений.УН_РеестрНастроек КАК УН_РеестрНастроек"	
КонецФункции

// Управляет обязательностью, видимостью и доступностью реквизитов формы.
//
&НаКлиенте
Процедура УправлениеСтатусомПолейФормы(Знач ТекущиеДанные)
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Элементы.РуководствоПоВнедрениюОткрытьНастройку.Доступность = Ложь;
	Иначе
		Элементы.РуководствоПоВнедрениюОткрытьНастройку.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

	