////////////////////////////////////////////////////////////////////////////////
// Менеджер измерений (Фабрика)
// 
// Реализует функции по созданию менеджера измерений
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс  

// Создает набор записей по Родителю и возвращает объект
Функция Создать(Родитель) Экспорт;
	РежимИзменение = Перечисления.УН_РежимОбъекта.Изменение; 	
	
    // Проверка, что Родитель не пустой
	Если Родитель = Неопределено Тогда 
		Возврат Неопределено; 
	КонецЕсли;
	
	// Проверка полномочий
	// УН_УправлениеДоступом.ПроверитьПолномочия();
		
	// Создание объекта
	Попытка
		Объект = РегистрыСведений.УН_Измерения.СоздатьНаборЗаписей();
	Исключение
		// обработка ошибок
		Сообщить("Не удалось создать объект ""Менеджер измерений""");
		Возврат Неопределено;
	КонецПопытки;
	
	Если Объект = Неопределено Тогда 
		Возврат Неопределено; 
	КонецЕсли; 
	
	// Расширение структуры объекта
	СвойстваОбъекта = Объект.ДополнительныеСвойства;	
	СвойстваОбъекта.Вставить("Режим");
	СвойстваОбъекта.Вставить("Родитель", Родитель);
	СвойстваОбъекта.Вставить("Потомки",Новый Соответствие); 
	СвойстваОбъекта.Вставить("Расширения",Новый Соответствие); 
	СвойстваОбъекта.Вставить("ДанныеДоИзменения");
		
	// Установка Режима как у Родителя
	Объект.УстановитьРежим(Родитель.Режим());
	
	// Установка блокировок на записи 
	
	// Инициализация данных менеджера
	УН_МенеджерИзмерений.ИнициализироватьПоРодителю(Объект,Родитель);
	
	// возвращаем объект
	Возврат Объект; 
КонецФункции


// Создает и возвращает пустую структуру для записи измерения
Функция СоздатьЗапись() Экспорт;
	Результат = Новый Структура();
	Результат.Вставить("Идентификатор");
	Результат.Вставить("ВидИзмерения");
	Результат.Вставить("ДействуетС");
	Результат.Вставить("ДействуетПо");
	Результат.Вставить("Значение");   
	Результат.Вставить("ЕдиницаИзмерения");  
	
	Возврат Результат;
КонецФункции


#КонецОбласти
