////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции (сервер)
//  
////////////////////////////////////////////////////////////////////////////////



// Возвращает ссылку на элемент перечисления по его значению.
//
// Параметры:
//   ИмяПеречисления - Строка - имя перечисления
//   Ключ - Строка - ключ значения перечисления
//
// Возвращаемое значение:
//   ПеречислениеСсылка - ссылка на элемент перечисления
Функция ПолучитьСсылкуПоЗначениюПеречисления( Знач ИмяПеречисления, Знач Ключ) Экспорт
	Попытка
        Возврат Перечисления[ИмяПеречисления][Ключ];
    Исключение
        Сообщить("Ошибка получения ссылки на значение перечисления " + ИмяПеречисления + "." + Ключ);
        Возврат неопределено;
    КонецПопытки;
КонецФункции


