////////////////////////////////////////////////////////////////////////////////
// HTML Сервис
// 
// Реализует методы для работы с HTML
//////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс   

// Извлекает содержимое тега BODY из текста HTML.
//
// Параметры:
//  HTMLТекст - Строка - Исходный текст HTML.
//
// Возвращаемое значение:
//  Строка - Содержимое тега BODY без самого тега.
Функция ПолучитьТелоHTML(Знач HTMLТекст) Экспорт   
	Возврат ПолучитьТекстИзТегаHTML(HTMLТекст,"body");    
КонецФункции


// Извлекает содержимое тега STYLE из текста HTML.
//
// Параметры:
//  HTMLТекст - Строка - Исходный текст HTML.
//
// Возвращаемое значение:
//  Строка - Содержимое тега STYLE без самого тега.
Функция ПолучитьСтилиHTML(Знач HTMLТекст) Экспорт   
	Возврат ПолучитьТекстИзТегаHTML(HTMLТекст,"style");    
КонецФункции
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// Извлекает содержимое указанного тега из HTML-текста.
//
// Параметры:
//   HTMLТекст - Строка - исходный HTML-текст
//   Тег - Строка - имя тега, содержимое которого нужно извлечь
//
// Возвращаемое значение:
//   Строка - содержимое указанного тега
Функция ПолучитьТекстИзТегаHTML(Знач HTMLТекст, Знач Тег)   
    Перем НачалоКонтента;
    Перем ПозицияКонтента;    
	
	Если ЗначениеЗаполнено(Тег) = Ложь Тогда
		Возврат HTMLТекст;	
	КонецЕсли;  
	
	ИмяТега = ВРег(Тег); 
	
	
	// Приводим к верхнему регистру для поиска
    ТекстВерхнийРегистр = ВРег(HTMLТекст);
    
    // Ищем начало тега body
    ПозицияТега = СтрНайти(ТекстВерхнийРегистр, "<"+ИмяТега);
    Если ПозицияТега = 0 Тогда
        Возврат HTMLТекст;
    КонецЕсли;
    
    // Пропускаем атрибуты тега 
    ПозицияКонтента = ПозицияТега + СтрДлина(ИмяТега) + 1; // Длина имени Тега
    Пока ПозицияКонтента <= СтрДлина(HTMLТекст) Цикл
        Символ = Сред(HTMLТекст, ПозицияКонтента, 1);
        Если Символ = ">" Тогда
            НачалоКонтента = ПозицияКонтента + 1;
            Прервать;
        КонецЕсли;
        ПозицияКонтента = ПозицияКонтента + 1;
    КонецЦикла;
    
    Если НачалоКонтента = Неопределено Тогда
        Возврат HTMLТекст;
    КонецЕсли;
    
    // Ищем закрывающий тег
    ПозицияЗакрывающегоТега = СтрНайти(ТекстВерхнийРегистр, "</"+ИмяТега+">");

    Если ПозицияЗакрывающегоТега = 0 Тогда
        Возврат Сред(HTMLТекст, НачалоКонтента);
    КонецЕсли;
    
    Возврат Сред(HTMLТекст, НачалоКонтента, ПозицияЗакрывающегоТега - НачалоКонтента);
КонецФункции
#КонецОбласти



