
Процедура ОбновитьОсновныеДанные(Реквизит, Объект) Экспорт;
КонецПроцедуры


Процедура ОбновитьРеквизитИзмерения(Реквизит, Потомки, Объект) Экспорт;
КонецПроцедуры


Процедура ОбновитьРеквизитАдрес(Реквизит, Потомки, Объект) Экспорт;
КонецПроцедуры


Процедура ОбновитьРеквизитСтатус(Реквизит, Потомки, Объект) Экспорт;
КонецПроцедуры 


// Обновляет на форме данные реквизитов, которые отображают данные расширений
// 
// Параметры:
//  * Расширения	- массив - состоит из строк: ИмяРасширения - ИмяРеквизита, коорыемнужно обновить 
//  * Объект		- объект - модели		
Процедура ОбновитьРасширения(Расширения, Объект) Экспорт;
	// реализация выполняется в одноименной процедуре переопределяемого модуля.
КонецПроцедуры


Процедура ПолучитьВсеРеквизиты(Реквизиты, Потомки, Объект);	
	//ОбновитьОсновныеДанные(Реквизит, Объект);	
	//ОбновитьРеквизитИзмерения(Реквизит, Потомки, Объект);
	//ОбновитьРеквизитАдрес(Реквизит, Потомки, Объект);
	//ОбновитьРеквизитСтатус(Реквизит, Потомки, Объект);
	//ОбновитьРасширения(Реквизит, Объект);
КонецПроцедуры


//=========================================================
Процедура ОбновитьМодельИзмерения() Экспорт;	
КонецПроцедуры


Процедура ОбновитьМодельАдрес() Экспорт;	
КонецПроцедуры


Процедура ОбновитьМодельСтатус() Экспорт;	
КонецПроцедуры 


Процедура ОбновитьМодельРасширения() Экспорт;
КонецПроцедуры


Процедура ОбновитьМодель() Экспорт;	
	ОбновитьМодельИзмерения();
	ОбновитьМодельАдрес();
	ОбновитьМодельСтатус();
КонецПроцедуры
