////////////////////////////////////////////////////////////////////////////////
// Модуль формы обработки Управления реестром настроек
// 
// Описание:
//
//  
////////////////////////////////////////////////////////////////////////////////  



////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы
////////////////////////////////////////////////////////////////////////////////  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоЗначений = РеквизитФормыВЗначение("Настройки");
	ЗаполнитьУзел(Неопределено, ДеревоЗначений);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Настройки");

КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки
//////////////////////////////////////////////////////////////////////////////// 

&НаКлиенте
Процедура НастройкиПередРазворачиванием(Элемент, Строка, Отказ)
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	ОбновитьУзел(ТекущиеДанные);
КонецПроцедуры


&НаКлиенте
Процедура НастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	ТекущиеДанные = Настройки.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	// имя поля содержащего картинку, если есть Контекст
	ПолеДокументацияКартинкой = "НастройкиКартинкаДокументации";

	Если Поле.Имя = ПолеДокументацияКартинкой Тогда
		УН_НастройкиКлиент.ПоказатьДокументацию(ТекущиеДанные, ЭтаФорма);
	Иначе
		ОткрытьФормуРедактированияНастройки(ТекущиеДанные);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти



////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиКомандФормы      
//////////////////////////////////////////////////////////////////////////////// 

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	Элементы.Настройки.Развернуть(Идентификатор, Истина);
КонецПроцедуры

&НаКлиенте
// Добавляет настройку на текущем уровне иерархии
Процедура Добавить(Команда)
	// ТекущаяСтрока
	ТекущаяСтрока = Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		// первая запись
		Родитель 		= Неопределено;
		ЭтоГруппа 		= Истина;
		ЭлементРодитель = Неопределено;
		КоличествоСтрок = 0;
	Иначе
		Родитель 		= ТекущаяСтрока.ВышестоящийУзел;
		ЭтоГруппа 		= ТекущаяСтрока.ЭтоГруппа;
		
		ЭлементРодитель = ТекущаяСтрока.ПолучитьРодителя();
		Если ЭлементРодитель <> Неопределено Тогда
			КоличествоСтрок = ЭлементРодитель.ПолучитьЭлементы().Количество();
		Иначе
			КоличествоСтрок = Настройки.ПолучитьЭлементы().Количество();
		КонецЕсли;
	КонецЕсли;
		
	НоваяНастройка = УН_НастройкиКлиентСервер.НоваяНастройка();
	НоваяНастройка.КлючЗаписи				= Новый УникальныйИдентификатор();
	НоваяНастройка.ВышестоящийУзел 			= Родитель;
	НоваяНастройка.Порядок 					= КоличествоСтрок + 1;
	НоваяНастройка.ЭтоГруппа 				= ЭтоГруппа;
	
	// сегмент данных пользователя
	НоваяНастройка.Автор 					= ПользователиКлиент.ТекущийПользователь();
	НоваяНастройка.ДатаВремяСозданияUTC 	= неопределено;
	НоваяНастройка.ДатаВремяСозданияМестное = неопределено;
	НоваяНастройка.ПоследнимИзменил			= ПользователиКлиент.ТекущийПользователь();
	НоваяНастройка.ДатаВремяИзмененияUTC 	= неопределено;
	НоваяНастройка.ДатаВремяИзмененияМестное = неопределено;
		
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтотОбъект, ЭлементРодитель);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Создание"));
	ПараметрыФормы.Вставить("ДанныеНастройки", НоваяНастройка);
	ОткрытьФорму("Обработка.УН_НастройкаРуководстваПоВнедрению.Форма.ФормаДанныеНастройки", 
		ПараметрыФормы, 
		ЭтотОбъект,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюНастройку(Команда)
	// ТекущаяСтрока
	ТекущаяСтрока = Элементы.Настройки.ТекущиеДанные;
	
	// Может быть родительская запись отсутсвует => выходим
	// Нет родительской записи - не может быть и подчиненной
	Если ТекущаяСтрока = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана настройка для добавления подчиненной настройки.'"));
		Возврат;
	КонецЕсли;
	
	// Может быть текущая строка является конечной настройкой => выходим
	// Конечная настройка не может иметь подчиненных настроек
	Если ТекущаяСтрока.ЭтоГруппа = Ложь Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выбранная настройка не является группой.'"));
		Возврат;
	КонецЕсли;
	
	Родитель 		= ТекущаяСтрока.КлючЗаписи;
	ЭтоГруппа 		= ТекущаяСтрока.ЭтоГруппа;
	КоличествоСтрок = ТекущаяСтрока.ПолучитьЭлементы().Количество();
		
	НоваяНастройка = УН_НастройкиКлиентСервер.НоваяНастройка();
	НоваяНастройка.КлючЗаписи	= Новый УникальныйИдентификатор();
	НоваяНастройка.ВышестоящийУзел 	= Родитель;
	НоваяНастройка.Порядок 		= КоличествоСтрок + 1;
	НоваяНастройка.ЭтоГруппа 	= ЭтоГруппа;	
	
	// сегмент данных пользователя
	НоваяНастройка.Автор 					= ПользователиКлиент.ТекущийПользователь();
	НоваяНастройка.ДатаВремяСозданияUTC 	= неопределено;
	НоваяНастройка.ДатаВремяСозданияМестное = неопределено;
	НоваяНастройка.ПоследнимИзменил			= ПользователиКлиент.ТекущийПользователь();
	НоваяНастройка.ДатаВремяИзмененияUTC 	= неопределено;
	НоваяНастройка.ДатаВремяИзмененияМестное = неопределено;	

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормы",ЭтотОбъект, ТекущаяСтрока);	
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Создание"));
	ПараметрыФормы.Вставить("ДанныеНастройки", НоваяНастройка);
	ОткрытьФорму("Обработка.УН_НастройкаРуководстваПоВнедрению.Форма.ФормаДанныеНастройки", 
		ПараметрыФормы, 
		ЭтотОбъект,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КомандаРедактироватьУзел(Команда)
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	ОткрытьФормуРедактированияНастройки(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
	Элементы.Настройки.Свернуть(Идентификатор);
КонецПроцедуры


&НаКлиенте
Процедура КомандаУдалитьУзел(Команда)
	// Нужны выделенные записи
	ВыделенныеСтроки = Элементы.Настройки.ВыделенныеСтроки;

	// Нужен текст заголовка для диалоговых окон
	ТекстЗаголовка = НСтр("ru = 'Удаление настройки'");
				 
	// Проверяем, чтобы была выделена только одна запись
	Если ВыделенныеСтроки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = '
			|Не выбрана запись для удаления!
			|Выделите только одну запись.'");
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Выделите только одну запись для удаления!'");
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	// Запрос подтверждения на удаление и удаление
	УдаляемаяСтрока = Элементы.Настройки.ДанныеСтроки(ВыделенныеСтроки[0]);
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеПодтвержденияУдаленияУзла", ЭтотОбъект, УдаляемаяСтрока);
	
	ТекстСообщения = НСтр("ru = '
		|Удалить выделенную запись? 
		|При этом также будут удалены и все подчиненные записи без возможности восстановления.'");
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , , ТекстЗаголовка, );
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументацию(Команда)
	// Нужны выделенные записи
	ВыделенныеСтроки = Элементы.Настройки.ВыделенныеСтроки;
	 
	// Нужен текст заголовка для диалоговых окон
	ТекстЗаголовка = НСтр("ru = 'Просмотр Документации'");	 
	
	// Проверяем
	Если ВыделенныеСтроки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = '
			|Не выбрана ни одна запись!
			|Выделите только одну запись.'");		
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Выделите только одну запись для просмотра документации!'");
		ПоказатьПредупреждение( , ТекстСообщения, , ТекстЗаголовка);
		Возврат;
	КонецЕсли;
	
	// Открываем форму документации
	ТекущиеДанные = Настройки.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	УН_НастройкиКлиент.ПоказатьДокументацию(ТекущиеДанные, ЭтотОбъект);	
КонецПроцедуры
#КонецОбласти



////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции 
////////////////////////////////////////////////////////////////////////////////

                                            
// Заполняет текущий узел дерева значениями из настройки.
//
// Параметры:
//   КлючЗаписи - УникальныйИдентификатор, Неопределено - уникальный ключ записи (настройки) или Неопределено для корневого узла
//   ДеревоЗначений - ДеревоЗначений - Дерево, которое необходимо заполнить
//   СписокРазвернутыхУзлов - Массив - список развернутых узлов
&НаСервере
Процедура ЗаполнитьУзел(КлючЗаписи, ДеревоЗначений, СписокРазвернутыхУзлов = неопределено)

    Если КлючЗаписи = Неопределено Тогда
        ТекущаяСтрока = Неопределено;
        Родитель = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
        СтрокиДерева = ДеревоЗначений.Строки;
    Иначе
       	ТекущаяСтрока = ДеревоЗначений.Строки.Найти(КлючЗаписи, "КлючЗаписи", Истина);
        Если ТекущаяСтрока = Неопределено Тогда
            // что-то пошло не так
            Возврат;
        КонецЕсли;
       	Родитель 	 = ТекущаяСтрока.КлючЗаписи;       	
       	СтрокиДерева = ТекущаяСтрока.Строки; 
	КонецЕсли; 
	
	// запомним развернутые узлы
	// понадобятся для восстановления Идентификатора строки дерева после обработки дерева
	Если СписокРазвернутыхУзлов <> Неопределено Тогда 
		Пока ТекущаяСтрока <> Неопределено Цикл
			СписокРазвернутыхУзлов.Добавить(ТекущаяСтрока.КлючЗаписи);
			ТекущаяСтрока = ТекущаяСтрока.Родитель; 
		КонецЦикла;
	КонецЕсли;

    // Выполнение запроса.
    Запрос = Новый Запрос;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	УН_РеестрНастроек.КлючЗаписи КАК КлючЗаписи,
	|	УН_РеестрНастроек.Родитель КАК ВышестоящийУзел,
	|	УН_РеестрНастроек.Порядок КАК Порядок,
	|	УН_РеестрНастроек.Наименование КАК Наименование,
	|	УН_РеестрНастроек.Описание КАК Описание,
	|	УН_РеестрНастроек.ЭтоГруппа КАК ЭтоГруппа,
	|	УН_РеестрНастроек.ПутьКФорме КАК ПутьКФорме,
	|	УН_РеестрНастроек.ЕстьДокументация КАК ЕстьДокументация,
	|	УН_РеестрНастроек.Автор КАК Автор,
	|	УН_РеестрНастроек.ДатаВремяСозданияUTC КАК ДатаВремяСозданияUTC,
	|	УН_РеестрНастроек.ПоследнимИзменил КАК ПоследнимИзменил,
	|	УН_РеестрНастроек.ДатаВремяИзмененияUTC КАК ДатаВремяИзмененияUTC,
	|	ВЫБОР
	|		КОГДА ЭтоГруппа = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КартинкаУзла,
	|	ВЫБОР
	|		КОГДА ЕстьДокументация = ИСТИНА
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КартинкаДокументации
	|ИЗ
	|	РегистрСведений.УН_РеестрНастроек КАК УН_РеестрНастроек
	|ГДЕ
	|	Родитель = &Родитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
   
    Запрос.УстановитьПараметр("Родитель", Родитель);

    // Заполнение дерева значений.
    Попытка
    	Результат = Запрос.Выполнить();
    Исключение
    	Возврат;
    КонецПопытки;

    Выборка = Результат.Выбрать();

    Если Выборка.Количество() <> 0 Тогда
        СтрокиДерева.Очистить();

        Пока Выборка.Следующий() Цикл
            СтрокаДерева = СтрокиДерева.Добавить();
            ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка); 

            // Если полученная строка является группой, то создаем 
            // фиктивную подчиненную строку.
            Если Выборка.ЭтоГруппа Тогда
                ПодстрокаДерева = СтрокаДерева.Строки.Добавить();
            КонецЕсли;
        КонецЦикла;
    Иначе
    	// удаляем фиктивные строки
        СтрокиДерева.Очистить();    	
    КонецЕсли;
КонецПроцедуры

// Удаляет узел дерева с указанным ключом из настройки, включая вложенные узлы.
//
// Параметры:
//   КлючЗаписи - УникальныйИдентификатор, Неопределено - уникальный ключ записи (настройки) или Неопределено для корневого узла
//   ДеревоЗначений - ДеревоЗначений - Дерево, которое необходимо заполнить
//   СписокРазвернутыхУзлов - Массив - список развернутых узлов
&НаСервере
Процедура УдалитьУзел(КлючЗаписи, ДеревоЗначений, СписокРазвернутыхУзлов = неопределено);
	// Дерево значений не существует => выходим
	Если ДеревоЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Ключ не существует => выходим
    Если КлючЗаписи = Неопределено Тогда
        Возврат;
    КонецЕсли;

    // Нужна строка дерева, соответствующая удаляемому ключу
    Если ЗначениеЗаполнено(КлючЗаписи) Тогда
       	ТекущаяСтрока = ДеревоЗначений.Строки.Найти(КлючЗаписи, "КлючЗаписи", Истина);
    Иначе
        Возврат;	    	
    КонецЕсли;
    
   	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	// Запомним открытые узлы
	// Понадобятся для восстановления Идентификатора строки дерева после обработки дерева
	ВременнаяСтрока = ТекущаяСтрока;
	Если СписокРазвернутыхУзлов <> Неопределено Тогда 
		Пока ВременнаяСтрока <> Неопределено Цикл
			СписокРазвернутыхУзлов.Добавить(ВременнаяСтрока.КлючЗаписи);
			ВременнаяСтрока = ВременнаяСтрока.Родитель; 
		КонецЦикла;
	КонецЕсли; 	

	// Нужные ключи всех удаляемых записей
	КлючиУдаляемыхЗаписей = Новый Массив;
	КлючиУдаляемыхЗаписей.Добавить(КлючЗаписи);
	Для Каждого Строка Из ТекущаяСтрока.Строки Цикл
		КлючиУдаляемыхЗаписей.Добавить(Строка.КлючЗаписи);
	КонецЦикла;
    
	// Удаляем из дерева
	ВышестоящийУзел = ТекущаяСтрока.Родитель;
	Если ВышестоящийУзел = Неопределено Тогда
		ДеревоЗначений.Строки.Удалить(ТекущаяСтрока);
	Иначе
		ВышестоящийУзел.Строки.Удалить(ТекущаяСтрока);
	КонецЕсли;
	    
	// Удаляем из базы    
	УдалениеУзловВБазе(КлючиУдаляемыхЗаписей);	   
КонецПроцедуры // УдалитьУзел()

&НаСервере
Процедура ЗаполнитьУзелНаСервере(Знач КлючЗаписиТекущейСтрокиДерева, СписокРазвернутыхУзлов = неопределено)
	ДеревоЗначений = РеквизитФормыВЗначение("Настройки");
	ЗаполнитьУзел(КлючЗаписиТекущейСтрокиДерева, ДеревоЗначений, СписокРазвернутыхУзлов);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Настройки");
КонецПроцедуры 

&НаСервере
Процедура УдалитьУзелНаСервере(Знач КлючЗаписиТекущейСтрокиДерева, СписокРазвернутыхУзлов = неопределено)
	ДеревоЗначений = РеквизитФормыВЗначение("Настройки");
	УдалитьУзел(КлючЗаписиТекущейСтрокиДерева, ДеревоЗначений, СписокРазвернутыхУзлов);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Настройки");
КонецПроцедуры 



// Обновляет узел дерева настроек и восстанавливает текущий узел после обновления.
//
// Параметры:
//   ТекущийУзел - Произвольный - Узел дерева, который необходимо обновить и сделать текущим
&НаКлиенте
Процедура ОбновитьУзел(Знач ТекущийУзел)
	ТекущиеДанные = ТекущийУзел;
	СписокРазвернутыхУзлов = новый Массив();
	
 	Если ТекущиеДанные = Неопределено Тогда
 		Возврат;
 	КонецЕсли;
 	
	ЗаполнитьУзелНаСервере(ТекущиеДанные.КлючЗаписи, СписокРазвернутыхУзлов);
	
	// После вызова методов РеквизитФормыВЗначение() и ЗначениеВРеквизитФормы() идентификаторы строк дерева сбиваются.
	// Нужно восстановить актуальный идентификатор для строки, которая была текущей. Используем СписокРазвернутыхУзлов,
	// который хранит значения ключей развернутых узлов дерева в виде массива. Корень дерева соответсвует последнему элементу массива! 
	КоличествоУзлов = СписокРазвернутыхУзлов.Количество();
	Узлы = Настройки.ПолучитьЭлементы();	// получаем список корневых узлов дерева
	Если КоличествоУзлов <> 0 Тогда
		Для Счетчик = 0 По КоличествоУзлов-1  Цикл
			Для каждого Узел из Узлы Цикл
				Если Узел.КлючЗаписи = СписокРазвернутыхУзлов[КоличествоУзлов - 1 - Счетчик] Тогда
					ТекущиеДанные = Узел; 
					Узлы = Узел.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущиеДанные <> неопределено Тогда
		Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		Элементы.Настройки.Развернуть(Идентификатор);
	КонецЕсли;
КонецПроцедуры

// Обработчик события после закрытия формы. Обновляет данные в дереве.
//
// Параметры:
//   Результат - Произвольный - Результат закрытия формы
//   ДополнительныеПараметры - ДанныеФормыЭлементДерева, Неопределено - Дополнительная информация о закрытии формы
&НаКлиенте
Процедура ПослеЗакрытияФормы(Результат, ДополнительныеПараметры) Экспорт;
	Если ДополнительныеПараметры = Неопределено Тогда
		// добавление в корень дерева
		ЗаполнитьУзелНаСервере(Неопределено);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("ДанныеФормыЭлементДерева") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип(ДополнительныеПараметры);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДополнительныеПараметры.КлючЗаписи) Тогда
		ОбновитьУзел(ДополнительныеПараметры);
	Иначе	
		ЗаполнитьУзелНаСервере(Неопределено);
	КонецЕсли;
КонецПроцедуры

// Обрабатывает подтверждение удаления узла в дереве настроек.
//
// Параметры:
//   Результат - Булево - результат подтверждения удаления узла
//   ДополнительныеПараметры - Структура - дополнительные параметры, содержащие ключ записи удаляемого узла
&НаКлиенте
Процедура ПослеПодтвержденияУдаленияУзла(Результат, ДополнительныеПараметры) Экспорт;
	// Удаляем узел из дерева
	Если Результат = КодВозвратаДиалога.Да 
		И ДополнительныеПараметры <> Неопределено Тогда
	    	СписокРазвернутыхУзлов = новый Массив();	
			УдалитьУзелНаСервере(ДополнительныеПараметры.КлючЗаписи, СписокРазвернутыхУзлов);
	КонецЕсли;	
	
	// Обновление дерева
	// После вызова методов РеквизитФормыВЗначение() и ЗначениеВРеквизитФормы() идентификаторы строк дерева сбиваются.
	// Нужно восстановить актуальный идентификатор для строки, которая была текущей. Используем СписокРазвернутыхУзлов,
	// который хранит значения ключей развернутых узлов дерева в виде массива. Корень дерева соответсвует последнему элементу массива! 
	КоличествоУзлов = СписокРазвернутыхУзлов.Количество();
	Узлы = Настройки.ПолучитьЭлементы();	// получаем список корневых узлов дерева
	Если КоличествоУзлов <> 0 Тогда
		Для Счетчик = 0 По КоличествоУзлов-1  Цикл
			Для каждого Узел из Узлы Цикл
				Если Узел.КлючЗаписи = СписокРазвернутыхУзлов[КоличествоУзлов - 1 - Счетчик] Тогда
					ТекущиеДанные = Узел; 
					Узлы = Узел.ПолучитьЭлементы();
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если ТекущиеДанные <> неопределено Тогда
		Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		Элементы.Настройки.Развернуть(Идентификатор);
	КонецЕсли;
КонецПроцедуры  

// Удаляет записи из регистра сведений "УН_РеестрНастроек" по заданным ключам.
//
// Параметры:
//   КлючиУдаляемыхЗаписей - Массив - ключи записей, подлежащих удалению
&НаСервере
Процедура УдалениеУзловВБазе(Знач КлючиУдаляемыхЗаписей)
	Если КлючиУдаляемыхЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(КлючиУдаляемыхЗаписей) <> Тип("Массив") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("КлючиУдаляемыхЗаписей");
	КонецЕсли;
	
	// Может быть массив пустой => выходим
	Если КлючиУдаляемыхЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УН_РеестрНастроек");
	Для Каждого КлючЗаписи Из КлючиУдаляемыхЗаписей Цикл

		ЭлементБлокировки.УстановитьЗначение("КлючЗаписи", КлючЗаписи);
	КонецЦикла;

	НачатьТранзакцию();
	Попытка
	    Блокировка.Заблокировать();
	    УдаляемыеЗаписи = РегистрыСведений.УН_РеестрНастроек.СоздатьНаборЗаписей();
	    Для Каждого КлючЗаписи Из КлючиУдаляемыхЗаписей Цикл
	        УдаляемаяЗапись = УдаляемыеЗаписи.Добавить();
	        УдаляемаяЗапись.КлючЗаписи = КлючЗаписи;
	    КонецЦикла;
	    УдаляемыеЗаписи.Записать(РежимЗамещения.Удаление);
	    ЗафиксироватьТранзакцию();
	Исключение
	    ОтменитьТранзакцию();
	    ВызватьИсключение(ИнформацияОбОшибке());
	КонецПопытки;
КонецПроцедуры

// Открывает форму редактирования настройки.
//
// Параметры:
//   ТекущаяСтрока - Произвольный - строка данных настройки, подлежащей редактированию
&НаКлиенте
Процедура ОткрытьФормуРедактированияНастройки(ТекущаяСтрока)	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	НоваяНастройка = УН_НастройкиКлиентСервер.НоваяНастройка();
	ЗаполнитьЗначенияСвойств(НоваяНастройка, ТекущаяСтрока);		
	// местное время
	НоваяНастройка.ДатаВремяСозданияМестное = МестноеВремя(НоваяНастройка.ДатаВремяСозданияUTC);
	НоваяНастройка.ДатаВремяИзмененияМестное = МестноеВремя(НоваяНастройка.ДатаВремяИзмененияUTC);
		
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормы", ЭтотОбъект, ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Изменение"));
	ПараметрыФормы.Вставить("ДанныеНастройки", НоваяНастройка);
	ОткрытьФорму("Обработка.УН_НастройкаРуководстваПоВнедрению.Форма.ФормаДанныеНастройки", 
		ПараметрыФормы, 
		ЭтотОбъект,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

