///////////////////////////////////////////////////////////////////////////////////////////////////////
// УН_ИмущественныйКомлпексСервисКлиент
// 
// Вспомогательные клиентские процедуры и функции для интерактивной работы с объектом
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс    

#Область ИнтерактивнаяОбработка

// Создает новый объект Имущественный комплекс без сохранения и открывает форму объекта
//	Параметры:
//	 ОсновныеДанныеИмущественногоКомплекса - Структура - содержит основные данные объекта, 
//			см. УН_ИмущественныйКомплексСервисВызовСервера.НовыйСтруктураИмущественныйКомплекс().
// 
Процедура СоздатьИмущественныйКомплекс(ОсновныеДанныеИмущественногоКомплекса) Экспорт
// Предпосылки	
	Если ОсновныеДанныеИмущественногоКомплекса = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено(ОсновныеДанныеИмущественногоКомплекса);
	КонецЕсли;
	
	Если ТипЗнч(ОсновныеДанныеИмущественногоКомплекса) <> Тип("Структура") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
		
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("Организация") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Организация", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
	
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("ТипИмущественногоКомплекса") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ТипИмущественногоКомплекса", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;
	
	Если НЕ ОсновныеДанныеИмущественногоКомплекса.Свойство("ГруппаПолномочий") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ГруппаПолномочий", 
			"ОсновныеДанныеИмущественногоКомплекса");
	КонецЕсли;

// Основная часть	
	Если ЗначениеЗаполнено(ОсновныеДанныеИмущественногоКомплекса.Организация)
		И ЗначениеЗаполнено(ОсновныеДанныеИмущественногоКомплекса.ТипИмущественногоКомплекса)
		И ЗначениеЗаполнено(ОсновныеДанныеИмущественногоКомплекса.ГруппаПолномочий) Тогда

		СоздатьИмущественныйКомплексСлужебный(ОсновныеДанныеИмущественногоКомплекса);
	Иначе
		// Вызов диалога для заполнения обязательных полей (нужны для выбора формы и проверки полномочий перед созданием)
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСозданиеИмущественногоКомплекса", ЭтотОбъект);
	
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ОсновныеДанные", ОсновныеДанныеИмущественногоКомплекса);
		
		ОткрытьФорму("ОбщаяФорма.УН_СоздатьИмущественныйКомплекс",
			ПараметрыФОрмы,
			ЭтотОбъект,,,,
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	КонецЕсли;
КонецПроцедуры



Процедура ИзменитьИмущественныйКомплекс(ОсновныеДанныеИмущественногоКомплекса) Экспорт
	
КонецПроцедуры



Процедура КопироватьИмущественныйКомплекс() Экспорт
	
КонецПроцедуры


Процедура ПросмотретьИмущественныйКомплекс() Экспорт
	
КонецПроцедуры

#КонецОбласти



#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Обработчик события закрытия формы УН_СоздатьИмущественныйКомплекс.
//
// Параметры:
//   Результат - Произвольный - Результат создания объекта
//   ДополнительныеПараметры - Неопределено - Не используется
//
// История изменений:
// 31.10.2025 - Создано. Лупина В.М.
//
Процедура ОбработатьСозданиеИмущественногоКомплекса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		// Пользователь отказался от создания объекта
		Возврат;
	КонецЕсли;
	
	СоздатьИмущественныйКомплексСлужебный(Результат);
КонецПроцедуры 

// Создает новый Имущественный комплекс без сохранения и открывает его форму.
//
// Параметры:
//  ОсновныеДанныеИмущественногоКомплекса - Структура - см. УН_ИмущественныйКомплексСервисВызовСервера.НовыйСтруктураИмущественныйКомплекс()
//
// Описание:
//  Процедура создает новый имущественный комплекс. В случае успешного создания объекта, данные копируются из временного объекта
//  в форму и она открывается для просмотра.
//  При возникновении ошибок при создании объекта, его форма не отображается.
//
// История изменений:
// 31.10.2025 - Создано. Лупина В.М.
//
Процедура СоздатьИмущественныйКомплексСлужебный(ОсновныеДанныеИмущественногоКомплекса)
	// выбор имени формы	
	// ....				
	Форма = ПолучитьФорму("Справочник.УН_ИмущественныеКомплексы.Форма.ФормаЭлемента");
	ДанныеФормы = Форма.Объект;
	
	// Создаем новый ИмущественныйКомплекс
	Если УН_ИмущественныйКомплексСервисВызовСервера.НовыйИмущественныйКомплексНаСервере(
		ДанныеФормы,
		ОсновныеДанныеИмущественногоКомплекса) Тогда  
		
    	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект); 
    	Форма.Открыть();
	КонецЕсли;	
КонецПроцедуры
	
#КонецОбласти


