////////////////////////////////////////////////////////////////////////////////
// HTML Сервис (вызов сервера)
// 
// Реализует методы для работы с HTML, которые должны выполняться на сервере
//////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс   
// Функция преорбразует форматированный документ в HTML. 
// Если форматированный документ содержит рисунки, они преобразуются в формат base64.
// 
// Параметры:
//  ФорматированныйДокумент - ФорматированныйДокумент - содержимое документа для вывода в HTML
// 
// Возвращаемое значение:
//  Строка - текст HTML
Функция СформироватьHTMLИзФорматированногоДокумента(Знач ФорматированныйДокумент) Экспорт	
	Перем ТекстHTML;
	
	Рисунки = Новый Структура();
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Рисунки);
	
	Счетчик = 1;
	Для каждого Рисунок из Рисунки Цикл
		// имя рисунка
		ШаблонИмениРисунка = "Рисунок %1.";
		ИмяРисунка = СтрШаблон(ШаблонИмениРисунка, Счетчик);
		
		// рисунок в Base64
		РисунокBase64 = ИзображениеВHTML(Рисунок.Значение, ИмяРисунка);
		
		// заменяем в HTML  
		ТекстHTML = СтрЗаменить(ТекстHTML,"src=""" + Рисунок.Ключ + """", РисунокBase64); 
	КонецЦикла;
    
    Возврат ТекстHTML;
КонецФункции
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


// Конвертирует изображение в формат base64 для отображения в HTML.
//
// Параметры:
//   Изображение - Картинка - Изображение для конвертации
//   НазваниеРисунка - Строка - Название рисунка (alt текст)
//   РастягиватьПоШирине - Булево - Флаг, указывающий, следует ли растягивать изображение по ширине
//
// Возвращаемое значение:
//   Строка - HTML-тег изображения в формате base64
Функция ИзображениеВHTML(Знач Изображение, Знач НазваниеРисунка = неопределено, РастягиватьПоШирине = Истина)
	Если Изображение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Если ТипЗнч(Изображение) <> Тип("Картинка") Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеНедопустимыйТип("Изображение");
	КонецЕсли;		
		
	// Данные картинки в base64 для вставки в HTML
	ДанныеКартинки = Изображение.ПолучитьДвоичныеДанные();
	Base64Данные = Base64Строка(ДанныеКартинки);
                
	// MIME тип
	MimeТип = "image/png"; // по умолчанию
	ФорматИзображения = Изображение.Формат();
	Если ФорматИзображения = ФорматКартинки.JPEG Тогда
		MimeТип = "image/jpeg";
	ИначеЕсли ФорматИзображения = ФорматКартинки.GIF Тогда
		MimeТип = "image/gif";
	ИначеЕсли ФорматИзображения = ФорматКартинки.BMP Тогда
		MimeТип = "image/bmp";
	ИначеЕсли ФорматИзображения = ФорматКартинки.SVG Тогда
		MimeТип = "image/svg+xml";
	ИначеЕсли ФорматИзображения = ФорматКартинки.TIFF Тогда
		MimeТип = "image/tiff";
	ИначеЕсли ФорматИзображения = ФорматКартинки.WMF Тогда
		MimeТип = "image/wmf";
	КонецЕсли;
                
	// Формат вывода
	ФорматВывода = "";
	Если РастягиватьПоШирине Тогда
		ФорматВывода = "style=""max-width: 100%; height: auto;""";
	КонецЕсли; 
                       
	// Название рисунка
	Если ЗначениеЗаполнено(НазваниеРисунка) Тогда
		НазваниеРисунка = СтрШаблон("alt = ""%1""", НазваниеРисунка);
	КонецЕсли;

	HTMLШаблон = "src='data:%1;base64,%2' %3 %4";
	Возврат СтрШаблон(HTMLШаблон, MimeТип, Base64Данные, ФорматВывода, НазваниеРисунка);
КонецФункции
#КонецОбласти