// Форма

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РежимОбъекта = ПредопределенноеЗначение("Перечисление.УН_РежимОбъекта.Просмотр") Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;  
	ДатаАктуальности = ТекущаяДата()+1;
	
	// заголовок
	ТекстОбъекта 		= ОбновитьЗаголовокНаСервере("Имущественный комплекс", Объект.Идентификатор, Объект.Наименование);
	Если ДатаАктуальности >= ТекущаяДата() Тогда
		ТекстАкутальности = "актуальная версия"; 		
	Иначе
		// не актуально
		ТекстАкутальности = СтрШаблон("актуально на %1",Строка(ДатаАктуальности));
		Элементы.ГруппаСтатусыИМетки.ТолькоПросмотр = Истина;
		Элементы.ГруппаЗакладки.ТолькоПросмотр = Истина;
		Элементы.Декорация1.Видимость = Истина; 
		Элементы.Декорация2.Видимость = Ложь;

		Элементы.ГруппаЗаголовок.ЦветФона = Новый Цвет(194,200,209);	// стиль: цвет метки Серый	
	КонецЕсли;
		
	ЗаголовокОбъекта 	= СтрШаблон("%1 (%2)",ТекстОбъекта,ТекстАкутальности);
	
	// остальные поля
	Адрес = "г. Москва, ул.Новая, д.1, к.1, Россия, 190001";
	АдресГород = "Москва";
	АдресУлица = "Новая ул.";
	АдресДом = "1";
	АдресКорп = "1";
	АдресИндекс = "190001";
	АдресСтрана = "RU";
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	ЖурналСообщений = Новый Массив;
	ПроверитьНаСервере(ЖурналСообщений);
	
	// вывод результатов проверки
	Для каждого Сообщение из ЖурналСообщений Цикл 
		Сообщить(Сообщение);
	КонецЦикла;		
КонецПроцедуры

//===================================================================

// Измерения

&НаКлиенте
Процедура ГруппаЗакладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// определить какой менеджер нужно вызвать
	Если ТекущаяСтраница.Имя = "ГруппаИзмерения" Тогда 		
    	ГруппаЗакладкиИзмеренияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИзмеренияПриИзменении(Элемент)  
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИзмерениеДействуетСПриИзменении(Элемент)   	
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ИзмерениеДействуетПоПриИзменении(Элемент) 
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеИзмеренияПриИзменении(Элемент)
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент) 
	ИзмерениеПриИзмененииНаСервере();
КонецПроцедуры 



//===================================================================
// Обработчики формы на сервере  
//===================================================================
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("РежимОбъекта") Тогда
		РежимОбъекта = Параметры.РежимОбъекта;
	КонецЕсли;
	
    Если Параметры.Свойство("ТипБизнесОбъекта") Тогда
		ТипБизнесОбъекта = Параметры.ТипБизнесОбъекта;
	КонецЕсли;

	Если Параметры.Свойство("ИДРодительскийОбъект") Тогда
		ИДРодительскийОбъект = Параметры.ИДРодительскийОбъект;
	КонецЕсли; 
	
	// Режим <> Просмотр => Создание всех потомков и расширений
	// ...
	// МенеджерИзмерений = УН_МенеджерИзмеренийФабрика.Создать()
	// Измерения 		 = УН_МенеджерИзмерений.ВсеИзмерения(МенеджерИзмерений)
	// ...     
	
	// Статусы:
	Статус.Добавить("Черновик","Черновик",,);
	Метки.Добавить("УЧТН","Учтено",,);
	Метки.Добавить("ПРЗВ","Производство",,);
	Метки.Добавить("ТРВН","Требует внимания",,);
	
	
	
КонецПроцедуры


&НаСервере
Процедура ГруппаЗакладкиИзмеренияНаСервере()
    // Преобразуем реквизит Объект в прикладной объект  
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
		
	АдресИзмеренийВоВременномХранилище = Потомки.НайтиПоЗначению("Измерения");
	
	Если АдресИзмеренийВоВременномХранилище = неопределено Тогда
		// создаем объект - менеджер измерений и используем его для получения данных
		ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(
			ОбъектФормы.Код, 
			РежимОбъекта);
 
		МенеджерИзмерений = ИК.МенеджерИзмерений();
		ИзмеренияФормы = МенеджерИзмерений.ВсеИзмерения().Скопировать(); 
		
		АдресИзмеренийВоВременномХранилище = ПоместитьВоВременноеХранилище(ИзмеренияФормы,ЭтаФорма.УникальныйИдентификатор);
		Потомки.Добавить("Измерения",АдресИзмеренийВоВременномХранилище);
		
		ЗначениеВРеквизитФормы(ИзмеренияФормы, "Измерения");
	Иначе
		//// есть данные во временном хранилище  
		//Попытка
		//	ИзмеренияФормы = ПолучитьИзВременногоХранилища(АдресИзмеренийВоВременномХранилище);  
		//Исключение
		//	Сообщить(ИнформацияОбОшибке());
		//КонецПопытки;		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ИзмерениеПриИзмененииНаСервере()
	//// Получить адрес во временном хранилище
	//АдресИзмеренийВоВременномХранилище = Потомки.НайтиПоЗначению("Измерения");
	//
	//Если АдресИзмеренийВоВременномХранилище = Неопределено Тогда
	//	// Ошибка
	//	Сообщить("Данные измерений не инициализированы.");
	//	Возврат;
	//КонецЕсли; 
	//	
	//// Получить данные с формы 
	//ИзмеренияФормы = РеквизитФормыВЗначение("Измерения"); 
	//
	//// Обновить данные во временном хранилище
	//ПоместитьВоВременноеХранилище(ИзмеренияФормы,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры


&НаСервере
Процедура ПроверитьНаСервере(ЖурналСообщений)
	// Инициализация констант
	РежимСоздание = Перечисления.УН_РежимОбъекта.Создание;  
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр;

	// Преобразовать реквизит Объект в прикладной объект  
	ОбъектФормы = РеквизитФормыВЗначение("Объект");  
	
	// Получить Объект 
	Если РежимОбъекта = РежимСоздание Тогда
		// новый объект
	    ИК = УН_ИмущественныйКомплексФабрика.Создать(
			ОбъектФормы.Организация,
			ОбъектФормы.ТипИмущественногоКомплекса);	
	Иначе		
		// существующий объект
		ИК = УН_ИмущественныйКомплексФабрика.НайтиПоКлючу(
			ОбъектФормы.Код, 
			РежимОбъекта);			
	КонецЕсли;
	
	Если РежимОбъекта <> РежимПросмотр Тогда			
		// зарегистрировать всех потомков
		ИК.ЗарегистрироватьВсехПотомков();
		
		// обновить данные в объекте и подчиненных объектах 
		Адрес = неопределено;
		ИК.ЗаполнитьИзВременногоХранилища(Объект, Адрес);  
	КонецЕсли;  
	
	ИК.ПроверитьВсе(ЖурналСообщений);	
КонецПроцедуры

&НаКлиенте
Процедура Сообщения(Команда)
		ОткрытьФорму("ОбщаяФорма.УН_Сообщения", ,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьЗаголовокНаСервере(БизнесОбъект, ИД, Наименование)
	ТекстЗаголовка = СтрШаблон("%1: %2 %3", БизнесОбъект, ИД, Наименование); 
	Возврат ТекстЗаголовка; 
КонецФункции

&НаКлиенте
Процедура ИдентификаторПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ЗаголовокОбъекта = ОбновитьЗаголовокНаСервере("Имущественный комплекс", Объект.Идентификатор, Объект.Наименование);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзмененияАдреса(Команда)
	ОткрытьФорму("ОбщаяФорма.УН_ИсторияИзмененияАдреса",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНаКарте(Команда)
	ЗапуститьПриложение("https://yandex.ru/maps/213/moscow/house/novaya_ulitsa_1/Z04YcwdpSUABQFtvfXR2cn5hZw==/?ll=37.509056%2C55.873223&z=17");
КонецПроцедуры


&НаКлиенте
Процедура ДанныеПользователя(Команда)
	ОткрытьФорму("ОбщаяФорма.УН_ДанныеПользователя",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СтатуснаяСхема(Команда)
	ОткрытьФорму("ОбщаяФорма.УН_СтатуснаяСхема",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СтатусИстория(Команда)
	ОткрытьФорму("ОбщаяФорма.УН_ИсторияИзмененияСтатусов",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры



&НаКлиенте
Процедура СоздатьПоОбразцу(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИсходнаяОрганизация",Объект.Организация);
	ПараметрыФормы.Вставить("ИсходныйКод",Объект.Код);
	ПараметрыФормы.Вставить("ИсходныйИдентификатор",Объект.Идентификатор);
	ПараметрыФормы.Вставить("ИсходноеНаименование",Объект.Наименование);
	
    ОткрытьФорму("ОбщаяФорма.УН_СозданиеПоОбразцу",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДатаАктуальностиПриИзменении(Элемент)
	// заголовок
	ТекстОбъекта = ОбновитьЗаголовокНаСервере("Имущественный комплекс", Объект.Идентификатор, Объект.Наименование);
	
	Если ДатаАктуальности >= ТекущаяДата() Тогда
		// актуально
		ТекстАкутальности = "актуальные данные"; 
		Элементы.ГруппаСтатусыИМетки.ТолькоПросмотр = Ложь;
		Элементы.ГруппаЗакладки.ТолькоПросмотр = Ложь; 
		Элементы.Декорация1.Видимость = Ложь;  
		Элементы.Декорация2.Видимость = Истина;
		Элементы.ГруппаЗаголовок.ЦветФона = Новый Цвет(184,222,178); // стиль: цвет метки Зеленый
		
		
	Иначе
		// не актуально
		ТекстАкутальности = СтрШаблон("актуально на %1",Строка(ДатаАктуальности));
		Элементы.ГруппаСтатусыИМетки.ТолькоПросмотр = Истина;
		Элементы.ГруппаЗакладки.ТолькоПросмотр = Истина;
		Элементы.Декорация1.Видимость = Истина; 
		Элементы.Декорация2.Видимость = Ложь;

		Элементы.ГруппаЗаголовок.ЦветФона = Новый Цвет(194,200,209);	// стиль: цвет метки Серый	
		
	КонецЕсли;
		
	ЗаголовокОбъекта 	= СтрШаблон("%1 (%2)",ТекстОбъекта,ТекстАкутальности);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры







