
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НоваяСтрока = ИсторияИзмененияАдреса.Добавить();
	НоваяСтрока.Адрес 		= "г. Москва, ул.Новая, д.1, к.1, Россия, 190001";
	НоваяСтрока.ДействуетС 	= '2025.01.25';   
	НоваяСтрока.Широта 		= 37.509056; 
	НоваяСтрока.Долгота 	= 55.873223;
	НоваяСтрока.ЕстьГраницы = Истина;	
	
	НоваяСтрока = ИсторияИзмененияАдреса.Добавить();
	НоваяСтрока.Адрес 		= "г. Воронеж, ул.Пилотов, д.25, к.3, Россия";
	НоваяСтрока.ДействуетС 	= '2025.03.17';
	НоваяСтрока.Актуальный 	= Истина;
КонецПроцедуры
