#Область ОписаниеПеременных

#КонецОбласти

//=============================================================================================
#Область ОбработчикиСобытийФормы                                                               
//=============================================================================================
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПоследнимИзменил = ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.ДатаВремяИзменения = ТекущаяУниверсальнаяДата();
	
	Если ПустаяСтрока(ДополнительныйТекстКСообщению.ПолучитьТекст()) Тогда 
		ТекущийОбъект.ЕстьДопТекст = Ложь;
		ТекущийОбъект.ДополнительныйТекст = неопределено;
	Иначе
		ТекущийОбъект.ЕстьДопТекст = Истина;
		ТекущийОбъект.ДополнительныйТекст = Новый ХранилищеЗначения(ДополнительныйТекстКСообщению);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПиктограммуТипаСообщения();	
	ОбновитьПиктограммуЕстьДопТекст();
	ОбновитьСчетчикСимволов();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДополнительныйТекстКСообщению = ТекущийОбъект.ДополнительныйТекст.Получить(); 
КонецПроцедуры

#КонецОбласти   


//=============================================================================================
#Область ОбработчикиСобытийЭлементовШапкиФормы                                                 
//=============================================================================================
&НаКлиенте
Процедура ДополнительныйТекстКСообщениюПриИзменении(Элемент)
	ОбновитьПиктограммуЕстьДопТекст();    	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьСчетчикСимволов();
КонецПроцедуры   

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	ОбновитьПиктограммуТипаСообщения();		
КонецПроцедуры  

&НаКлиенте
Процедура ГруппаВкладкиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ВкладкаДополнительныйТекст = "ВкладкаДополнительныйТекст";
	
	Если ТекущаяСтраница.Имя = ВкладкаДополнительныйТекст Тогда
		УстановитьШаблонОФормления();
		ЗаполнитьТаблицуСтилей();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  


//=============================================================================================
#Область ОбработчикиКомандФормы 
//=============================================================================================
&НаКлиенте
Процедура Стиль(Команда)
	ЗаполнитьМенюСтилей();
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзМеню",ЭтотОбъект,Новый Структура);
	ПоказатьВыборИзМеню(Оповещение,СписокСтилей,Элементы.Стиль);  
КонецПроцедуры 

&НаКлиенте
Процедура ВставитьШаблонДополнительногоТекстаСообщения(Команда)	
	Если ДополнительныйТекстКСообщению.Элементы <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработкаВставкиШаблонаДополнительногоТекста",ЭтотОбъект);
		ТекстВопроса = НСтр(
				"ru = 'Перед вставкой шаблона дополнительного текста текущее содержимое дополнительного текста будет удалено. Продолжить?'");
		ТекстЗаголовкаДиалога = НСтр(
				"ru = 'Вставка шаблона дополнительного текста'");
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ПоказатьВопрос(Оповещение,ТекстВопроса,Кнопки,,,ТекстЗаголовкаДиалога,); 		
	КонецЕсли;  
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПолеДополнительногоТекста(Команда)
	Если ДополнительныйТекстКСообщению.Элементы <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ОбработкаОчисткиДополнительногоТекста",ЭтотОбъект);
		ТекстВопроса = НСтр(
				"ru = 'Содержимое дополнительного текста будет удалено. Продолжить?'");
		ТекстЗаголовкаДиалога = НСтр(
				"ru = 'Очистка дополнительного текста'");
		Кнопки = РежимДиалогаВопрос.ДаНет;
		
		ПоказатьВопрос(Оповещение,ТекстВопроса,Кнопки,,,ТекстЗаголовкаДиалога,); 		
	КонецЕсли; 	
КонецПроцедуры

#КонецОбласти


//=============================================================================================
#Область СлужебныеПроцедурыИФункции
//=============================================================================================
&НаКлиенте
Процедура ОбновитьПиктограммуТипаСообщения()
	Ошибка 			= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Ошибка");
	Предупреждение	= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Предупреждение");
	Информация		= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Информация"); 
	
	ТипСообщения 	= Объект.ТипСообщения; 

	Если ТипСообщения = Неопределено Тогда
		Элементы.ТипСообщенияПиктограмма.Видимость = Ложь;
	Иначе  
		Элементы.ТипСообщенияПиктограмма.Видимость = Истина;
	КонецЕСли;
		
		
	Если ТипСообщения = Ошибка Тогда
		Элементы.ТипСообщенияПиктограмма.Картинка = БиблиотекаКартинок.ОформлениеКругКрасный;
	КонецЕсли;
	
	Если ТипСообщения = Предупреждение Тогда
		Элементы.ТипСообщенияПиктограмма.Картинка = БиблиотекаКартинок.ОформлениеКругЖелтый;
	КонецЕсли;
	
	Если ТипСообщения = Информация Тогда
		Элементы.ТипСообщенияПиктограмма.Картинка = БиблиотекаКартинок.ОформлениеКругЗеленый;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбновитьПиктограммуЕстьДопТекст();
	Если ПустаяСтрока(ДополнительныйТекстКСообщению.ПолучитьТекст()) Тогда 
		Элементы.ВкладкаДополнительныйТекст.Картинка = БиблиотекаКартинок.УН_НетДанных; 
	Иначе
		Элементы.ВкладкаДополнительныйТекст.Картинка = БиблиотекаКартинок.УН_ЕстьДанные;
	КонецЕсли;  
КонецПроцедуры

Процедура ОбновитьСчетчикСимволов();
	ИспользованоСимволов = СтрДлина(Объект.Наименование);
	ВсегоСимволов = 150;
	СчетчикСимволов = СтрШаблон("%1/%2",ИспользованоСимволов,ВсегоСимволов);
КонецПроцедуры

Процедура ПрименитьСтиль(Знач Стиль) 
	
	// получить границы фрагмента текста
	НачальнаяПозиция = 0;
	КонечнаяПозиция = 0;
	Элементы.ДополнительныйТекстКСообщению.ПолучитьГраницыВыделения(НачальнаяПозиция,КонечнаяПозиция);

	ЗаполнитьТаблицуСтилей();
	
    ЭлементыСтиля = ПолучитьСтиль(Стиль);	
	
	// применить стиль к фрагменту
	Для каждого Фрагмент из ДополнительныйТекстКСообщению.СформироватьЭлементы(НачальнаяПозиция,КонечнаяПозиция) Цикл
		Если ЭлементыСтиля.Параграф.ГоризонтальноеПоложение <> неопределено Тогда
			Фрагмент.Родитель.ГоризонтальноеПоложение = ЭлементыСтиля.Параграф.ГоризонтальноеПоложение;
		КонецЕсли;

		Если ЭлементыСтиля.Параграф.МеждустрочныйИнтервал <> неопределено Тогда		
			Фрагмент.Родитель.МеждустрочныйИнтервал = ЭлементыСтиля.Параграф.МеждустрочныйИнтервал;
		КонецЕсли;
		    
		Если ЭлементыСтиля.Параграф.Отступ <> неопределено Тогда		
			Фрагмент.Родитель.Отступ = ЭлементыСтиля.Параграф.Отступ;
		КонецЕсли;
		
		Если ЭлементыСтиля.ЦветТекстаУстановлен Тогда
			Фрагмент.ЦветТекста = ЭлементыСтиля.ЦветТекста;
		КонецЕсли;

		Если ЭлементыСтиля.ЦветФонаУстановлен Тогда		
			Фрагмент.ЦветФона = ЭлементыСтиля.ЦветФона;  
		КонецЕсли;
		
		Фрагмент.Шрифт = ЭлементыСтиля.Шрифт;	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте  
// Создает кнопки в подменю Стиль 
//
Процедура ЗаполнитьМенюСтилей()	
	СписокСтилей.Очистить();
	
	// если шаблон не установлен => выходим
	Если ПризнакШаблонОформленияУстановлен = Ложь Тогда
		Возврат;
	КонецЕсли;	
	
	// если стилей нет => выходим
	Если ПризнакТаблицаСтилейЗаполнена = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// получаем выделеные фрагменты текста
	ВыделенныйФрагмент = ВыделенныйФрагмент();
	
	// добавляем кнопки в меню
	Если ВыделенныйФрагмент.Количество()=0 Тогда
		ИмяКнопки 	= 0;
		ТекстКнопки = НСтр("ru = 'Нет выделенных фрагментов';
							|en = 'No selections available'");
		СписокСтилей.Добавить(ИмяКнопки,ТекстКнопки);
		Возврат;
	КонецЕсли;    
	
	Если ТаблицаСтилей.Количество() = 0 
			И ПризнакТаблицаСтилейЗаполнена Тогда
		ИмяКнопки 	= 0;
		ТекстКнопки = НСтр("ru = 'Шаблон оформления не содержит стилей';
							|en = 'The template has an empty style collection'");
		СписокСтилей.Добавить(ИмяКнопки,ТекстКнопки);
		Возврат;
	КонецЕсли;
	
	Для каждого Строка из ТаблицаСтилей Цикл
		ИмяКнопки 	= Строка.Селектор;
		ТекстКнопки	= Строка.Селектор; 
		// может быть кнопка с таким именем уже была добавлена
		Если СписокСтилей.НайтиПоЗначению(ИмяКнопки) <> неопределено Тогда
			Продолжить;
		КонецЕсли;
		СписокСтилей.Добавить(ИмяКнопки,ТекстКнопки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьШаблонДополнительногоТекста()
	МакетHTML_ШаблонДополнительногоТекста = "УН_ШаблонПодробногоТекстаСообщения_HTML";
	
	Попытка
		ШаблонДополнительногоТекстаHTML = ПолучитьОбщийМакет(МакетHTML_ШаблонДополнительногоТекста).ПолучитьТекст();
		ДополнительныйТекстКСообщению.УстановитьHTML(ШаблонДополнительногоТекстаHTML, Новый Структура);
	Исключение	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ОчиститьДополнительныйТекстКСообщению()
	ДополнительныйТекстКСообщению.Удалить();	
КонецПроцедуры

&НаСервере
// Получает имя Общего макета HTML, который используется для представления расширенного текста сообщения и записывает в реквизит формы
Процедура УстановитьШаблонОФормления()     
	ПризнакШаблонОформленияУстановлен = Ложь;	
	ИмяШаблонаОформления = Константы.УН_ШаблонОформленияТекстаСообщения.Получить(); 
	ШаблонОформления = НСтр("ru = '(нет)';
							|en = 'none'");	
	
	// может быть шаблон по умолчанию не задан => выходим
	Если ЗначениеЗаполнено(ИмяШаблонаОформления) = Ложь Тогда
		Возврат;
	КонецЕсли;

	// может быть шаблон не существует
	Попытка
		ШаблонОформления = Метаданные.ОбщиеМакеты[ИмяШаблонаОформления].Синоним;
		ПризнакШаблонОформленияУстановлен = Истина;
	Исключение	
		ИмяКонстанты = Метаданные.Константы["УН_ШаблонОформленияТекстаСообщения"].Синоним;
		ШаблонТекста = НСтр("ru = 'Шаблон оформления с именем ""%1"" не существует.
				|Будет использоваться шаблон по умолчанию.
				|Для установки имени Шаблона оформления используется Константа ""%2"".
				|В качестве имени Шаблона оформления должно быть указано имя объекта Общий макет (HTML).'"); 
		Сообщение = Новый СообщениеПользователю();	
		Сообщение.Текст = СтрШаблон(ШаблонТекста,ИмяШаблонаОформления,ИмяКонстанты);	 
		Сообщение.Сообщить();
		Возврат;	
	КонецПопытки;
КонецПроцедуры

// Читает макет и кэширует во внутренней таблице только один раз
//
Процедура ЗаполнитьТаблицуСтилей()
	Если ПризнакТаблицаСтилейЗаполнена Тогда
		Возврат;
	КонецЕсли;
	
	// может быть Имя шаблона оформления не опрделено => выходим
	Если ЗначениеЗаполнено(ИмяШаблонаОформления) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	// пытемся открыть шаблон оформления 
	Попытка	
		ТекстHTML = ПолучитьОбщийМакет(ИмяШаблонаОформления).ПолучитьТекст();
	Исключение 
		Возврат;	
	КонецПопытки;

	СтилиHTML = УН_HTMLСервис.ПолучитьСтилиHTML(ТекстHTML); 
	
	ТЗ_Стили = РеквизитФормыВЗначение("ТаблицаСтилей");
	ТЗ_Стили.Очистить();
	
	НачальнаяПозиция = 1;
	КонецТекста		 = СтрДлина(СтилиHTML);
	
	Пока НачальнаяПозиция < КонецТекста Цикл 
		// селектор
		РегулярноеВыражение = "[._a-zA-Z0-9]+";
		РезультатПоиска = СтрНайтиПоРегулярномуВыражению(СтилиHTML, 
			РегулярноеВыражение,
			НаправлениеПоиска.СНачала,
			НачальнаяПозиция,,Истина);
		
		Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда
			Селектор = Сред(СтилиHTML,
				РезультатПоиска.НачальнаяПозиция, РезультатПоиска.Длина);
			НачальнаяПозиция = РезультатПоиска.НачальнаяПозиция + РезультатПоиска.Длина;	
		КонецЕсли; 
		
		// описание стиля
		РегулярноеВыражение = "\{([^{}]*)\}";
		РезультатПоиска = СтрНайтиПоРегулярномуВыражению(СтилиHTML, 
			РегулярноеВыражение,
			НаправлениеПоиска.СНачала,
			НачальнаяПозиция,,Истина);
		
		Группы = РезультатПоиска.ПолучитьГруппы();	
		Если Группы.Количество() >0 Тогда
			СтрокаРезультат = Группы[0].Значение;
			СвойстваСтрокойМассив = СтрРазделить(СтрокаРезультат,";",Ложь);
			НачальнаяПозиция = РезультатПоиска.НачальнаяПозиция + РезультатПоиска.Длина;	
		КонецЕсли; 
		
		НачальнаяПозиция = НачальнаяПозиция + 1;
		
		Для каждого СвойствоСтрокой из СвойстваСтрокойМассив Цикл
			СвойствоСтрока = СокрЛП(СвойствоСтрокой);
			
			Если ЗначениеЗаполнено(СвойствоСтрока) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			// сплитим строку на Имя + Значение  
			Позиция = 1;
			РегулярноеВыражение = "^[^=:]+";
			РезультатПоиска = СтрНайтиПоРегулярномуВыражению(СвойствоСтрока, 
				РегулярноеВыражение,
				НаправлениеПоиска.СНачала,
				Позиция,,Истина);
			
			Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда
				ИмяСвойства = Сред(СвойствоСтрока,
					РезультатПоиска.НачальнаяПозиция, РезультатПоиска.Длина);
				Позиция = РезультатПоиска.НачальнаяПозиция + РезультатПоиска.Длина;    
					ЗначениеСвойства = Сред(СвойствоСтрока,Позиция+1,СтрДлина(СвойствоСтрока));					
			КонецЕсли;
			
			НоваяСтрока = ТЗ_Стили.Добавить();
			НоваяСтрока.Селектор	= ВРег(Селектор);
			НоваяСтрока.Свойство	= СокрЛП(ИмяСвойства);				
			НоваяСтрока.Значение	= СокрЛП(ЗначениеСвойства);
		КонецЦикла;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ТЗ_Стили,"ТаблицаСтилей"); 
	ПризнакТаблицаСтилейЗаполнена = Истина;
КонецПроцедуры

// Возвращает структуру для применения форматирования по значению селектора макета CSS
Функция ПолучитьСтиль(Знач СелекторCSS)  
	ТЗ_Стили = РеквизитФормыВЗначение("ТаблицаСтилей");
	
	Если ТЗ_Стили.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементыСтиля = ИнициализацияЭлементовСтиля();  
	ШрифтИмя			= неопределено;
	ШрифтРазмер			= неопределено;
	ШрифтПолужирный		= неопределено;
	ШрифтНаклонный		= неопределено;
	ШрифтПодчеркивание	= неопределено;
	ШрифтЗачеркивание	= неопределено;	
	
	// Заполняем сначала по селектору <body> (родительский), затем по выбранному стилю	
	СелекторBODY = "body";
	Отбор = Новый Структура();
	Отбор.Вставить("Селектор");
	Отбор.Селектор = ВРег(СелекторBODY);
	Строки = ТЗ_Стили.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Для Каждого Строка из Строки Цикл
			ЗаполнитьГоризонтальноеПоложение(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
			ЗаполнитьМеждустрочныйИнтервал(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
		    ЗаполнитьОтступ(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
			ЗаполнитьЦветТекста(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
            ЗаполнитьЦветФона(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
			
			// шрифт	
			ЗаполнитьШрифтИмя(ШрифтИмя, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтРазмер(ШрифтРазмер, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтПолужирный(ШрифтПолужирный, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтНаклонный(ШрифтНаклонный, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтПодчеркивание(ШрифтПодчеркивание, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтЗачеркивание(ШрифтЗачеркивание, Строка.Свойство, Строка.Значение);			
		КонецЦикла;
	КонецЕсли;
	
	Отбор.Селектор = ВРег(СелекторCSS);
	Строки = ТЗ_Стили.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Для Каждого Строка из Строки Цикл
			ЗаполнитьГоризонтальноеПоложение(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
			ЗаполнитьМеждустрочныйИнтервал(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
		    ЗаполнитьОтступ(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
			ЗаполнитьЦветТекста(ЭлементыСтиля, Строка.Свойство, Строка.Значение);
            ЗаполнитьЦветФона(ЭлементыСтиля, Строка.Свойство, Строка.Значение);       
			
			// шрифт	
			ЗаполнитьШрифтИмя(ШрифтИмя, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтРазмер(ШрифтРазмер, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтПолужирный(ШрифтПолужирный, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтНаклонный(ШрифтНаклонный, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтПодчеркивание(ШрифтПодчеркивание, Строка.Свойство, Строка.Значение);
			ЗаполнитьШрифтЗачеркивание(ШрифтЗачеркивание, Строка.Свойство, Строка.Значение);		
		КонецЦикла;	
		ЭлементыСтиля.Шрифт = Новый Шрифт(
			ШрифтИмя, 
			ШрифтРазмер, 
			ШрифтПолужирный, 
			ШрифтНаклонный, 
			ШрифтПодчеркивание, 
			ШрифтЗачеркивание);
	КонецЕсли;
	
	Возврат ЭлементыСтиля; 
КонецФункции

Процедура ЗаполнитьГоризонтальноеПоложение(ЭлементыСтиля, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Горизонтальное положение
	Свойство = "text-align";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		ЗначениеПоЛевомуКраю = "left";
		ЗначениеПоПравомуКраю = "right";
		ЗначениеПоЦентру = "center";		
		ЗначениеПоШирине = "justify";
		
		Если ВРег(ЗначениеСвойства) = ВРег(ЗначениеПоЛевомуКраю) Тогда 
			ЭлементыСтиля.Параграф.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			
		ИначеЕсли ВРег(ЗначениеСвойства) = ВРег(ЗначениеПоПравомуКраю) Тогда  
			ЭлементыСтиля.Параграф.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			
		ИначеЕсли ВРег(ЗначениеСвойства) = ВРег(ЗначениеПоЦентру) Тогда  
			ЭлементыСтиля.Параграф.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			
		ИначеЕсли ВРег(ЗначениеСвойства) = ВРег(ЗначениеПоШирине) Тогда  
			ЭлементыСтиля.Параграф.ГоризонтальноеПоложение = ГоризонтальноеПоложение.ПоШирине;
			
		Иначе
			ЭлементыСтиля.Параграф.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Авто;				
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьМеждустрочныйИнтервал(ЭлементыСтиля, Знач ИмяСвойства, Знач ЗначениеСвойства)  
	// Междустрочный интервал (множитель от размера шрифта текущего текста)
	Свойство = "line-height";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда
		ЭлементыСтиля.Параграф.МеждустрочныйИнтервал = ЗначениеСвойства;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьОтступ(ЭлементыСтиля, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Отступ (в поинтах: pt = px * (72/96))
	Свойство = "margin-left";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда
		ЭлементыСтиля.Параграф.Отступ = ЗначениеВПоинтах(ЗначениеСвойства);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьЦветТекста(ЭлементыСтиля, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Цвет текста
	Свойство = "color";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда
		ЭлементыСтиля.ЦветТекста = ЦветПоСтроке(ЗначениеСвойства);
		ЭлементыСтиля.ЦветТекстаУстановлен = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьЦветФона(ЭлементыСтиля, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Цвет фона 
	Свойство = "background-color";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		ЭлементыСтиля.ЦветФона = ЦветПоСтроке(ЗначениеСвойства); 
		ЭлементыСтиля.ЦветФонаУстановлен = Истина;		
	КонецЕсли;
КонецПроцедуры 

Процедура ЗаполнитьШрифтИмя(ШрифтИмя, Знач ИмяСвойства, Знач ЗначениеСвойства)
    // Имя 
	// font-family
	Свойство = "font-family";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		ШрифтИмя = ЗначениеСвойства;
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьШрифтРазмер(ШрифтРазмер, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Размер
	// font-size
	Свойство = "font-size";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		ШрифтРазмер = ЗначениеВПоинтах(ЗначениеСвойства);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьШрифтПолужирный(ШрифтПолужирный, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Полужирный (Bold)
	// font-weight: bold 
	Свойство = "font-weight";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		ПолужирныйТекст = "bold";
		ПолужирныйЗначение = "600";
		
		Если ВРег(ЗначениеСвойства) = ВРег(ПолужирныйТекст) ИЛИ
				ЗначениеСвойства = ПолужирныйЗначение Тогда
			ШрифтПолужирный = Истина;
		Иначе
			ШрифтПолужирный = Ложь;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьШрифтНаклонный(ШрифтНаклонный, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Наклонный 
	// font-style: italic
	Свойство = "font-style";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		Наклонный = "italic";
		
		Если ВРег(ЗначениеСвойства) = ВРег(Наклонный) Тогда
			ШрифтНаклонный = Истина;
		Иначе
			ШрифтНаклонный = Ложь;	
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

Процедура ЗаполнитьШрифтПодчеркивание(ШрифтПодчеркнутый, Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Подчеркивание
	// text-decoration: underline
	Свойство = "text-decoration";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		Подчеркнутый = "underline";
		
		Если ВРег(ЗначениеСвойства) = ВРег(Подчеркнутый) Тогда
			ШрифтПодчеркнутый = Истина;	
		Иначе
			ШрифтПодчеркнутый = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьШрифтЗачеркивание(ШрифтЗачеркнутый,Знач ИмяСвойства, Знач ЗначениеСвойства)
	// Зачеркивание
	// text-decoration: line-through
	Свойство = "text-decoration";
	Если ВРег(ИмяСвойства) = ВРег(Свойство) Тогда 
		Зачеркнутый = "line-through";
		
		Если ВРег(ЗначениеСвойства) = ВРег(Зачеркнутый) Тогда
			ШрифтЗачеркнутый = Истина;	
		Иначе
			ШрифтЗачеркнутый = Ложь;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
	
// Возвращает цвет в формате 1С (тип Цвет) по строке.
// Поддерживаются строки, содержащие описание цвета в шестнадцатеричном формате и в формате RGB
// Параметры:
//  * ЦветСтрока - Строка - Текстовая строка должна содержать значения компонентов цвета внутри скобок (), разделенных запятой.
// 		Пример: "rgb(0,225,10)" или "hsla(0, 100%, 50%, 0.5)". Функция ЦветПоСтроке(Знач ЦветСтрока)
//
// Возвращаемое значение:
//  Цвет в формате 1С. Если не удалось определить цвет, тогда возвращается черный цвет
Функция ЦветПоСтроке(Знач ЦветСтрока)
	ЧерныйЦвет = WebЦвета.Черный;	// цвет по умолчанию
	
	// цвет задан в шестнадцатеричном формате 
	Если СтрНачинаетсяС(ЦветСтрока,"#") Тогда
		Цвет = УН_ЦветСервисКлиентСервер.HEX_в_RGB(ЦветСтрока);
		Возврат Цвет;
	КонецЕсли;
	
	КомпонентыЦвета = ОпределитьКомпонентыЦвета(ЦветСтрока); 
	Если КомпонентыЦвета = Неопределено Тогда
		Цвет = ЧерныйЦвет;
		Возврат Цвет;
	КонецЕсли;		
	
	// цвет задан в RGB формате 	
	Если СтрНачинаетсяС(ВРег(ЦветСтрока),"RGB") Тогда
		Если КомпонентыЦвета.Количество() = 3 Тогда
			Цвет = Новый Цвет(
				КомпонентыЦвета[0],
				КомпонентыЦвета[1],
				КомпонентыЦвета[2]);
				
			// исключение для церного цвета
			Если КомпонентыЦвета[0] = 0
				И КомпонентыЦвета[1] = 0
				И КомпонентыЦвета[2] = 0 Тогда
				Цвет = ЧерныйЦвет;
			КонецЕсли;
		Иначе
			Цвет = ЧерныйЦвет;
		КонецЕсли;				
	КонецЕсли;
	
	// цвет задан в RGBА формате (RGBA — Red, Green, Blue, Alpha)
	Если СтрНачинаетсяС(ВРег(ЦветСтрока),"RGBA") Тогда
		// прозрачность не поддерживается
		Цвет = ЧерныйЦвет;	 			
	КонецЕсли;
	
	// цвет задан в HSL формате (Hue, Saturation, Lightness)
	Если СтрНачинаетсяС(ВРег(ЦветСтрока),"HSL") Тогда
		// прозрачность не поддерживается
		Цвет = ЧерныйЦвет;	 			
	КонецЕсли;	
	
	// цвет задан в HSLA формате (Hue, Saturation, Lightness, Alpha)
	Если СтрНачинаетсяС(ВРег(ЦветСтрока),"HSLA") Тогда
		// прозрачность не поддерживается
		Цвет = ЧерныйЦвет;	 			
	КонецЕсли;
	
	Возврат Цвет;	
КонецФункции
	
// Выделяет из строки текста компоненты цвета (без относительно в каком они формате).
// Параметры:
//  * ЦветСтрока - Строка - Текстовая строка должна содержать значения компонентов цвета внутри скобок (), разделенных запятой.
// 		Пример: "rgb(0,225,10)" или "hsla(0, 100%, 50%, 0.5)".  
// 
// Возвращаемое значение:
//  Массив - содержит значения, которые были в круглых скобках в той же последовательности, как они были указаны в исходной строке.
Функция ОпределитьКомпонентыЦвета(Знач ЦветСтрока)
	Результат = Неопределено;
	
	РегулярноеВыражение = "\(([^)]+)\)";
	РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ЦветСтрока, 
		РегулярноеВыражение,
		НаправлениеПоиска.СНачала,,,Истина);
	
	Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда
		Группы = РезультатПоиска.ПолучитьГруппы(); 
		СтрокаРезультата = Группы[0].Значение;
		Результат = СтрРазделить(СтрокаРезультата,",");
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Возвращает значение величины в поинтах
// Параметры:
//  * ЗначениеТекст	- Строка	- Соджержит значение свойства CSS и его единицу. Например: "12pt" или "110 %" и т.д. 
//  * РазмерШрифта 	- Число 	- Размер шрифта в pt. Значение по умолчанию = 12pt. Используется, если исходное значение задано в em или % (1em = текущий размер шрифта в pt)
//
// Возвращаемое значение:
//  Число - числовое значение величины в pt. Если исходную величину невозможно перевести в pt, тогда содержит 0.
//			Если параметр ЗначениеТекст не указан, то возвращает 0.
//
Функция ЗначениеВПоинтах(Знач ЗначениеТекст, Знач РазмерШрифта = 12)
	Результат = 0;
	
	Если НЕ ЗначениеЗаполнено(ЗначениеТекст) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// значение
	РегулярноеВыражение = "-?\d+(?:\.\d+)?"; // Находит: 123, 123.45, -123.45	
	РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ЗначениеТекст, 
		РегулярноеВыражение,
		НаправлениеПоиска.СНачала,,,Истина);
	
	Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда
		Результат = Число(Сред(ЗначениеТекст, 
			РезультатПоиска.НачальнаяПозиция, 
			РезультатПоиска.Длина));
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	// единицы
	РегулярноеВыражение = "\b(?:pt|px|em|rem|%|vh|vw|vmin|vmax|ex|ch|cm|mm|in|pc|q)\b"; // Находит: pt, px, em, rem, %, vh, vw, vmin, vmax)
	РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ЗначениеТекст, 
		РегулярноеВыражение,
		НаправлениеПоиска.СНачала,,,Истина);
	
	Если РезультатПоиска.НачальнаяПозиция <> 0 Тогда				
		Единица = Сред(ЗначениеТекст,
			РезультатПоиска.НачальнаяПозиция + РезультатПоиска.Длина + 1, 
			РезультатПоиска.Длина);
	Иначе
		Единица = "pt";	// если не задано, то считаем, что размер в pt		
	КонецЕсли;
	
	Проценты 			= "%";
	ОтносительноШрифта 	= "em";
	Пиксели 			= "px";
	Поинты 				= "pt";
	
	Если ВРег(Единица) = ВРег(ОтносительноШрифта) Тогда
		Результат = Результат * РазмерШрифта;		
	КонецЕсли;
			
	Если ВРег(Единица) = Проценты Тогда
		// % и em не поддерживаются => нет отступа	
		Результат = Результат * РазмерШрифта / 100;
	КонецЕсли;
	
	Если ВРег(Единица) = ВРег(Пиксели) Тогда
		Результат = Окр(Результат * 72 / 96, 1); 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИнициализацияЭлементовСтиля()
	Шрифт		= Новый Шрифт();
	ЦветТекста 	= Новый Цвет();
	ЦветФона 	= Новый Цвет();	
	
	Параграф 	= Новый Структура();
	Параграф.Вставить("ГоризонтальноеПоложение");
	Параграф.Вставить("МеждустрочныйИнтервал");
	Параграф.Вставить("Отступ");
	Параграф.Вставить("ТипПараграфа");
	
	Результат 	= Новый Структура();
	Результат.Вставить("Параграф", Параграф);	
	Результат.Вставить("ЦветТекста", ЦветТекста); 
	Результат.Вставить("ЦветФона", ЦветФона);
	Результат.Вставить("Шрифт", Шрифт);
	
	// признаки
	Результат.Вставить("ЦветТекстаУстановлен", Ложь); 
	Результат.Вставить("ЦветФонаУстановлен", Ложь);
	
	Возврат Результат;
КонецФункции	

&НаКлиенте 
// Получает границы выделенного фрагмента текста и возвращает массив элементов.
// Возвращаемое значение: 
//  * Массив - может содержать элементы только следующих типов:
// 					ТекстФорматированногоДокумента, 
//					ПереводСтрокиФорматированногоДокумента 
// 					КартинкаФорматированногоДокумента.
Функция ВыделенныйФрагмент()
	НачальнаяПозиция = 0;
	КонечнаяПозиция = 0;
	Элементы.ДополнительныйТекстКСообщению.ПолучитьГраницыВыделения(НачальнаяПозиция,КонечнаяПозиция);
    Результат = ДополнительныйТекстКСообщению.СформироватьЭлементы(НачальнаяПозиция,КонечнаяПозиция);
	Возврат Результат; 
КонецФункции

&НаКлиенте
Процедура ПослеВыбораИзМеню(ВыбранныйЭлемент,Параметры) Экспорт  
	Если ВыбранныйЭлемент = Неопределено 
		ИЛИ ВыбранныйЭлемент.Значение = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	ПрименитьСтиль(Строка(ВыбранныйЭлемент.Значение));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВставкиШаблонаДополнительногоТекста(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьДополнительныйТекстКСообщению();
		УстановитьШаблонДополнительногоТекста();
	КонецЕсли;	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОчисткиДополнительногоТекста(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьДополнительныйТекстКСообщению();
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти









	

