
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПрефиксПриИзменении(Элемент)
	ОбновитьФорму()
КонецПроцедуры


&НаКлиенте
Процедура АвтонумерацияПриИзменении(Элемент)
	ОбновитьФорму()
КонецПроцедуры



#Область СлужебныеПроцедурыИФункции
// Обновить форму 
&НаКлиенте
Процедура ОбновитьФорму()	
	// префикс
	Элементы.Префикс.Доступность = Запись.ИспользоватьПрефикс;
	Если НЕ Запись.ИспользоватьПрефикс Тогда
		Запись.Префикс = "";
	КонецЕсли;
	
	// диапазон номеров
	Элементы.НачальноеЗначение.Доступность = Запись.Автонумерация;
	Элементы.КонечноеЗначение.Доступность = Запись.Автонумерация;
	Если НЕ Запись.Автонумерация Тогда
		Запись.НачальноеЗначение = 0;
		Запись.КонечноеЗначение = 0;
	КонецЕсли;	
КонецПроцедуры 


// Проверка данных формы
Функция ПроверитьПересекающиесяДиапозыНомеров()
	Возврат Истина;
КонецФункции

// Проверяет, что КонечноеЗначение больше Начального значения
Функция ПроверитьЗначенияИнтервала()
	Возврат Истина;
КонецФункции

// Проверяет, что поле Префикс заполнено, если активна опция ИспользоватьПрефикс
Функция ПроверитьЗаполнениеПрефикс()
	Возврат Истина;
КонецФункции

// Проверяет, что Начальное и Конечное значения заполнены, если активна опция Автонумерация
Функция ПроверитьЗаполнениеНачальноеИКонечноеЗначение()
	Возврат Истина;
КонецФункции

// Проверка корректности настройки
Функция ПроверитьДиапазонНомеров()
	ПроверитьЗаполнениеНачальноеИКонечноеЗначение();
	ПроверитьЗначенияИнтервала();
	ПроверитьПересекающиесяДиапозыНомеров(); 
	ПроверитьЗаполнениеПрефикс(); 
КонецФункции

#КонецОбласти 
	
	

