////////////////////////////////////////////////////////////////////////////////
// ИСКЛЮЧЕНИЯ
// Модуль содержит все используемые исключения 
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс  


#Область Общие
// Исключение D-0001_001 Параметр %1 имеет недопустимый тип .
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра, вызвавшего исключение
Процедура ВызватьИсключениеНедопустимыйТип(Знач ИмяПараметра) Экспорт;
	ШаблонТекста = НСтр("ru = 'Параметр %1 имеет недопустимый тип.'; 
		|en = 'Рarameter %1 has an invalid type'");
	
	ТекстИсключения = СтрШаблон(ШаблонТекста,ИмяПараметра);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;
	Код				= "D-0001_001";
	ВызватьИсключение(ТекстИсключения, Категория, Код); 
КонецПроцедуры 

// Исключение D-0001_002 Запись с кодом %1 не существует в %2
//
// Параметры:
//   КлючЗаписи - Строка - Код записи, которая должна быть проверена на существование
//   ИмяИсточника - Строка - Наименование источника, в котором проверяется существование записи
Процедура ВызватьИсключениеЗаписьНеСуществует(Знач КлючЗаписи, Знач ИмяИсточника) Экспорт
	ШаблонТекста = НСтр("ru = 'Запись с кодом %1 не существует в %2.'; 
		|en = 'The entry with the %1 code does not exist in %2'");
	
	ТекстИсключения = СтрШаблон(
		ШаблонТекста, 
		КлючЗаписи, 
		ИмяИсточника);
	Категория = КатегорияОшибки.ОшибкаКонфигурации;
    Код	= "D-0001_002";	
	ВызватьИсключение(ТекстИсключения, Категория, Код);
КонецПроцедуры


// Исключение D-0001_003 Параметр %1 содержит пустое (начальное) значение
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра, содержащего пустое значение
Процедура ВызватьИсключениеПустоеЗначение(Знач ИмяПараметра) Экспорт
	ШаблонТекста = НСтр("ru = 'Параметр %1 содержит пустое (начальное) значение.'; 
		|en = 'Рarameter %1 has an empty (initial) value'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ИмяПараметра);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;
	Код				= "D-0001_003";
	ВызватьИсключение(ТекстИсключения, Категория,Код);
КонецПроцедуры


// Исключение D-0001_004 Параметр %1 имеет значение неопределено
//
// Параметры:
//   ИмяПараметра - Строка - имя параметра, значение которого не определено
Процедура ВызватьИсключениеЗначениеНеопределено(Знач ИмяПараметра) Экспорт
	ШаблонТекста = НСтр("ru = 'Параметр %1 имеет значение неопределено.'; 
		|en = 'Рarameter %1 has an unassign value.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ИмяПараметра);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0001_004";
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры


// Исключение D-0001_005 Свойство %1 в %2 не существует
//
// Параметры:
//   ИмяСвойства - Строка - Имя свойства, которое проверяется на существование
//   ИмяСтруктуры - Строка - Имя структуры, в которой проверяется существование свойства
Процедура ВызватьИсключениеСвойствоНеСуществует(Знач ИмяСвойства, Знач ИмяСтруктуры) Экспорт
	ШаблонТекста = НСтр("ru = 'Свойство %1 в %2 не существует.';  
		|en = 'The %1 property does not exist in %2.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ИмяСвойства, ИмяСтруктуры);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0001_005";
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры

// Исключение D-0001_006 Не удалось установить блокировку.
//
// Параметры:
//   ОбъектБлокировки - Строка - Имя объекта блокировки (полное имя объекта метаданных, например, "РегистСведений.УН_ТекущиеНомераОбъектовНумерации") 
//   ПоляБлокировки   - Массив - Каждый элемент массива содержит структуру, где Ключ соответсвует имени поля блокировки, 
//						а Значение - значению, по которому выполняется блокировка. 
Процедура ВызватьИсключениеБлокировкаНеУстановлена(Знач ОбъектБлокировки, Знач ПоляБлокировки = Неопределено) Экспорт
	ТекстИсключения = НСтр("ru = 'Не удалось установить блокировку.';  
		|en = 'The lock could not be set.'");
	
	ШаблонТекстаДляОбъекта = НСтр("ru = 'Объект блокировки: ""%1"".';  
		|en = 'Object: ""%1"".'");
	ТекстДляОбъекта = СтрШаблон(ШаблонТекстаДляОбъекта, ОбъектБлокировки); 
    ТекстИсключения = ТекстИсключения + Символы.ПС + ТекстДляОбъекта; 
	
	ШаблонТекстаДляПоляБлокировки = НСтр("ru = 'Поле блокировки ""%1"": ""%2"".';  
		|en = 'Field: ""%1"": ""%2"".'");

	Если ПоляБлокировки <> Неопределено Тогда  
		Если ТипЗнч(ПоляБлокировки) = Тип("Массив") Тогда
			Для каждого ПолеБлокировки из ПоляБлокировки Цикл
				Если ТипЗнч(ПолеБлокировки) <> Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ПолеБлокировки.Свойство("ИмяПоля") 
					ИЛИ НЕ ПолеБлокировки.Свойство("ЗначениеПоля") Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстИсключения = ТекстИсключения + Символы.ПС + 
					СтрШаблон(ШаблонТекстаДляПоляБлокировки, ПолеБлокировки.ИмяПоля, ПолеБлокировки.ЗначениеПоля);
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0001_006";
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры
#КонецОбласти



#Область УправлениеДоступом
// Исключение D-0002_001 Нет полномочий на операцию %1 для %2
//
// Параметры:
//   Право 			- Строка - Имя права доступа ("добавление", "чтение", и т.д., см. названия прав)
//	 ОбъектДоступа	- Строка - Имя объекта доступа (полное имя объекта метаданных)
Процедура ВызватьИсключениеНетПраваДоступа(Знач Право, Знач ОбъектДоступа) Экспорт
	ШаблонТекста = НСтр("ru = 'Нет полномочий на операцию ""%1"" для ""%2"".';  
		|en = 'Activity ""%1"" is not allowed for ""%2"".'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, Право, ОбъектДоступа);
	Категория 		= КатегорияОшибки.НарушениеПравДоступа;	
    Код				= "D-0002_001";
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры

// Исключение D-0002_002 Нет полномочий на операцию %1 для %2 для значений проверяемых полей %3
//
// Параметры:
//   Право 			- Строка - Имя права доступа ("добавление", "чтение", и т.д., см. названия прав)
//	 ОбъектДоступа	- Строка - Имя объекта доступа (полное имя объекта метаданных)
//	 ВидыДоступа	- Массив - Каждый элемент массива содержит структуру, где Ключ соответсвует синониму поля объекта, 
//						а Значение - значению для соответствующего Вида доступа. 
// 
Процедура ВызватьИсключениеНетПраваДоступаДляВидовДоступа(Знач Право, Знач ОбъектДоступа, Знач ВидыДоступа) Экспорт
	ШаблонТекста = НСтр("ru = 'Нет полномочий на операцию ""%1"" для ""%2"" по значениям проверяемых полей:';  
		|en = 'Activity ""%1"" is not allowed for ""%2"" arrording to:'");
	
	ШаблонТекстаДляВидаДоступа = "- %1: ""%2""";
	
	ТекстИсключения = СтрШаблон(ШаблонТекста, Право, ОбъектДоступа);
	
	Если ТипЗнч(ВидыДоступа) = Тип("Массив") Тогда
		КоличествоВидовДоступа = ВидыДоступа.Количество();
		Счетчик = 1;
		Для каждого ВидДоступа из ВидыДоступа Цикл
			Если ТипЗнч(ВидДоступа) <> Тип("Структура") Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ВидДоступа.Свойство("ИмяПоля") 
				ИЛИ НЕ ВидДоступа.Свойство("ЗначениеПоля") Тогда
				Продолжить;
			КонецЕсли;
				
			ТекстИсключения = ТекстИсключения + Символы.ПС + 
				СтрШаблон(ШаблонТекстаДляВидаДоступа, ВидДоступа.ИмяПоля, ВидДоступа.ЗначениеПоля);
				
			Если Счетчик < КоличествоВидовДоступа Тогда
				ТекстИсключения = ТекстИсключения + ";";
			Иначе
				ТекстИсключения = ТекстИсключения + ".";
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;			
	
	Категория 		= КатегорияОшибки.НарушениеПравДоступа;	
    Код				= "D-0002_002";
    
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры  
#КонецОбласти


#Область СервисНумерации
// Исключение D-0003_001 Объект нумерации %1: установлена пометка удаления
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
Процедура ВызватьИсключениеОбъектНумерацииПомеченНаУдаление(Знач ОбъектНумерацииКод) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": установлена пометка удаления.';  
		|en = 'Оbject ""%1"": marked as deleted.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_001";  
	ДополнительнаяИнформация = НСтр("ru = 'Справочник """"УН_ОбъектыНумерации"""". Недопускается использование записей с пометкой удаления.'; 
		|en = 'Catalog ""УН_ОбъектыНумерации"". Using entries marked for deletion is not allowed.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры

// Исключение D-0003_002 Объект нумерации %1: ДиапазонНомеров %2 отсутсвует.
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
//	 ДиапазонНомеров - Строка - Диапазон номеров (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
Процедура ВызватьИсключениеДиапазонНомеровОтсутствует(Знач ОбъектНумерацииКод, Знач ДиапазонНомеров) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": Диапазон номеров ""%2"" отсутсвует.';  
		|en = 'Object ""%1"": Range ""%2"" is missing.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод, ДиапазонНомеров);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_002";  
	ДополнительнаяИнформация = НСтр("ru = 'Отсутсвуют записи в регистре ""УН_ДиапазоныНомеров"" для Объекта нумерации.'; 
		|en = 'There are no entries in the register ""УН_ДиапазоныНомеров"" for the Object.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры 

// Исключение D-0003_003 Объект нумерации %1: ДиапазонНомеров %2 предполагает автоматическую нумерацию.
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
//	 ДиапазонНомеров - Строка - Диапазон номеров (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
Процедура ВызватьИсключениеДиапазонНомеровАвтоматическаяНумерация(Знач ОбъектНумерацииКод, Знач ДиапазонНомеров) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": Диапазон номеров ""%2"" предполагает автоматическую нумерацию.';  
		|en = 'Object ""%1"": Range ""%2""  is expected to use automatic numbering.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод, ДиапазонНомеров);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_003";  
	ДополнительнаяИнформация = НСтр("ru = 'Смотри запись в регистре ""УН_ДиапазоныНомеров"" для Объекта нумерации.'; 
		|en = 'See record in the register ""УН_ДиапазоныНомеров"" for the Object.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры

// Исключение D-0003_004 Объект нумерации %1: ДиапазонНомеров %2 предполагает внешнюю нумерацию.
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
//	 ДиапазонНомеров - Строка - Диапазон номеров (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
Процедура ВызватьИсключениеДиапазонНомеровВнешняяНумерация(Знач ОбъектНумерацииКод, Знач ДиапазонНомеров) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": Диапазон номеров ""%2"" предполагает внешнюю нумерацию.';  
		|en = 'Object ""%1"": Range ""%2""  is expected to use automatic numbering.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод, ДиапазонНомеров);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_003";  
	ДополнительнаяИнформация = НСтр("ru = 'Смотри запись в регистре ""УН_ДиапазоныНомеров"" для Объекта нумерации.'; 
		|en = 'See record in the register ""УН_ДиапазоныНомеров"" for the Object.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры 

// Исключение D-0003_005 Объект нумерации %1: ДиапазонНомеров %2: Достигнут конечный номер.
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
//	 ДиапазонНомеров - Строка - Диапазон номеров (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
Процедура ВызватьИсключениеДиапазонНомеровДостигнутКонечныйНомер(Знач ОбъектНумерацииКод, Знач ДиапазонНомеров) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": Диапазон номеров ""%2"": Достигнут конечный номер.';  
		|en = 'Object ""%1"": Range ""%2"": The end number has been reached.'");
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод, ДиапазонНомеров);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_003";  
	ДополнительнаяИнформация = НСтр("ru = 'Смотри запись в регистре ""УН_ДиапазоныНомеров"" для Объекта нумерации.'; 
		|en = 'See record in the register ""УН_ДиапазоныНомеров"" for the Object.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры

// Исключение D-0003_006 Номер %1 не уникальный.
//
// Параметры:
//   Номер - Строка - Значение номера 
//   КлючиУникальности - Массив - Каждый элемент массива содержит структуру, где Ключ соответсвует имени поля (измерение регистра УН_НомераОбъектовНумерации), 
//						а Значение - значению, по которому выполняется проверка. 
Процедура ВызватьИсключениеНомерНеУникальный(Знач Номер, Знач КлючиУникальности) Экспорт 
	ШаблонТекста = НСтр("ru = 'Номер ""%1"" не уникальный.';  
		|en = 'The number ""%1"" is not unique.'");
	
	ТекстИсключения = СтрШаблон(ШаблонТекста, Номер);
	
	ШаблонТекстаДляПоляУникальности = НСтр("ru = 'Ключ уникальности ""%1"": ""%2"".';  
		|en = 'Key ""%1"": ""%2"".'");

	Если КлючиУникальности <> Неопределено Тогда  
		Если ТипЗнч(КлючиУникальности) = Тип("Массив") Тогда
			Для каждого КлючУникальности из КлючиУникальности Цикл
				Если ТипЗнч(КлючУникальности) <> Тип("Структура") Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ КлючУникальности.Свойство("ИмяПоля") 
					ИЛИ НЕ КлючУникальности.Свойство("ЗначениеПоля") Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстИсключения = ТекстИсключения + Символы.ПС + 
					СтрШаблон(ШаблонТекстаДляПоляУникальности, КлючУникальности.ИмяПоля, КлючУникальности.ЗначениеПоля);		
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_006";
	ВызватьИсключение(ТекстИсключения, Категория, Код);	
КонецПроцедуры

// Исключение D-0003_007 Объект нумерации %1: ДиапазонНомеров %2: Превышена допустимая длина номера.
//
// Параметры:
//   ОбъектНумерацииКод - Строка - Идентификатор Объекта нумерации (Справочники.УН_ОбъектыНумерации.Код)
//	 ДиапазонНомеров - Строка - Диапазон номеров (РегистрСведений.УН_ДиапазоныНомеров.НомерДиапазона)
//	 Номер - Строка - Значение номера
//	 ДлинаНомера - Число - Допустимая длина номера согласно настройке
Процедура ВызватьИсключениеПревышенаДлинаНомера(Знач ОбъектНумерацииКод, Знач ДиапазонНомеров, Знач Номер, Знач ДлинаНомера) Экспорт
	ШаблонТекста = НСтр("ru = 'Объект нумерации ""%1"": Диапазон номеров ""%2"": Длина номера ""%3"" с префиксом превышает допустимую длину %4 символов.';  
		|en = 'Object ""%1"": Range ""%2"": The length of ""%3"" including the prefix is too long. Only %4 characters permitted .'");
	
	ТекстИсключения = СтрШаблон(ШаблонТекста, ОбъектНумерацииКод, ДиапазонНомеров, Номер, ДлинаНомера);
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0003_007";  
	ДополнительнаяИнформация = НСтр("ru = 'Проверьте настройки Объектов нумерации и Диапазона номеров. 
		|Длина номера с префиксом не должна превышать установленной максимальной длины.'; 
		|en = 'Check the settings of the Numbering Objects and the Number Range.
		|The length of the number with the prefix must not exceed the set maximum length.'");
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры 
#КонецОбласти 

#Область УправлениеНедвижимостьюОбщее
// Исключение D-0004_001 Параметр %1 имеет значение неопределено
//
Процедура ВызватьИсключениеУправлениеНедвижимостьюНеактивно() Экспорт
	ТекстИсключения = НСтр("ru = 'Функциональность ""Управление недвижимостью"" неактивна!'; 
		|en = 'The "Real Estate Management" is inactive!'");    
	ДополнительнаяИнформация = НСтр("ru = 'Функциональная опция ""УН_ИспользоватьУправлениеНедвижимостью"" деактивирована.'; 
		|en = 'The Functional option ""Real Estate Management"" is inactive!'");    
	
	Категория 		= КатегорияОшибки.ОшибкаКонфигурации;	
    Код				= "D-0004_001"; 
	ВызватьИсключение(ТекстИсключения, Категория, Код, ДополнительнаяИнформация);	
КонецПроцедуры


#КонецОбласти


#КонецОбласти