////////////////////////////////////////////////////////////////////////////////
// Модуль формы обработки ЖурналСообщений
// 
// Описание:
//  Модуль содержит процедуры и функции обработки Журнала сообщений.
//  
////////////////////////////////////////////////////////////////////////////////
 
 
#Область ОписаниеПеременных  
&НаКлиенте
Перем МассивСообщений, ЖурналСообщений;

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийФормы
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Значения критериев выбора по умолчанию
	// пользователь
	УстановитьПользователяПоУмолчанию();
	
	// дата/время
	ПериодПоУмолчанию = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	КритерийПериод = ПериодПоУмолчанию;
	КритерийВремяС = НачалоДня(КритерийПериод.ДатаНачала);
	КритерийВремяПо = КонецДня(КритерийПериод.ДатаОкончания);
КонецПроцедуры

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийЭлементовТаблицыФормыЖурналыСообщений
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ЖурналыСообщенийПриАктивизацииСтроки(Элемент)	
	ЗаголовокЖурналаСообщений = Элементы.ЖурналыСообщений.ТекущиеДанные;
	
	// Может быть нет текущих данных => выходим
	Если ЗаголовокЖурналаСообщений = Неопределено Тогда
		ДеревоСообщений.ПолучитьЭлементы().Очистить();		
		Возврат;
	КонецЕсли;
	
	// Обновить количество сообщений по типам в заголовках кнопок
	Элементы.КнопкаОшибки.Заголовок 		= ЗаголовокЖурналаСообщений.Ошибки;
	Элементы.КнопкаПредупреждения.Заголовок = ЗаголовокЖурналаСообщений.Предупреждения;
	Элементы.КнопкаИнформация.Заголовок 	= ЗаголовокЖурналаСообщений.Информация;	

	// Получить сообщения
	АдресТекущегоЖурналаСообщений = неопределено;
	АдресВременногоХранилища = ПолучитьСообщенияЖурнала(ЗаголовокЖурналаСообщений);
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		АдресТекущегоЖурналаСообщений = АдресВременногоХранилища;
	КонецЕсли; 

	// Установить состояние кнопок отбора по типу сообщений (по умолчанию показываем все сообщения)
	УстановитьПараметрыОтбораСообщений(Истина,Истина,Истина);
	
	// Получить состояние кнопок отбора по типу сообщений
	Отбор = ПараметрыОтбораСообщений();
	
	// показать список сообщений в дереве сообщений с учетом отбора
	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	ЗаполнитьДеревоСообщений(АдресТекущегоЖурналаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры 
#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСообщений
////////////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ДеревоСообщенийПриАктивизацииСтроки(Элемент)
	УстановитьСтатусЭлементовУправленияПоСообщению(Элемент.ТекущиеДанные);	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
	
	// имя поля содержащего картинку, если есть Контекст
	ПолеКонтекстСКартинкой = "ДеревоСообщенийЕстьКонтекстКартинка";

	Если Поле.Имя = ПолеКонтекстСКартинкой Тогда
		УН_СписокСообщенийКлиент.ПоказатьОкноСКонтекстомСообщения(ТекущиеДанные);
	Иначе
		УН_СписокСообщенийКлиент.ПоказатьОкноСРасширеннымТекстомСообщения(ТекущиеДанные, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиКомандФормы      
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Информация(Команда)
	Кнопка = Элементы.КнопкаИнформация;	
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;	
	КонецЕсли;      
	Отбор = ПараметрыОтбораСообщений();	
	
	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	ЗаполнитьДеревоСообщений(АдресТекущегоЖурналаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры

&НаКлиенте
Процедура Ошибки(Команда)
	Кнопка = Элементы.КнопкаОшибки;	
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;	
	КонецЕсли;      
	Отбор = ПараметрыОтбораСообщений();	

	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	ЗаполнитьДеревоСообщений(АдресТекущегоЖурналаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры

&НаКлиенте
Процедура Предупреждения(Команда)
	Кнопка = Элементы.КнопкаПредупреждения;	
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;	
	КонецЕсли;      
	Отбор = ПараметрыОтбораСообщений();	

	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	ЗаполнитьДеревоСообщений(АдресТекущегоЖурналаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры

&НаКлиенте  
// Обработчик команды получения контекста сообщения
Процедура Контекст(Команда)
	ТекущиеДанные 	= Элементы.ДеревоСообщений.ТекущиеДанные;
	УН_СписокСообщенийКлиент.ПоказатьОкноСКонтекстомСообщения(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте  
// Обработчик команды получения дополнительного текста сообщения
Процедура ДопТекст(Команда)
	ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;	
	УН_СписокСообщенийКлиент.ПоказатьОкноСРасширеннымТекстомСообщения(ТекущиеДанные, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте   
// Обработчик команды ВыполнитьПоискЖурналов
Процедура ВыполнитьПоискЖурналов(Команда)	
	ЦелеваяВкладка = Элементы.ВкладкаРезультатыПоиска;
	ТекстСообщения = НСтр("ru = 'Нет записей, удовлетворяющих критериям поиска. Измените критерии поиска.'; 
		|en = 'No records match the search criteria. Adjust the search criteria.'");
	
	// очистка собщений, если были
	ОчиститьСообщения();  
	
	// выполняем поиск
	ВыполнитьПоискЖурналовСообщений(); 
	
	// показываем пользователю закладку с результатом  
	Элементы.Вкладки.ТекущаяСтраница = ЦелеваяВкладка;   
КонецПроцедуры  

&НаКлиенте
Процедура РазвернутьВсе(Команда)
		ТекущаяСтрока = Элементы.ДеревоСообщений.ТекущаяСтрока;
	Элементы.ДеревоСообщений.Развернуть(ТекущаяСтрока,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	ТекущаяСтрока = Элементы.ДеревоСообщений.ТекущаяСтрока;
	Элементы.ДеревоСообщений.Свернуть(ТекущаяСтрока);
КонецПроцедуры
#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
#Область СлужебныеПроцедурыИФункции                                             
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
// Возвращает параметры отбора сообщений, которые соответсвуют текущему состоянию кнопок: Ошибки, Предупреждения, Инфомация
// Возвращаемое значение:
//  Массив - Содержит три элемента в следующем порядке: Ошибка, Предупреждение, Информация.
// 		Элемент содержит значение типа Булево. 
//		Содержит Истина, если соответсвующая кнопка нажата на форме и Ложь - в противном случае.
//
Функция ПараметрыОтбораСообщений()
	// Инициализируем переменные
	ТипСообщенияОшибка 			= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Ошибка");
	ТипСообщенияПредупреждение 	= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Предупреждение");
	ТипСообщенияИнформация 		= ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Информация");
	
	Результат = Новый Структура();
	Результат.Вставить(ТипСообщенияОшибка, Элементы.КнопкаОшибки.Пометка); 
	Результат.Вставить(ТипСообщенияПредупреждение, Элементы.КнопкаПредупреждения.Пометка);
	Результат.Вставить(ТипСообщенияИнформация, Элементы.КнопкаИнформация.Пометка);

	Возврат Результат; 
КонецФункции


&НаКлиенте
// Устанавливает состояние элементов управления на форме в зависимости от выбранного сообщения
// Параметры:
//  ДанныеСообщения - СтрокаДереваЗначений - Содержит данные текущей строки табличного поля
Процедура УстановитьСтатусЭлементовУправленияПоСообщению(Знач ДанныеСообщения)
	// Определяем наличие доп. текста и контекста
	ЕстьДопТекст = ?(ДанныеСообщения = Неопределено, Ложь, ДанныеСообщения.ЕстьДопТекст);
	ЕстьКонтекст = ?(ДанныеСообщения = Неопределено, Ложь, ДанныеСообщения.ЕстьКонтекст);
	
	// Имена элементов управления
	ИмяКнопкиПоказатьТекст 	  = "КнопкаПоказатьСообщение";
	ИмяКнопкиПоказатьКонтекст = "КнопкаПоказатьКонтекстСообщения";
	
	// Устанавливаем доступность кнопок
	УстановитьДоступностьКнопки(ИмяКнопкиПоказатьТекст, ЕстьДопТекст);
	УстановитьДоступностьКнопки(ИмяКнопкиПоказатьКонтекст, ЕстьКонтекст);
КонецПроцедуры

&НаКлиенте
// Устанавливает доступность кнопки
// Параметры:
//  * ИмяКнопки 	- Строка - Имя кнопки
//  * Доступность 	- Булево - Доступность кнопки
Процедура УстановитьДоступностьКнопки(ИмяКнопки, Доступность)
	Кнопка = Элементы.Найти(ИмяКнопки);
	Если Кнопка <> Неопределено Тогда
		Кнопка.Доступность = Доступность;
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
// Устанавливает состояние кнопок отбора по типу сообщения
// Параметры:
//  * Ошибки 		 - Булево - Если Истина, кнопка "Ошибки" становится нажатой 
//  * Предупреждения - Булево - Если Истина, кнопка "Предупреждения" становится нажатой
//  * Информация 	 - Булево - Если Истина, кнопка "Информация" становится нажатой
Процедура УстановитьПараметрыОтбораСообщений(Знач Ошибки, Знач Предупреждения, Знач Информация)
	КнопкаОшибки 		 = Элементы.КнопкаОшибки;  
	КнопкаПредупреждения = Элементы.КнопкаПредупреждения;
	КнопкаИнформация 	 = Элементы.КнопкаИнформация;

	// Ошибки
	КнопкаОшибки.Пометка = Ошибки;
			
	// Предупреждения
	КнопкаПредупреждения.Пометка = Предупреждения;

	// Информация
	КнопкаИнформация.Пометка = Информация;
КонецПроцедуры

&НаСервере 
// Возвращает текст запроса для получения списка Журналов сообщений
Функция НовыйТексЗапросаЖурналыСообщений()
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	УН_ЖурналСообщений.КлючЖурналаСообщений КАК КлючЖурналаСообщений,
		|	УН_ЖурналСообщений.КоличествоОшибки КАК Ошибки,
		|	УН_ЖурналСообщений.КоличествоПредупреждения КАК Предупреждения,
		|	УН_ЖурналСообщений.КоличествоИнформация КАК Информация,
		|	УН_ЖурналСообщений.КоличествоВсего КАК Всего,
		|	УН_ЖурналСообщений.ВнутреннийКлюч КАК ВнутреннийКлюч,
		|	УН_ЖурналСообщений.ОбъектЖурнала КАК ОбъектЖурнала,
		|	УН_ЖурналСообщений.ДатаВремяСозданияUTC КАК ДатаВремяСозданияUTC,		
		|	УН_ЖурналСообщений.Автор КАК Пользователь,
		|	УН_ЖурналСообщений.ИмяПриложения КАК ИмяПриложения,
		|	УН_ЖурналСообщений.ИмяКомпьютера КАК ИмяКомпьютера,
		|	УН_ЖурналСообщений.IPАдресКлиента КАК IPАдресКлиента,
		|	УН_ЖурналСообщений.НомерСеанса КАК НомерСеанса,
		|	ВЫБОР
		|		КОГДА УН_ЖурналСообщений.КоличествоОшибки > 0
		|			ТОГДА 0
		|		КОГДА УН_ЖурналСообщений.КоличествоПредупреждения > 0
		|			ТОГДА 1
		|		КОГДА УН_ЖурналСообщений.КоличествоИнформация > 0
		|			ТОГДА 2
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК СтатусКартинки		
		|ИЗ
		|	РегистрСведений.УН_ЖурналСообщений КАК УН_ЖурналСообщений";
	
	Возврат СтрШаблон("%1 %2",
		ТекстЗапроса,
		ДополнитьТекстЗапросаЖурналаСообщенийПараметрами());
	КонецФункции 
	
&НаСервере 
// Возвращает текст условий для запроса на получение списка Журналов сообщений 
Функция ДополнитьТекстЗапросаЖурналаСообщенийПараметрами()
	Результат 	= новый Массив();
	Условия 	= новый Массив(); 
	ЕстьУсловия = Ложь;
	
	// Условие для ОбъектЖурнала
	Если КритерийОбъектЖурнала.Количество() > 0 Тогда
		ЕстьУсловия = Истина; 
		Условия.Добавить("УН_ЖурналСообщений.ОбъектЖурнала В (&ОбъектЖурнала)");
	КонецЕсли;
	
	// Условие для Автор    
	Если КритерийПользователь.Количество() > 0 Тогда
		ЕстьУсловия = Истина; 
		Условия.Добавить("УН_ЖурналСообщений.Автор В (&Пользователь)");
	КонецЕсли;	
	
	// Условие для ВнутреннийКлюч
	Если ЗначениеЗаполнено(КритерийВнутреннийКлюч) Тогда  
		ЕстьУсловия = Истина;
		ШаблонУсловия = "УН_ЖурналСообщений.ВнутреннийКлюч %1 &ВнутреннийКлюч";
		РегулярноеВыражение = "[%_]";
		ЭтоМаска = СтрНайтиПоРегулярномуВыражению(КритерийВнутреннийКлюч, РегулярноеВыражение);
		
		ОператорСравнения = "=";
		Если ЭтоМаска.Длина > 0 Тогда		
			ОператорСравнения = "ПОДОБНО";
		КонецЕсли;
		Условия.Добавить(
			СтрШаблон(ШаблонУсловия, ОператорСравнения));		
	КонецЕсли; 
	
	// Условие для Период
	Если КритерийПериод.ДатаНачала <> Дата('00010101') Тогда
		ЕстьУсловия = Истина;
		Условия.Добавить("УН_ЖурналСообщений.ДатаВремяСозданияUTC >= &ПериодНачало");
	КонецЕсли;
	
	Если КритерийПериод.ДатаОкончания <> Дата('00010101') Тогда
		ЕстьУсловия = Истина;
		Условия.Добавить("УН_ЖурналСообщений.ДатаВремяСозданияUTC <= &ПериодКонец");
	КонецЕсли;

	// итоговая строка с условиями
	Если ЕстьУсловия Тогда
		Результат.Добавить("ГДЕ ");  
		Результат.Добавить(СтрСоединить(Условия," И "));  
	КонецЕсли;
	
	Результат = СтрСоединить(Результат," "); 
	Возврат Результат; 
КонецФункции

&НаСервере
// Устанавливает текст запроса и значения параметров для динамического списка ЖурналыСообщений 
Процедура ВыполнитьПоискЖурналовСообщений()		
	ЖурналыСообщений.ТекстЗапроса = НовыйТексЗапросаЖурналыСообщений(); 
	
	// Условие для ОбъектЖурнала	
	Если КритерийОбъектЖурнала.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЖурналыСообщений,
			"ОбъектЖурнала",
			КритерийОбъектЖурнала.Выгрузить().ВыгрузитьКолонку("ОбъектЖурнала"),
			Истина);  
		КонецЕсли;
		
	// Условие для Пользователь	
	Если КритерийПользователь.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЖурналыСообщений,
			"Пользователь",
			КритерийПользователь.Выгрузить().ВыгрузитьКолонку("Пользователь"),
			Истина);  
	КонецЕсли;
	

	// Условие для ВнутреннийКлюч
	Если ЗначениеЗаполнено(КритерийВнутреннийКлюч) Тогда  
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЖурналыСообщений,
			"ВнутреннийКлюч",
			КритерийВнутреннийКлюч,
			Истина);	
	КонецЕсли;
	
	
	// Условие для Период
	Если КритерийПериод.ДатаНачала <> Дата('00010101') Тогда
		КоличествоСекунд = КритерийВремяС - НачалоДня(КритерийВремяС);		
		ВремяНачалоМестное	= НачалоДня(КритерийПериод.ДатаНачала) + КоличествоСекунд;
		ВремяНачалоUTC		= УниверсальноеВремя(ВремяНачалоМестное); 		
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЖурналыСообщений,
			"ПериодНачало",
			ВремяНачалоUTC,
			Истина);
	КонецЕсли;

	
	Если КритерийПериод.ДатаОкончания <> Дата('00010101') Тогда
		КоличествоСекунд = КритерийВремяПо - НачалоДня(КритерийВремяПо);
		ВремяОкончаниеМестное	= НачалоДня(КритерийПериод.ДатаОкончания) + КоличествоСекунд;
		ВремяОкончаниеUTC		= УниверсальноеВремя(ВремяОкончаниеМестное);		
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
			ЖурналыСообщений,
			"ПериодКонец",
			ВремяОкончаниеUTC,
			Истина);
	КонецЕсли; 
	
КонецПроцедуры

// Заполняет дерево сообщений в соответствии с указанными типами сообщений.
//
// Параметры:
//   АдресСпискаСообщений 	- Строка - Адрес временного хранилища, содержащего список сообщений
//   ТипыСообщений 			- Структура - Типы сообщений, по которым необходимо произвести отбор
//   ДеревоСообщений 		- ДанныеФормыДерево - Элемент формы, в который будет выгружен отфильтрованный список сообщений
&НаСервереБезКонтекста
Процедура ЗаполнитьДеревоСообщений(Знач АдресСпискаСообщений, Знач ТипыСообщений, ДеревоСообщений)
// ПРЕДПОСЫЛКИ	
	Если ЭтоАдресВременногоХранилища(АдресСпискаСообщений) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДеревоСообщений = Неопределено Тогда
	 	Возврат;
	КонецЕсли; 

// ОСНОВНАЯ ЧАСТЬ	
	СписокСообщений = УН_СписокСообщений.СписокСообщенийИзВременногоХранилища(АдресСпискаСообщений);
	// может быть нет данных => выходим
	Если СписокСообщений.Сообщения.Количество() = 0 Тогда 
	 	Возврат;
	КонецЕсли;
	
	ОбъектДеревоСообщений = ДанныеФормыВЗначение(ДеревоСообщений,Тип("ДеревоЗначений")); 
	ОбъектДеревоСообщений.Строки.Очистить();
	УН_СписокСообщений.ВыгрузитьСообщенияВДеревоЗначений(СписокСообщений.Сообщения, ОбъектДеревоСообщений, ТипыСообщений);				
	ЗначениеВДанныеФормы(ОбъектДеревоСообщений, ДеревоСообщений);
КонецПроцедуры

&НаСервере
// Получает Адрес временного хранилища на Список сообщений по указанному заголовку.
// Для оптимизации сначала выполняется поиск адреса временного хранилища в кэше.
// Если не найден, то выполняется загрузка сообщений из базы по ключу журнала сообщений из данных заголовка. 
// Найденное значение добавляется в кэш.  
//
// Параметры:
//   ЗаголовокЖурналаСообщений - Структура - заголовок журнала сообщений, содержащий ключ журнала.
//
// Возвращаемое значение:
//   Строка - адрес временного хранилища с журналом сообщений
Функция ПолучитьСообщенияЖурнала(Знач ЗаголовокЖурналаСообщений)
	Если ЗаголовокЖурналаСообщений = неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Кэш
	ОбъектКэшЖурналаСообщений = РеквизитФормыВЗначение("КэшЖурналаСообщений");
	
	// может данный Журнал сообщений уже есть в кэше?
	СтрокаТЗ = ОбъектКэшЖурналаСообщений.Найти(ЗаголовокЖурналаСообщений.КлючЖурналаСообщений, "КлючЖурналаСообщений");
	
	Если СтрокаТЗ = неопределено Тогда 
		ЖурналСообщений = Новый Структура();
		ЖурналСообщений.Вставить("Заголовок", УН_СписокСообщенийКлиентСервер.НовыйСтруктураЗаголовкаСообщения());
		ЖурналСообщений.Вставить("Сообщения");
		
		ЗаполнитьЗначенияСвойств(ЖурналСообщений.Заголовок, ЗаголовокЖурналаСообщений);
	
		Сообщения = УН_ЖурналСообщений.ЗаполнитьСообщения(ЖурналСообщений.Заголовок.КлючЖурналаСообщений);
		ЖурналСообщений.Сообщения = Сообщения;
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ЖурналСообщений, ЭтаФорма.УникальныйИдентификатор); 
					
		// добавляем сообщения в кэш  
		НоваяСтрока = ОбъектКэшЖурналаСообщений.Добавить();
		НоваяСтрока.КлючЖурналаСообщений = ЖурналСообщений.Заголовок.КлючЖурналаСообщений;
		НоваяСтрока.АдресВременногоХранилища = АдресВременногоХранилища;
	Иначе
		// читаем сообщения из кэша
		АдресВременногоХранилища = СтрокаТЗ.АдресВременногоХранилища;	
	КонецЕсли; 
		
	// возвращаем данные на клиент
	ЗначениеВРеквизитФормы(ОбъектКэшЖурналаСообщений,"КэшЖурналаСообщений");
	Возврат АдресВременногоХранилища; 
КонецФункции

// Устанавливает текущего пользователя в качестве значения по умолчанию для критерия пользователя.
//
&НаСервере
Процедура УстановитьПользователяПоУмолчанию()
	ОбъектКритерийПользователь = РеквизитФормыВЗначение("КритерийПользователь");
	ОбъектКритерийПользователь.Очистить();
	НовыйКритерий = ОбъектКритерийПользователь.Добавить();
	НовыйКритерий.Пользователь = Пользователи.ТекущийПользователь();
	ЗначениеВРеквизитФормы(ОбъектКритерийПользователь,"КритерийПользователь");
КонецПроцедуры

#КонецОбласти



