///////////////////////////////////////////////////////////////////////////////////////////////////////
// УН_ИмущественныйКомлпексСервисКлиентВызовСервера
// 
// Вспомогательные процедуры и функции для работы с Имущественными комплексами
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс    

// Возвращает фиксированную структуру с реквизитами объекта "Имущественный комплекс".
//
// Возвращаемое значение:
//   Структура - набор реквизитов основных данных объекта "Имущественный комплекс"
//       Код                              - Строка - Код
//       Наименование                     - Строка - Наименование
//       ПометкаУдаления                  - Булево - Пометка удаления
//       Идентификатор                    - Строка - Идентификатор
//       ПолноеНаименование               - Строка - Полное наименование
//       Организация                      - СправочникСсылка.Организации - Организация
//       ТипИмущественногоКомплекса       - СправочникСсылка.УН_ТипыИмущественныхКомплексов - Тип имущественного комплекса
//       ДействуетС                       - Дата - Действует с
//       ДействуетПо                      - Дата - Действует по
//       ФункциональноеНазначение         - СправочникСсылка.УН_ФункцииДляИмущественныхКомплексов - Функциональное назначение
//       ГруппаПолномочий                 - СправочникСсылка.УН_ГруппыПолномочий - Группа полномочий
//       Ответственный                    - СправочникСсылка.Пользователи - Ответственный
//       ИсторическийНомер                - Строка - Исторический номер
//       КадастровыйНомер                 - Строка - Кадастровый номер
//       ДатаПрисвоенияКадастровогоНомера - Дата - Дата присвоения кадастрового номера
//       УсловныйНомер                    - Строка - Условный номер
//       Автор                            - СправочникСсылка.Пользователи - Автор
//       ДатаВремяСоздания                - Дата - Дата и время создания
//       ПоследнимИзменил                 - СправочникСсылка.Пользователи - Последним изменил
//       ДатаВремяПоследнегоИзменения     - Дата - Дата и время последнего изменения
//
Функция НовыйСтруктураИмущественныйКомплекс() Экспорт
	ОсновныеДанные = Новый Структура;
	
	// Стандартные реквизиты
	ОсновныеДанные.Вставить("Код", "");
	ОсновныеДанные.Вставить("Наименование", "");
	ОсновныеДанные.Вставить("ПометкаУдаления", Ложь);
	
	// Реквизиты справочника
	ОсновныеДанные.Вставить("Идентификатор", "");
	ОсновныеДанные.Вставить("ПолноеНаименование", "");
	ОсновныеДанные.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ОсновныеДанные.Вставить("ТипИмущественногоКомплекса", Справочники.УН_ТипыИмущественныхКомплексов.ПустаяСсылка());
	ОсновныеДанные.Вставить("ДействуетС", Дата(1,1,1));
	ОсновныеДанные.Вставить("ДействуетПо", Дата(1,1,1));
	ОсновныеДанные.Вставить("ФункциональноеНазначение", Справочники.УН_ФункцииДляИмущественныхКомплексов.ПустаяСсылка());
	ОсновныеДанные.Вставить("ГруппаПолномочий", Справочники.УН_ГруппыПолномочий.ПустаяСсылка());
	ОсновныеДанные.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	ОсновныеДанные.Вставить("ИсторическийНомер", "");
	ОсновныеДанные.Вставить("КадастровыйНомер", "");
	ОсновныеДанные.Вставить("ДатаПрисвоенияКадастровогоНомера", Дата(1,1,1));
	ОсновныеДанные.Вставить("УсловныйНомер", "");
	ОсновныеДанные.Вставить("Автор", Справочники.Пользователи.ПустаяСсылка());
	ОсновныеДанные.Вставить("ДатаВремяСоздания", Дата(1,1,1));
	ОсновныеДанные.Вставить("ПоследнимИзменил", Справочники.Пользователи.ПустаяСсылка());
	ОсновныеДанные.Вставить("ДатаВремяПоследнегоИзменения", Дата(1,1,1));
	
	Возврат ОсновныеДанные;
КонецФункции



// Создает новый имущественный комплекс на сервере на основе переданных основных данных.
//
// Параметры:
//   ОбъектФормы - ДанныеФормыСтруктура - объект формы, в который будут переданы данные имущественного комплекса
//   ОсновныеДанныеИмущественногоКомплекса - Структура - основные данные имущественного комплекса
//
// Возвращаемое значение:
//   Булево - признак успешного создания имущественного комплекса
Функция НовыйИмущественныйКомплексНаСервере(ОбъектФормы, Знач ОсновныеДанныеИмущественногоКомплекса) Экспорт;		
	Попытка
		ИК = УН_ИмущественныйКомплексФабрика.Создать(ОсновныеДанныеИмущественногоКомплекса); 
		ИК.МенеджерИзмерений();
	
		ЗначениеВДанныеФормы(ИК, ОбъектФормы); 
		Возврат Истина;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
КонецФункции





#КонецОбласти 