#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	КоличествоОшибки 		 = 0;
	КоличествоПредупреждения = 0;
	КоличествоИнформация 	 = 0;
	
	Если Параметры.Свойство("АдресСпискаСообщений", АдресСпискаСообщений) Тогда
		Если ЭтоАдресВременногоХранилища(АдресСпискаСообщений) Тогда	
			ДанныеЗаголовка 		 = УН_СписокСообщений.ДанныеЗаголовкаСообщений(АдресСпискаСообщений); 
			КоличествоОшибки 		 = ДанныеЗаголовка.КоличествоОшибки;
			КоличествоПредупреждения = ДанныеЗаголовка.КоличествоПредупреждения;
			КоличествоИнформация 	 = ДанныеЗаголовка.КоличествоИнформация;			
		КонецЕсли;
	КонецЕсли;

	// обновить количество сообщений на кнопках
	Команды["Ошибки"].Заголовок		 	= КоличествоОшибки; 
	Команды["Предупреждения"].Заголовок = КоличествоПредупреждения; 
	Команды["Информация"].Заголовок  	= КоличествоИнформация;
КонецПроцедуры 


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// установить состояние кнопок отбора по типу сообщений (по умолчанию показываем все сооббщения)
	УстановитьПараметрыОтбораСообщений(Истина,Истина,Истина);
	
	// получить параметры отбора
	Отбор = ПараметрыОтбораСообщений(); 
	
	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	УстановитьОтборДляСообщений(АдресСпискаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы  

&НаКлиенте
// Открывает окно с расширенным текстом сообщения
Процедура ДопТекст(Команда)  
	ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
	УН_СписокСообщенийКлиент.ПоказатьОкноСРасширеннымТекстомСообщения(ТекущиеДанные, ЭтотОбъект);
КонецПроцедуры   

&НаКлиенте 
// Открывает окно с данными контекста сообщения
Процедура Контекст(Команда)
	ТекущиеДанные 	= Элементы.ДеревоСообщений.ТекущиеДанные;
	УН_СписокСообщенийКлиент.ПоказатьОкноСКонтекстомСообщения(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
// Устанавливает/снимает отбор сообщений с типом Ошибка
Процедура Ошибки(Команда)
	Кнопка = Элементы.ФормаОшибки; 
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;		
	КонецЕсли;
	Отбор = ПараметрыОтбораСообщений(); 
	
	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	УстановитьОтборДляСообщений(АдресСпискаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры

&НаКлиенте 
// Устанавливает/снимает отбор сообщений с типом Предупреждение
Процедура Предупреждения(Команда)
	Кнопка = Элементы.ФормаПредупреждения; 
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;	
	КонецЕсли;  
	Отбор = ПараметрыОтбораСообщений();   

	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	УстановитьОтборДляСообщений(АдресСпискаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);	
КонецПроцедуры

&НаКлиенте 
// Устанавливает/снимает отбор сообщений с типом Информация
Процедура Информация(Команда)
	Кнопка = Элементы.ФормаИнформация;	
	Если Кнопка.Пометка Тогда
		// Вкл -> Выкл
		Кнопка.Пометка = Ложь;
	Иначе 
		// Выкл -> Вкл
		Кнопка.Пометка = Истина;	
	КонецЕсли;      
	Отбор = ПараметрыОтбораСообщений();	 
	
	// вывести список сообщений с учетом отбора
	ДеревоСообщенийРеквизит = ДеревоСообщений;
	ДеревоСообщенийРеквизит.ПолучитьЭлементы().Очистить();	
	УстановитьОтборДляСообщений(АдресСпискаСообщений, Отбор, ДеревоСообщенийРеквизит);
	КопироватьДанныеФормы(ДеревоСообщенийРеквизит,ДеревоСообщений);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	ТекущаяСтрока = Элементы.ДеревоСообщений.ТекущаяСтрока;
	Элементы.ДеревоСообщений.Свернуть(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	ТекущаяСтрока = Элементы.ДеревоСообщений.ТекущаяСтрока;
	Элементы.ДеревоСообщений.Развернуть(ТекущаяСтрока,Истина);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСообщений

&НаКлиенте
// Открывает окно с расширенным текстом сообщения
Процедура ДеревоСообщенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ДеревоСообщений.ТекущиеДанные;
	
	// имя поля содержащего картинку, если есть Контекст
	ПолеКонтекстСКартинкой = "ДеревоСообщенийЕстьКонтекстКартинка";

	Если Поле.Имя = ПолеКонтекстСКартинкой Тогда
		УН_СписокСообщенийКлиент.ПоказатьОкноСКонтекстомСообщения(ТекущиеДанные);
	Иначе
		УН_СписокСообщенийКлиент.ПоказатьОкноСРасширеннымТекстомСообщения(ТекущиеДанные, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры


// Обновляет статус элементов управления
&НаКлиенте
Процедура ДеревоСообщенийПриАктивизацииСтроки(Элемент)
	УстановитьСтатусЭлементовУправленияПоСообщению(Элемент.ТекущиеДанные);	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции 
&НаКлиенте
// Устанавливает состояние кнопок отбора по типу сообщения
// Параметры:
//  Ошибки 		   - Булево - если Истина, кнопка "Ошибки" становится нажатой
//  Предупреждения - Булево - если Истина, кнопка "Предупреждения" становится нажатой
//  Информация 	   - Булево - если Истина, кнопка "Информация" становится нажатой
Процедура УстановитьПараметрыОтбораСообщений(Знач Ошибки, Знач Предупреждения, Знач Информация)
	КнопкаОшибки 		 = Элементы.ФормаОшибки;  
	КнопкаПредупреждения = Элементы.ФормаПредупреждения;
	КнопкаИнформация 	 = Элементы.ФормаИнформация;

	// Ошибки
	Если Ошибки Тогда
		КнопкаОшибки.Пометка = Истина;
	Иначе 
		КнопкаОшибки.Пометка = Ложь;
	КонецЕсли;
		
	// Предупреждения
	Если Ошибки Тогда
		КнопкаПредупреждения.Пометка = Истина;
	Иначе 
		КнопкаПредупреждения.Пометка = Ложь;
	КонецЕсли;
	
	// Информация
	Если Ошибки Тогда
		КнопкаИнформация.Пометка = Истина;
	Иначе 
		КнопкаИнформация.Пометка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Возвращает параметры отбора сообщений, которые соответсвуют текущему состоянию кнопок: Ошибки, Предупреждения, Инфомация
// Возвращаемое значение:
//  Структура (ключ - значение). Содержит три элемента в следующем порядке: Ошибка, Предупреждение, Информация.
// 		Элемент структуры:
//			Ключ 	 - значение перечисления УН_ТипыСообщений.
//			Значение - булево. Содержит Истина, если соответсвующая кнопка нажата на форме и Ложь - в противном случае.
Функция ПараметрыОтбораСообщений()
	Ошибка = ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Ошибка");
	Предупреждение = ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Предупреждение");
	Информация = ПредопределенноеЗначение("Перечисление.УН_ТипыСообщений.Информация");
		
	Результат = Новый Структура();
	Результат.Вставить(Ошибка,Элементы.ФормаОшибки.Пометка); 
	Результат.Вставить(Предупреждение,Элементы.ФормаПредупреждения.Пометка);
	Результат.Вставить(Информация,Элементы.ФормаИнформация.Пометка);

	Возврат Результат; 
КонецФункции

// Заполняет дерево сообщений в соответствии с указанными типами сообщений.
//
// Параметры:
//   АдресСпискаСообщений 	- Строка - Адрес временного хранилища, содержащего список сообщений
//   ТипыСообщений 			- Структура - Типы сообщений, по которым необходимо произвести отбор
//   ДеревоСообщений 		- ДанныеФормыДерево - Элемент формы, в который будет выгружен отфильтрованный список сообщений
&НаСервереБезКонтекста
Процедура УстановитьОтборДляСообщений(Знач АдресСпискаСообщений, Знач ТипыСообщений, ДеревоСообщений)
// ПРЕДПОСЫЛКИ	
	Если ЭтоАдресВременногоХранилища(АдресСпискаСообщений) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДеревоСообщений = Неопределено Тогда
		Возврат;
	КонецЕсли; 

// ОСНОВНАЯ ЧАСТЬ	
	СписокСообщений = УН_СписокСообщений.СписокСообщенийИзВременногоХранилища(АдресСпискаСообщений);
	// может быть нет данных => выходим
	Если СписокСообщений.Сообщения.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектДеревоСообщений = ДанныеФормыВЗначение(ДеревоСообщений,Тип("ДеревоЗначений")); 
	ОбъектДеревоСообщений.Строки.Очистить();
	УН_СписокСообщений.ВыгрузитьСообщенияВДеревоЗначений(СписокСообщений.Сообщения, ОбъектДеревоСообщений, ТипыСообщений);				
	ЗначениеВДанныеФормы(ОбъектДеревоСообщений, ДеревоСообщений);
КонецПроцедуры


&НаКлиенте
// Устанавливает состояние элементов управления на форме в зависимости от выбранного сообщения
// Параметры:
//  ДанныеСообщения - СтрокаДереваЗначений - Содержит данные текущей строки табличного поля
Процедура УстановитьСтатусЭлементовУправленияПоСообщению(Знач ДанныеСообщения)
	// Определяем наличие доп. текста и контекста
	ЕстьДопТекст = ?(ДанныеСообщения = Неопределено, Ложь, ДанныеСообщения.ЕстьДопТекст);
	ЕстьКонтекст = ?(ДанныеСообщения = Неопределено, Ложь, ДанныеСообщения.ЕстьКонтекст);
	
	// Имена элементов управления
	ИмяКнопкиПоказатьТекст 	  = "КнопкаПоказатьСообщение";
	ИмяКнопкиПоказатьКонтекст = "КнопкаПоказатьКонтекстСообщения";
	
	// Устанавливаем доступность кнопок
	УстановитьДоступностьКнопки(ИмяКнопкиПоказатьТекст, ЕстьДопТекст);
	УстановитьДоступностьКнопки(ИмяКнопкиПоказатьКонтекст, ЕстьКонтекст);
КонецПроцедуры

&НаКлиенте
// Устанавливает доступность кнопки
// Параметры:
//  * ИмяКнопки 	- Строка - Имя кнопки
//  * Доступность 	- Булево - Доступность кнопки
Процедура УстановитьДоступностьКнопки(ИмяКнопки, Доступность)
	Кнопка = Элементы.Найти(ИмяКнопки);
	Если Кнопка <> Неопределено Тогда
		Кнопка.Доступность = Доступность;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти