////////////////////////////////////////////////////////////////////////////////
// Бизнес-объект
// 
// Реализует функции, общие для всех бизнес-объектов
////////////////////////////////////////////////////////////////////////////////   


#Область ПрограммныйИнтерфейс 

// Возвращает бизнес-номер объекта (возможно имеет смысл вынести в отдельный модуль)
Функция Идентификатор(Объект) Экспорт;  
	Результат = Неопределено;
	
	Если Объект = Неопределено Тогда
		// Обработка ошибок
		Сообщить("Невозможно получить свойства объекта ""Имущественный комплекс"", объект неопрелен");  
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат = Объект.Идентификатор;
	Исключение
		// Обработка ошибок
		Сообщить("Невозможно получить значение свойства ""Идентификатор""");  
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции

// Возвращает Тип бизнес-объекта (ссылка на элемент справочника)  
Функция ТипБизнесОбъекта(Объект) Экспорт;
	Результат = Неопределено;
	
	Если Объект = Неопределено Тогда
		// Обработка ошибок
		Сообщить("Невозможно получить свойства объекта ""Имущественный комплекс"", объект неопрелен");  
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат = Объект.ДополнительныеСвойства.ТипОбъекта;
	Исключение
		// Обработка ошибок
		Сообщить("Невозможно получить значение свойства ""ТипБизнесОбъекта""");  
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции

// Используется при создании объекта в режиме: Создание, Изменение или Просмотр
Процедура ИнициализироватьБизнесОбъект(Объект)
	// Проверки и предпосылки
	Если Объект = Неопределено Тогда 
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено("Объект");
	КонецЕсли;
	

	// Инициализация данных
	Инициализировать(Объект);


	// Заполнение значений по умолчанию для новых объектов
	УстановитьЗначенияПоУмолчанию(Объект);


	// Проверка возможности редактирования объекта
	//	системный статус: объект может быть помечен на удаление
	//	пользовательский статус: запрещает редактирование объекта


	// Регистрация всех потомков объекта (только для нового объекта)
	Если Объект.ДополнительныеСвойства.Режим = Перечисления.УН_РежимОбъекта.Создание Тогда
		Объект.ЗарегистрироватьВсехПотомков();
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти  



#Область СлужебныеПроцедурыИФункции   

Процедура Инициализировать(Объект)
	// что-то делаем...
КонецПроцедуры




Процедура УстановитьЗначенияПоУмолчанию(Объект)
	// что-то делаем...
КонецПроцедуры

#КонецОбласти 

