////////////////////////////////////////////////////////////////////////////////
// Общий модуль УН_СписокСообщенийВызовСервера
// 
// Реализует методы для работы с документацией к сообщению
//////////////////////////////////////////////////////////////////////////////// 

#Область ПрограммныйИнтерфейс   

// Получает адрес документации во временном хранилище.
//
// Параметры:
//   ДанныеСообщения - Структура - содержит данные сообщения.
//
// Возвращаемое значение:
//   Строка - Адрес документации во временном хранилище, Неопределено, если данные сообщения не определены.
Функция ПолучитьАдресДокументацииВоВременномХранилище(Знач ДанныеСообщения) Экспорт;
	Если ДанныеСообщения = Неопределено Тогда
		Возврат неопределено;
	КонецЕсли;
  
	ДокументацияHTML = ДокументацияHTML(ДанныеСообщения);
	
	// АдресДокументации
	Возврат ПоместитьВоВременноеХранилище(ДокументацияHTML); 
КонецФункции


// Формирует HTML-документацию для сообщения.
//
// Параметры:
//   ДанныеСообщения - Структура - данные сообщения, содержащие ссылку, текст сообщения, код предметной области и номер сообщения
//
// Возвращаемое значение:
//   Строка - HTML-документация сообщения
Функция ДокументацияHTML(Знач ДанныеСообщения) Экспорт
	Если ДанныеСообщения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// получаем шаблон html 
	ШаблонОформленияПоУмолчанию = Константы.УН_ШаблонОформленияТекстаСообщения.Получить();
	Если ЗначениеЗаполнено(ШаблонОформленияПоУмолчанию) Тогда
		ШаблонHTML = Новый ТекстовыйДокумент;
		ШаблонHTML.УстановитьТекст(ПолучитьОбщийМакет(ШаблонОформленияПоУмолчанию).ПолучитьТекст());
		ШаблонTEXT = ШаблонHTML.ПолучитьТекст();
	Иначе
		// шаблон текста по умолчанию
		ШаблонTEXT = ШаблонДополнительногоТекстаПоУмолчанию();
	КонецЕсли;	
	
	СообщениеСсылка = ДанныеСообщения.Ссылка;	

	// получаем параметры для замещения в HTML
	ТипСообщения = ДанныеСообщения.ТипСообщения;
	ТекстСообщения = ДанныеСообщения.ТекстСообщения; 	
	КодПредметнойОбласти = ДанныеСообщения.КодПредметнойОбласти;
	НомерСообщения = ДанныеСообщения.НомерСообщения;
	КлючСообщения = СтрШаблон("Код: %1 %2",
		Строка(КодПредметнойОбласти),
		Строка(НомерСообщения));
		
	// дополнительный текст	
	ХранилищеДополнительногоТекста = СообщениеСсылка.ДополнительныйТекст;
	Если ТипЗнч(ХранилищеДополнительногоТекста) = Тип("ХранилищеЗначения") Тогда
		Документ = ХранилищеДополнительногоТекста.Получить();
		
	    Если ТипЗнч(Документ) = Тип("ФорматированныйДокумент") Тогда
	        ДополнительныйТекстHTML = УН_HTMLСервисВызовСервера.СформироватьHTMLИзФорматированногоДокумента(Документ);
	    ИначеЕсли ТипЗнч(Документ) = Тип("Строка") Тогда
	        ДополнительныйТекстHTML = Документ;
	    Иначе
	    	ДополнительныйТекстHTML = "";
	    КонецЕсли; 		
	Иначе
		ДополнительныйТекстHTML = "";	
	КонецЕсли;
	
	ДополнительныйТекст = УН_HTMLСервис.ПолучитьТелоHTML(ДополнительныйТекстHTML);
	
	// замещение параметров
	Поле_HTML = ШаблонTEXT; 
	Если ЗначениеЗаполнено(ШаблонTEXT) Тогда
		Поле_HTML = СтрЗаменить(Поле_HTML, "%ТекстСообщения%", ТекстСообщения);
		Поле_HTML = СтрЗаменить(Поле_HTML, "%КлючСообщения%", КлючСообщения);
		Поле_HTML = СтрЗаменить(Поле_HTML, "%КодПредметнойОбласти%", КодПредметнойОбласти);
		Поле_HTML = СтрЗаменить(Поле_HTML, "%НомерСообщения%", НомерСообщения);
		Поле_HTML = СтрЗаменить(Поле_HTML, "%ТипСообщения%", ТипСообщения);
		Поле_HTML = СтрЗаменить(Поле_HTML, "%ДополнительныйТекст%", ДополнительныйТекст);
	КонецЕсли; 
	
	Возврат Поле_HTML;
КонецФункции
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Функция ШаблонДополнительногоТекстаПоУмолчанию()
	Возврат "
		|%ТекстСообщения%
		|%КлючСообщения%
		|
		|
		|%ДополнительныйТекст%";
КонецФункции

#КонецОбласти