////////////////////////////////////////////////////////////////////////////////
// Базовый объект
// Серверные процедуры и функции, предназначенные для реализации паттерна Композит
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс  
// Регистрирует объект-потомок в объекте-родителе.
//
// Параметры:
//   Объект 		  - ОбъектМетаданных - объект-родитель, в котором регистрируется потомок
//   НазваниеПотомка  - Строка - имя объекта-потомка, определяемое в модуле-фабрике этого потомка
//   Потомок 		  - ОбъектМетаданных - ссылка на объект-потомок
Процедура ЗарегистрироватьПотомка(Объект, НазваниеПотомка, Потомок) Экспорт;
	// Проверяем входные данные
	Если Объект = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено(Объект);
	КонецЕсли;
	
	Если НазваниеПотомка = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено(НазваниеПотомка);
	КонецЕсли;
	
	Если Потомок = Неопределено Тогда
		УН_ИсключенияВызовСервера.ВызватьИсключениеЗначениеНеопределено(Потомок);
	КонецЕсли;
	
	// проверяем, что объект подерживает свойство "ДополнительныеСвойства.Потомки"	
	Если Объект.ДополнительныеСвойства.Свойство("Потомки") Тогда
		// добавляем
		Объект.ДополнительныеСвойства.Потомки.Вставить(НазваниеПотомка,Потомок);	
	Иначе
		Ун_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("Потомки", "Объект.ДополнительныеСвойства");
	КонецЕсли;  
	

КонецПроцедуры

// Выполняет регистрацию всех потомков объекта и добавляет их в свойство "ДополнительныеСвойства.Потомки".
//
// Параметры:
//   Объект - Произвольный - Объект, для которого необходимо зарегистрировать потомков
Процедура ЗарегистрироватьВсехПотомков(Объект) Экспорт; 
	// Зарегистрировать Потомков к объекту
	ОбъектЗарегистрироватьВсехПотомков(Объект);
	
	// Получить по настройке все активные расширения для Объекта
	// ...
	
	// Зарегистрировать расширения для Объекта
	// ...
	
	// Регистрируем Потомков для Потомков
	Для каждого Потомок из Объект.ДополнительныеСвойства.Потомки Цикл
		ЗарегистрироватьВсехПотомков(Объект);
		
		// Получить по настройке все активные расширения для Объекта
		// ...
		
		// Зарегистрировать расширения для Объекта
		// ...
	КонецЦикла;		
КонецПроцедуры



// Добавляет ссылку на объект-расширение в свойство "ДополнительныеСвойства.Расширения" объекта
// Расширение добавляется к родительскому объекту по Имени расширения.
// Предпосылки:
//  1) Расширения должны быть предварительно зарегистрированы в настройке (см. РС "УН_РасширенияБизнесОбъектов"). 
//  2) Объект метаданных, на базе которого реализуется расширение должен быть создан
// 
// Параметры:
//  ИмяРасширения - Строка - Имя пользовательского расширения
Процедура ЗарегистрироватьРасширение(Объект, ИмяРасширения) Экспорт;     
	// Создаем расширение
	Попытка
		Расширение = УН_БазовыйОбъектРасширениеФабрика.Создать(Объект, ИмяРасширения);
	Исключение
		Возврат
	КонецПопытки;
	

	// устанавливаем блокировку
	// Если Режим = Создание или Изменение
	// 	УстановитьБлокировкуДанныхРасширения()
	// КонецЕсли
	
	// проверяем, что объект подерживает свойство "ДополнительныеСвойства.Потомки"	
	Если Объект.ДополнительныеСвойства.Свойство("ПользовательскиеОбъекты") = Ложь Тогда
		Ун_ИсключенияВызовСервера.ВызватьИсключениеСвойствоНеСуществует("ПользовательскиеОбъекты", "Объект.ДополнительныеСвойства");
	КонецЕсли;  
	
    // Если ошибок не возникло => добавляем ссылку на созданное расширение в объект
	Объект.ДополнительноеСвойство.ПользовательскиеОбъекты.Вставить(ИмяРасширения, Расширение);    
КонецПроцедуры



// Выполняет общие действия связанные с начальным наполнением Объекта данными при копировании из другого Объекта
// 
// Параметры:
//  Образец - объект - исходный объект
//  Объект - объект - целевой объект
Процедура ИнициализироватьПоОбразцу(Объект, Образец) Экспорт; 
	
КонецПроцедуры


// Инициирует проверку объекта, его потомков и расширений.
// Функция возвращает результат проверки в виде Журнала сообщений.
// На уровне конкретного объекта и расширения должны быть реализованы проверки в методе ОбъектПроверитьВсе()
//
// Параметры:
//  Объект - объект - проверяемый объект
//  Результат - объект - Журнал сообщений
Процедура ПроверитьВсе(Объект, ЖурналСообщений) Экспорт;
	// вызвать метод ОбъектПроверить() для проверки основных данных Объекта
	ОбъектПроверить(Объект, ЖурналСообщений);
	
	// проверка данных расширений к Объекту 
    Расширения = Объект.ДополнительныеСвойства.Расширения;
	Для каждого Расширение из Расширения Цикл
		Расширение.ПроверитьВсе(Расширение, ЖурналСообщений);
	КонецЦикла;
	
	// проверка данных потомков (и их расширений, если есть)
	Потомки = Объект.ДополнительныеСвойства.Потомки;  
	Для каждого Потомок из Потомки Цикл
		Потомок.ПроверитьВсе(Потомок, ЖурналСообщений);
	КонецЦикла;	
КонецПроцедуры 


// Реализует процесс проверки и записи данных объекта, включая данные всех его потомков и расширений в базу данных в рамках одной транзакции.  
// На уровне конкретного объекта и расширения должны быть реализованы сами методы которые реализуют функциональность сохранения ОбъектЗаписать()
//
// Параметры:
//  Объект - ОбъектМетаданных - записываемый объект
//  ЖурналСообщений - СТруктура - журнал сообщений для записи ошибок
Процедура ЗаписатьВсе(Объект, ЖурналСообщений)  Экспорт;
	РежимПросмотр = Перечисления.УН_РежимОбъекта.Просмотр;
	Режим = Объект.ДополнительныеСвойства.Режим;
	Если Режим = РежимПросмотр Тогда
		
		Возврат;
	КонецЕсли;
	
	
	ЕстьОшибка = Ложь;
	// выполнить проверку объекта и подчиненных объектов
	ПроверитьВсе(Объект, ЖурналСообщений);
	
	// если есть сообщения с типом "Ошибка" - отменить сохранение объекта
	Если ЕстьОшибка Тогда
		Возврат;
	КонецЕсли;	
	
	// если нет сообщений с типом "ошибка" - выполниить сохранение объекта, его потомков и расширений в рамках одной транзакции  
	НачатьТранзакцию();
	Попытка
		// записываем данные самого объекта
		ОбъектЗаписать(Объект, ЖурналСообщений);
		
		// записываем данные расширений объекта
		Расширения = Объект.ДополнительныеСвойства.Расширения;
		Для каждого Расширение из Расширения Цикл
			Расширение.РасширениеЗаписать(Расширение, ЖурналСообщений);
		КонецЦикла;
						
		// записываем данные потомков
		Потомки = Объект.ДополнительныеСвойства.Потомки;
		Для каждого Потомок из Потомки Цикл
			Потомок.ЗаписатьВсе(Потомок, ЖурналСообщений);
		КонецЦикла;		

		ЗафиксироватьТранзакцию();
		
		// изменить режим объекта
		Объект.ДополнительныеСвойства.Режим = РежимПросмотр;
	Исключение            
		// Обрабока ошибок во время транзакции
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

// Устанавливает режим для объекта (Создание/Изменение/Просмотр)
// 
// Параметры:
//  Объект - ОбъектМетаданных - объект, для которого требуется установить Режим
//  Режим - ПеречислениеСсылка.УН_РежимОбъекта - значение Режима
Процедура УстановитьРежим(Объект, Знач Режим) Экспорт;
	Если Объект = Неопределено Тогда
		Выражение = СтрШаблон("Значение %1 не определено", "Режим");
		Категория = КатегорияОшибки.ОшибкаКонфигурации;
		Код		  = "А0001";
		ДопИнфо   = "Значение не должно быть Неопределено";
		ВызватьИсключение(Выражение, Категория,Код, ДопИнфо);
	КонецЕсли;

	Если Режим = Неопределено Тогда
		Выражение = СтрШаблон("Значение %1 не определено", "Режим");
		Категория = КатегорияОшибки.ОшибкаКонфигурации;
		Код		  = "А0001";
		ДопИнфо   = "Значение не должно быть Неопределено";
		ВызватьИсключение(Выражение, Категория,Код, ДопИнфо);
	КонецЕсли;
	
	Если Метаданные.Перечисления.УН_РежимОбъекта.ЗначенияПеречисления.Найти(Режим) = Неопределено Тогда
		Выражение = СтрШаблон("Значение %1 переменной %2 не соответсвует типу %3", "Перечисления.УН_РежимОбъекта");
		Категория = КатегорияОшибки.ОшибкаКонфигурации;
		Код		  = "А0002";
		ДопИнфо   = "Некорректный тип переменной";
		ВызватьИсключение(Выражение, Категория,Код, ДопИнфо);
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Режим = Режим; 			
КонецПроцедуры


// Возвращает режим Объекта (Создание/Изменение/Просмотр)   
// Устанавливает режим для объекта (Создание/Изменение/Просмотр)
// 
// Параметры:
//  Объект - ОбъектМетаданных - объект, для которого требуется установить Режим
// Возвращаемое значение: 
//  Строка - значение Перечисления.УН_РежимОбъекта
Функция Режим(Объект) Экспорт;  
	Возврат Объект.ДополнительныеСвойства.Режим;	
КонецФункции


// Заполнить из временного хранилища
Процедура ЗаполнитьИзВременногоХранилища(Объект, Знач Адрес) Экспорт
	
	// заполняем данные самого объекта
	Если Адрес <> Неопределено Тогда
		ОбъектЗаполнитьИзВременногоХранилища(Объект, Адрес);
	КонецЕсли;
	
	Для каждого Потомок из Объект.ДополнительныеСвойства.Потомки Цикл
		ЗаполнитьИзВременногоХранилища(Объект, Адрес);	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти      


#Область СлужебныеПроцедурыИФункции 

// Реализует конкретную функциональность проверки объекта
Процедура ОбъектПроверить(Объект, ЖурналСообщений)
	// переопределяется в наследниках
КонецПроцедуры    


// Реализует конкретную функциональность записи объекта в базу (сохранения изменений)
Процедура ОбъектЗаписать(Объект, ЖурналСообщений)
	// переопределяется в наследниках
КонецПроцедуры 

// Реализует конкретную функциональность регистрации всех потомков
// Метод переопределяется в наследниках
Процедура ОбъектЗарегистрироватьВсехПотомков(Объект)
	// переопределяется в наследниках
КонецПроцедуры

// Реализует конкртеную функциональность заполнения данных объекта из врем.хранилища
Процедура ОбъектЗаполнитьИзВременногоХранилища(Объект, Знач Адрес)
	// переопределяется в наследниках
КонецПроцедуры


#КонецОбласти 
